export default {
  game: '游戏',
  games: '游戏',
  about: '关于',
  tryNow: '立即试玩',
  comingSoon: '敬请期待',
  newGames: '最新游戏',
  release: '发布',
  newGamesDesc: '最新、最火热的全新在线娱乐游戏热腾腾上架、就等你来一探究竟！',
  allGames: '全部游戏',
  gameTypes: '游戏类型',
  gameTypesDesc: '完美复刻受欢迎经典游戏、开发独特新玩法原创游戏，多元游戏类型，满足你的各种在线娱乐需求！',
  gameSlot: '老虎机',
  gameFish: '捕鱼机',
  gameArcade: '街机',
  gameCard: '棋牌',
  gameBingo: '宾果',
  all: '全部游戏',
  gameDesc: '多样化在线娱乐解决方案，打鱼机、角子机、棋牌游戏、宾果等，满足各种需求，给你最刺激又难忘的游戏体验！',
  hotGames: '热门游戏',
  gameDeveloper: '线上游戏开发霸主',
  gameDeveloperDesc:
    'BG夺宝电子以开发老虎机(角子机)起家，并拥有亚洲最大老虎机台制造商独家授权，首开亚洲先锋整合线下到线上娱乐，指尖上便能享受如同亲临赌场般的刺激游玩体验，并以捕鱼机、老虎机、宾果、棋牌、街机游戏等多元游戏种类制霸市场！BG夺宝电子以稳定、可靠且值得信赖的全方位服务品质引以为傲，也深受玩家及合作伙伴的青睐与喜爱。持续开发创新的游戏玩法，提供玩家流畅游玩环境及卓越的游戏体验是我们坚持努力的目标，BG夺宝电子是您在线上娱乐领域的最佳合作伙伴！',
  iGamingProviders: '线上游戏开发商第一首选！',
  iGamingProvidersDesc:
    'BG夺宝电子积极进军国际市场，并陆续获得市场上的广大回响。我们能够为合作伙伴提供全面且专业的服务，包括全年无休技术支援、安全可靠API快速串接、透过大数据分析提升玩家游戏体验等等。 BG夺宝电子相信，与合作伙伴共同创造更优秀的产品和服务，将能够为玩家带来更多美好的游玩历程，进而创造出更大的商机！',
  gameFeatures: '游戏特色',
  allrounded: '游戏种类多元',
  allroundedDesc:
    '作为一富具经验的游戏开发商，BG夺宝电子供应了多样类型的线上游戏，除了在亚洲极受欢迎的捕鱼机游戏外，更多的有老虎机(角子机)、宾果、棋牌、街机游戏及其他街机游戏等等，让你玩不尽玩不腻！',
  classicGaming: '完美复刻经典',
  classicGamingDesc:
    '承袭线下游戏优点，BG夺宝电子将备受欢迎的经典游戏完美复刻至线上平台，并将线上游戏优化、发展再进化，让玩家只需动动手指，即刻仿佛置身赌场体验捕鱼机、老虎机等游玩快感！',
  originalMasterpieces: '打造原创大作',
  originalMasterpiecesDesc:
    'BG夺宝电子洞察市场趋势，持续尝试各种线上游戏新玩法及开发多元游戏类型，大至操作功能、小至图腾音效，皆掌握玩家的喜好与欲望，创造高黏着度原创大作！',
  localizedGameplay: '客制在地化游戏',
  localizedGameplayDesc:
    'BG夺宝电子跻身国际市场，具备了设计在地化游戏的优秀能力，能够将当地文化、特殊玩法融入至游戏中，进而引起玩家的共鸣，为准备开拓新市场的合作伙伴打造最佳利器！',
  services: '服务范畴',
  APIIntegration: 'API介接服务',
  APIIntegrationDesc: '提供客户安全可靠的API快速对接服务，跨平台无缝接合、免下载切换快速，让您快速掌握商机不用等。',
  bigDataAnalysis: '大数据分析',
  bigDataAnalysisDesc:
    '藉由BG夺宝电子专业的大数据分析系统，定期追踪与剖析玩家行为，提升玩家们的游戏体验与好感，创造稳定客群与持续成长的获利。',
  onDuty: '全年无休',
  onDutyDesc:
    '提供全球客户365天全年无休，24/7全天候待命的专业团队，打造安全可靠的监控系统，及时解决玩家问题，让客户拥有最强后盾、让玩家尽情享受游戏体验，保障客户营运实况。',
  ourMission: '我们的使命',
  theMottoOf: '是BG夺宝电子的座右铭。',
  ourMissionDesc1:
    '为持续成为产业的领先者，我们以更高的标准鞭策自己。我们将BG夺宝电子的三大核心要素注入成为品牌的血液，Innovate / Challenge / Evolve 持续创新、拥抱挑战、展翅进化，贯彻品牌核心目标。',
  ourMissionDesc2: '期许BG夺宝电子成为你不可或缺的线上娱乐解决方案伙伴，共同在国际上闪耀光芒！',
  innovate: '创新',
  innovateDesc: '点燃游戏中的新可能。',
  challenge: '挑战',
  challengeDesc: '突破界限，缔造难忘体验。',
  evolve: '进化',
  evolveDesc: '拥抱变革，迈向游戏进化的下一个层次。',
  whyBg: '必须是BG夺宝电子的最佳理由',
  whyReason1: '因地制宜，创造双赢',
  whyReason1Desc: '针对客户营运区域、依据游戏表现、玩家上线频率与喜好，提供游戏的调整建议与协助策略布局。',
  whyReason2: '风险控管，保障利益',
  whyReason2Desc: '计算落点分布与潜在风险值，严格监控与管理游戏营运状况。',
  whyReason3: '开发预测，抢先商机',
  whyReason3Desc:
    '根据历史资料与产业经验，判断新游戏开发所需具备的特点与元素来锁定目标市场，大幅提升成功率，并藉由营销活动，提高玩家对BG游戏产品的忠诚度，以保障客户期望。',
  whyReason4: '状况比对，成效分析',
  whyReason4Desc:
    'B交叉比对客户状况、玩家分布、留存率评估等，定期追踪玩家行为，藉由BG专业团队与大资料分析游戏成效和玩家习性，开发更具吸引力与高黏着度产品。',
  whyReason5: '游戏推荐，投其所好',
  whyReason5Desc:
    '根据玩家与游戏主题的关联性、游玩频率、游戏黏着度、游戏调性等数据评估，提供玩家更适当的游戏选择，让JDB游戏产品更能促进玩家的游玩体验，并提高客户的经营获利。'
}
