// hi-IN
export default {

  // --- 尾数连 ---
  '尾数连': 'अंतिम अंक लगातार',
  '二尾连中': 'दो अंतिम अंक लगातार',
  '二尾连不中': 'दो अंतिम अंक लगातार नहीं',
  '三尾连中': 'तीन अंतिम अंक लगातार',
  '三尾连不中': 'तीन अंतिम अंक लगातार नहीं',
  '四尾连中': 'चार अंतिम अंक लगातार',
  '四尾连不中': 'चार अंतिम अंक लगातार नहीं',
  '0尾': '0 अंतिम अंक',
  '1尾': '1 अंतिम अंक',
  '2尾': '2 अंतिम अंक',
  '3尾': '3 अंतिम अंक',
  '4尾': '4 अंतिम अंक',
  '5尾': '5 अंतिम अंक',
  '6尾': '6 अंतिम अंक',
  '7尾': '7 अंतिम अंक',
  '8尾': '8 अंतिम अंक',
  '9尾': '9 अंतिम अंक',

  // --- 全不中 ---
  '全不中': 'सभी गलत',
  '五不中': 'पांच गलत',
  '六不中': 'छह गलत',
  '七不中': 'सात गलत',
  '八不中': 'आठ गलत',
  '九不中': 'नौ गलत',
  '十不中': 'दस गलत',
  '十一不中': 'ग्यारह गलत',
  '十二不中': 'बारह गलत',

  // --- 尾数 ---
  '尾数': 'अंतिम अंक',

  // --- 正码 ---
  '正码': 'सही कोड',

  // --- 正码1-6 ---
  '正码1-6': 'सही कोड 1-6',
  '正码1': 'सही कोड 1',
  '正码2': 'सही कोड 2',
  '正码3': 'सही कोड 3',
  '正码4': 'सही कोड 4',
  '正码5': 'सही कोड 5',
  '正码6': 'सही कोड 6',

  '尾数大': 'बड़ा अंतिम अंक',
  '大': 'बड़ा',
  '小': 'छोटा',
  '单': 'विषम',
  '双': 'सम',
  '和数大': 'बड़ा योग',
  '和数小': 'छोटा योग',
  '和数单': 'विषम योग',
  '和数双': 'सम योग',
  '尾数小': 'छोटा अंतिम अंक',

  // --- 正码特 ---
  '正码特': 'विशेष सही कोड',
  '正码特-正1特': 'विशेष सही कोड 1',
  '正码特-正2特': 'विशेष सही कोड 2',
  '正码特-正3特': 'विशेष सही कोड 3',
  '正码特-正4特': 'विशेष सही कोड 4',
  '正码特-正5特': 'विशेष सही कोड 5',
  '正码特-正6特': 'विशेष सही कोड 6',

  // --- 特码 ---
  '特码': 'विशेष कोड',

  // --- 过关 ---
  '过关': 'पास',
  '过关-正码1': 'सही कोड 1',
  '过关-正码2': 'सही कोड 2',
  '过关-正码3': 'सही कोड 3',
  '过关-正码4': 'सही कोड 4',
  '过关-正码5': 'सही कोड 5',
  '过关-正码6': 'सही कोड 6',

  // --- 连码 ---
  '连码': 'कनेक्ट',
  '连码-二中特': 'दो विशेष',
  '连码-二全中': 'दो पूर्ण',
  '连码-三中二': 'तीन में दो',
  '连码-三全中': 'तीन पूर्ण',
  '连码-四全中': 'चार पूर्ण',
  '连码-特串': 'विशेष स्ट्रिंग',

  // --- 龙虎斗 ---
  '龙虎斗': 'ड्रैगन और टाइगर',
  '龙': 'ड्रैगन',
  '虎': 'टाइगर',
  '正码一VS正码二': 'सही कोड 1 VS सही कोड 2',
  '正码一VS正码三': 'सही कोड 1 VS सही कोड 3',
  '正码一VS正码四': 'सही कोड 1 VS सही कोड 4',
  '正码一VS正码五': 'सही कोड 1 VS सही कोड 5',
  '正码一VS正码六': 'सही कोड 1 VS सही कोड 6',
  '正码一VS特码': 'सही कोड 1 VS विशेष कोड',
  '正码二VS正码三': 'सही कोड 2 VS सही कोड 3',
  '正码二VS正码四': 'सही कोड 2 VS सही कोड 4',
  '正码二VS正码五': 'सही कोड 2 VS सही कोड 5',
  '正码二VS正码六': 'सही कोड 2 VS सही कोड 6',
  '正码二VS特码': 'सही कोड 2 VS विशेष कोड',
  '正码三VS正码四': 'सही कोड 3 VS सही कोड 4',
  '正码三VS正码五': 'सही कोड 3 VS सही कोड 5',
  '正码三VS正码六': 'सही कोड 3 VS सही कोड 6',
  '正码三VS特码': 'सही कोड 3 VS विशेष कोड',
  '正码四VS正码五': 'सही कोड 4 VS सही कोड 5',
  '正码四VS正码六': 'सही कोड 4 VS सही कोड 6',
  '正码四VS特码': 'सही कोड 4 VS विशेष कोड',
  '正码五VS正码六': 'सही कोड 5 VS सही कोड 6',
  '正码五VS特码': 'सही कोड 5 VS विशेष कोड',
  '正码六VS特码': 'सही कोड 6 VS विशेष कोड',
}
