// th-TH
export default {

  // --- 尾数连 ---
  '尾数连': 'เลขท้ายต่อเนื่อง',
  '二尾连中': 'เลขท้ายสองตัวต่อเนื่องถูก',
  '二尾连不中': 'เลขท้ายสองตัวต่อเนื่องไม่ถูก',
  '三尾连中': 'เลขท้ายสามตัวต่อเนื่องถูก',
  '三尾连不中': 'เลขท้ายสามตัวต่อเนื่องไม่ถูก',
  '四尾连中': 'เลขท้ายสี่ตัวต่อเนื่องถูก',
  '四尾连不中': 'เลขท้ายสี่ตัวต่อเนื่องไม่ถูก',
  '0尾': 'เลขท้าย 0',
  '1尾': 'เลขท้าย 1',
  '2尾': 'เลขท้าย 2',
  '3尾': 'เลขท้าย 3',
  '4尾': 'เลขท้าย 4',
  '5尾': 'เลขท้าย 5',
  '6尾': 'เลขท้าย 6',
  '7尾': 'เลขท้าย 7',
  '8尾': 'เลขท้าย 8',
  '9尾': 'เลขท้าย 9',

  // --- 全不中 ---
  '全不中': 'ไม่ถูกทั้งหมด',
  '五不中': 'ไม่ถูกห้าตัว',
  '六不中': 'ไม่ถูกหกตัว',
  '七不中': 'ไม่ถูกเจ็ดตัว',
  '八不中': 'ไม่ถูกแปดตัว',
  '九不中': 'ไม่ถูกเก้าตัว',
  '十不中': 'ไม่ถูกสิบตัว',
  '十一不中': 'ไม่ถูกสิบเอ็ดตัว',
  '十二不中': 'ไม่ถูกสิบสองตัว',

  // --- 尾数 ---
  '尾数': 'เลขท้าย',

  // --- 正码 ---
  '正码': 'เลขปกติ',

  // --- 正码1-6 ---
  '正码1-6': 'เลขปกติ 1-6',
  '正码1': 'เลขปกติ 1',
  '正码2': 'เลขปกติ 2',
  '正码3': 'เลขปกติ 3',
  '正码4': 'เลขปกติ 4',
  '正码5': 'เลขปกติ 5',
  '正码6': 'เลขปกติ 6',

  '尾数大': 'เลขท้ายใหญ่',
  '大': 'ใหญ่',
  '小': 'เล็ก',
  '单': 'คี่',
  '双': 'คู่',
  '和数大': 'ผลรวมใหญ่',
  '和数小': 'ผลรวมเล็ก',
  '和数单': 'ผลรวมคี่',
  '和数双': 'ผลรวมคู่',
  '尾数小': 'เลขท้ายเล็ก',

  // --- 正码特 ---
  '正码特': 'เลขปกติพิเศษ',
  '正码特-正1特': 'เลขปกติพิเศษ 1',
  '正码特-正2特': 'เลขปกติพิเศษ 2',
  '正码特-正3特': 'เลขปกติพิเศษ 3',
  '正码特-正4特': 'เลขปกติพิเศษ 4',
  '正码特-正5特': 'เลขปกติพิเศษ 5',
  '正码特-正6特': 'เลขปกติพิเศษ 6',

  // --- 特码 ---
  '特码': 'เลขพิเศษ',

  // --- 过关 ---
  '过关': 'ผ่าน',
  '过关-正码1': 'ผ่าน - เลขปกติ 1',
  '过关-正码2': 'ผ่าน - เลขปกติ 2',
  '过关-正码3': 'ผ่าน - เลขปกติ 3',
  '过关-正码4': 'ผ่าน - เลขปกติ 4',
  '过关-正码5': 'ผ่าน - เลขปกติ 5',
  '过关-正码6': 'ผ่าน - เลขปกติ 6',

  // --- 连码 ---
  '连码': 'เลขต่อเนื่อง',
  '连码-二中特': 'สองเลขพิเศษ',
  '连码-二全中': 'สองเลขถูกทั้งหมด',
  '连码-三中二': 'สามในสอง',
  '连码-三全中': 'สามเลขถูกทั้งหมด',
  '连码-四全中': 'สี่เลขถูกทั้งหมด',
  '连码-特串': 'ชุดพิเศษ',

  // --- 龙虎斗 ---
  '龙虎斗': 'มังกรและเสือ',
  '龙': 'มังกร',
  '虎': 'เสือ',
  '正码一VS正码二': 'เลขปกติ 1 VS เลขปกติ 2',
  '正码一VS正码三': 'เลขปกติ 1 VS เลขปกติ 3',
  '正码一VS正码四': 'เลขปกติ 1 VS เลขปกติ 4',
  '正码一VS正码五': 'เลขปกติ 1 VS เลขปกติ 5',
  '正码一VS正码六': 'เลขปกติ 1 VS เลขปกติ 6',
  '正码一VS特码': 'เลขปกติ 1 VS เลขพิเศษ',
  '正码二VS正码三': 'เลขปกติ 2 VS เลขปกติ 3',
  '正码二VS正码四': 'เลขปกติ 2 VS เลขปกติ 4',
  '正码二VS正码五': 'เลขปกติ 2 VS เลขปกติ 5',
  '正码二VS正码六': 'เลขปกติ 2 VS เลขปกติ 6',
  '正码二VS特码': 'เลขปกติ 2 VS เลขพิเศษ',
  '正码三VS正码四': 'เลขปกติ 3 VS เลขปกติ 4',
  '正码三VS正码五': 'เลขปกติ 3 VS เลขปกติ 5',
  '正码三VS正码六': 'เลขปกติ 3 VS เลขปกติ 6',
  '正码三VS特码': 'เลขปกติ 3 VS เลขพิเศษ',
  '正码四VS正码五': 'เลขปกติ 4 VS เลขปกติ 5',
  '正码四VS正码六': 'เลขปกติ 4 VS เลขปกติ 6',
  '正码四VS特码': 'เลขปกติ 4 VS เลขพิเศษ',
  '正码五VS正码六': 'เลขปกติ 5 VS เลขปกติ 6',
  '正码五VS特码': 'เลขปกติ 5 VS เลขพิเศษ',
  '正码六VS特码': 'เลขปกติ 6 VS เลขพิเศษ',
}
