export default {
  welcome: 'Uniapp में आपका स्वागत है',
  hello: 'नमस्ते',
  tabble: {
    home: 'होम',
    promotions: 'प्रचारें',
    invite: 'आमंत्रित करें',
    wallet: 'वॉलेट',
    me: 'मैं',
    longQueue: 'लंबा क्यारे'
  },
  rank: {
    title: 'रेन्डिंग'
  },
  invite: {
    CopyInvitationCode: 'कोड',
    CopySuccessful: 'कॉपी सफल',
    InvitationLink: 'निमन्त्रणा कोड सहेजें',
    CopyInvitationLink: 'निमन्त्रणा लिंक कॉपी करें',
    SaveSuccessful: 'सफल सहेजें',
    SaveFailed: 'सहेजना असफल',
    Username: 'उपयोक्ता नाम',
    agentsNumber: 'निमन्त्रणा गणना',
    firstCharge: 'प्रथम डिपोसिट गिनती्या',
    topUpNumber: 'फिर चार्ज समय',
    RechargeAmount: 'पुनरार्ज मात्रा',
    SubordinateUser: 'उपनिर्धारित उपयोक्ता',
    Total: 'कुल',
    AllDates: 'सभी तारीखें',
    Today: 'आज',
    Yesterday: 'कल',
    LastDays: 'पिछले 7 दिन',
    TotalDownline: 'कुल डाउनलाइन सदस्य', // 支线总人数
    TotalRegistration: 'कुल पंजीकरण सदस्य', // 注册人数
    FirstDeposit: 'पहली जमा के सदस्य', // 首存人数
    DepositMember: 'जमा सदस्य', // 存款人数
    WithdrawalMember: 'उत्तारण सदस्य', // 提款人数
    VaildBetsBettors: 'वैध दांव लगाने वाले दांव लगाने वालों', // 有效投注人数
    NetTotal: 'नेट કુલ (जीत-हार)', // 净输赢
    TotalPromotion: 'कुल प्रमोशन और रिबेट', // 总优惠红利返水
    FirstDepositAmount: 'पਹਿਲी जमा राशि', // 首存金额
    TotalDeposit: 'कुल जमा', // 总存款
    TotalWithdrawal: 'कुल निकासी', // 总提款
    ValidBetTotal: 'वैध दांव लगाने वाले कुल सदस्य', // 有效投注总额
    cleanUp: 'ਸਫਾਈ ਕਰਨਾ',
    LastModified: 'آخرी बार संशोधित किया गया',
    AllLevels: 'सभी स्तर',
    SearchInterval: 'खोज अवधि',
    Levels: 'स्तर',
    ThisWeek: 'इस सप्ताह',
    LastWeek: 'पिछला सप्ताह',
    ThisMonth: 'इस महीना',
    LastMonth: 'पिछला महीना',
    TotalAmount: 'कुल रकम',
    TotalCount: 'कुल गिनती',
    DepositTime: 'जमा समय',
    RegistrationTime: 'रजिस्टरेशन समय'
  },
  home: {
    scratchOff: 'स्क्रैच करना',
    promotions: 'प्रचारें',
    casino: 'कैसीनो',
    live: 'कैसिनो',
    sports: 'खेलकूद',
    chess: 'स्केस',
    fish: 'माछिया',
    lottery: 'लॉटरी',
    gamesBig: 'सबसे लोकप्रिय खेल',
    scratch: 'स्क्रैच',
    more: 'और ज्यादा',
    morebig: 'और ज्यादा',
    information: 'विजयी जानकारी',
    amount: 'विजयी रकम',
    chart: 'आज का कमाई चार्ट',
    total: 'कुल',
    bet: 'बाज़ी',
    online: 'ऑनलाइन',
    noOpen: 'इवेंट फिलहाल खुला नहीं है!',
    games: 'स्लॉट्स',
    announcement: 'व्याख्या',
    Chatroom: 'चैटरूम',
    Servicing: 'सेवा',
    Invite: 'निमन्त्रणा',
    bindTitle: 'सुरक्षा जानकारी बाइंड करें',
    bindTip: `खाता हानि को रोकने और आसान खाता वसूली की सुविधा के लिए, हम आपके खाते को सुरक्षा जानकारी के साथ बाध्य करने की सलाह देते हैं`,
    bind: 'बाँध',
    unbound: 'असीमित',
    RedEnvelopeRain: 'लाल बारिश बरसात',
    last: 'अंतिम',
    next: 'अगला',
    Close: 'बन्द करें',
    NoPrompt: 'कोई प्रोम्प्ट नहीं',
    Winning: 'जीत जानकारी',
    TodayWin: 'आज की कमाई रैंक',
    LOTTERY: 'लोटेरी',
    seeAll: 'सभी देखें',
    visitorTip: 'दृश्यात्मकों को इस खेल में पहुँच नहीं है!',
    taskTitle1: 'वीपी डिस्कॉन्ट आनंद करें',
    taskTitle2: 'स्क्लिक्सिव कार्य'
  },
  me: {
    History: 'परिणाम इतिहास',
    Agency: 'एजेंसी केंद्र',
    Bets: 'मेरे बाज़ीयां',
    Coupon: 'मेरा कूपन',
    Transactions: 'मेरे लेन-देन',
    Commission: 'योग्यता आयोग',
    Notifications: 'सूचनाएं',
    Password: 'सुरक्षा विन्यास्ड',
    Languages: 'भाषाएं',
    Customer: 'ग्राहक सेवा',
    New: 'नया',
    Wallet: 'वॉलेट',
    Recharge: 'रिचार्ज',
    Withdraw: 'निकालना',
    Total: 'कुल शेष',
    userName: 'लॉगइन करें',
    lastTime: 'आखरी लॉगइन',
    Current: 'वर्तमान स्तर',
    Experience: 'स्तर तक पहुँचने के लिए और अधिक',
    Deposit: 'जमा',
    bankCrad: 'भुगतान की विधि',
    otcOrder: 'ओटीसी आर्डर',
    ChatRoom: 'चैट रूम',
    Sratch: 'स्क्रैच-ऑफ रिकॉर्ड',
    switchLanguage: 'भाषा बदलें',
    logOut: 'लॉग आउट',
    cancle: 'रद्द करें',
    setting: 'सेटअप',
    Theme: 'थीम',
    defaultTheme: 'डिफ़ॉल्ट थीम',
    blueTheme: 'ब्लू थीम',
    AboutUs: 'हमारे बारे में',
    gamemethod: 'खेल खोलने विधि',
    casinoBets: 'कैसिनो बेट्स',
    defaultMethod: 'डिफ़ॉल्ट विधि',
    newWindow: 'नवीन विंडोW',
    allData: 'सभी डाटा प्रदर्शित किया गया है',
    notInternet: 'इंटरनेट को विदेशी द्वारा व्यवस्था किया गया है',
    Feedback: 'प्रतिक्रिया',
  },
  Transactions: {
    TradeType: 'व्यापार प्रकार',
    TradeStatus: 'व्यापार स्थिति',
    TradeExamineStatus: 'व्यापार परीक्षण स्थिति'
  },
  game: {
    dice: 'पासा',
    minute: 'मिनट',
    minutes: 'मिनट',
    second: 'सेकंड',
    balance: 'शेष',
    resultFor: 'के परिणाम',
    resultBig: 'परिणाम',
    totalPoint: 'कुल अंक',
    draw: 'ड्रा',
    drawingTime: 'ड्रा करने का समय',
    betting: 'बाज़ी लगाना',
    result: 'परिणाम',
    analyze: 'विश्लेषणें',
    rule: 'नियम',
    myOrder: 'मेरे आर्डर',
    sumType: 'योग प्रकार',
    sumPoints: 'अंकों का योग',
    single: 'एकल',
    pair: 'जोड़ा',
    triple: 'तिहरा',
    winBet: 'एक बाज़ी जीतें',
    expect: 'अपेक्षा करें',
    amount: 'रकम',
    start: 'शुरू होने का समय',
    open: 'खुलने का समय',
    drawID: 'ड्रा आईडी',
    sum: 'योग',
    value: 'मूल्य',
    number: 'संख्या',
    round: 'गोल',
    small: 'छोटा',
    big: 'बड़ा',
    toDrawn: 'उठाना है',
    // prizeWinning: 'जीतने वाला पुरस्कार',
    prizeWinning: 'जैकपोट जीता',
    losingLottery: 'लॉटरी हारना',
    cancelledOrder: 'रद्द क्रमा',
    betExpect: 'अपेक्षितबाज़ी',
    bettingTime: 'बाज़ी का समय',
    betMoney: 'बाज़ी के पैसे',
    purchaseCode: 'खरीद कोड',
    openTime: 'खुलने का समय',
    prizeMoney: 'ईनाम',
    openCode: 'ओपनकोड',
    color: 'रंग',
    colorTips: '10 सेकंड से पहले बाज़ी बंद हो गई, सभी को शुभकामनाएं',
    pauseBetting: 'बाज़ी रोकें',
    resultHistory: 'परिणाम इतिहास',
    perriod: 'अवधि',
    showMore: 'और दिखाएं',
    bet: 'बाज़ी',
    chatRoom: 'चैट रूम',
    share: 'शेयर करें',
    goChat: 'चैट रूम पर जाएं',
    money: 'पैसे',
    customize: 'अनुकूलित करें',
    totalPrice: 'कुल कीमत',
    timeBig: 'समय',
    BettingCode: 'बेटिंग कोड',
    EnterAmount: 'मात्रा भरें',
    TotalBetAmount: 'कुल बेट मात्रा',
    BetCoin: 'बेट कोइन',
    betTip: 'न्यूनतम बेट बहुतेरा 1 है', //下注最小倍数为1
    setWalletTip: 'कृपया डिफ़ॉल्ट वालेट सेट करें!', //请设置默认钱包!
    minBetTip: 'न्यूनतम बेटिंग मात्रा है', //最小下注金额为
    maxBetTip: 'अधिकतम बेटिंग मात्रा है', //最大下注金额为
    betSuccess: 'बेट सफल!' // 下注成功
  },
  scratch: {
    scratch: 'स्क्रैच',
    scratchOffs: 'स्क्रैच-ऑफ़',
    history: 'इतिहास',
    prizeAmount: 'पुरस्कार राशि',
    price: 'कीमत',
    ticket: 'टिकट',
    mySratchHistory: 'मेरा स्क्रैच-इतिहास',
    howPlay: 'कैसे खेलें',
    playNow: 'अभी खेलें',
    drawn: 'ड्रा हों गया',
    winning: 'जीत',
    expired: 'खत्म हो चुका',
    toDrawn: 'उठाना है',
    losing: 'हार रहे है',
    prizeWinning: 'जैकपोट जीता',
    losingLottery: 'लॉटरी हारना',
    haveExpired: 'मियाद समाप्त',
    name: 'नाम',
    bettingTime: 'बाज़ी का समय',
    betMoney: 'बाज़ी के पैसे',
    nowPlay: 'क्या आप अब खेल की पुष्टि करते हैं?',
    WinningNumber: 'जीते हुए संख्या',
    YourNumber: 'आपकी संख्या',
    Instructions:
      'खेलाड़ियों को कवरिंग फिल्म को स्क्रेट करने की जरूरत है, यदि "आपका संख्या" और "जीनने का संख्या" एक है, तुम संगत "आपका संख्या" प्रतिज्ञा ', //玩家需要刮开覆盖膜，如果任意一个“你的号码”与“中奖号码”相同，即可获得该“你的号码”所对应的奖金。
    all: 'सभी',
    ywiw: 'तुम्हारा विलाप प्रतीक्षा कर रहा है',
    wmshb: 'वाईल्ड बहुत बहुत बहुत बहुत बहुत बहुत बहुत बहुत बहुत बहुत बहुत बहुत बहुत बहुत बहुत बहुत बहु',
    ctabt: 'वे तुम्हें पकड़ने से पहले उन सबको पकड़ो!',
    ewms: 'वाइल्ड मल्टीप्लायर स्क्रैच-ऑफ्स एक्सप्लोर करें',
    odds: 'संभावनाएँ',
    in: 'में',
    playType: 'खेल प्रकार: तुरंत पुरस्कार भुनाने के लिए स्क्रैच ऑफ',
    prizeStructure: 'पुरस्कार संरचना',
    tanop: 'प्रत्येक पुरस्कार स्तर के लिए संभावित पुरस्कारों की अनुमानित संख्या निम्नलिखित है।',
    prize: 'पुरस्कार',
    amount: 'राशि',
    remaining: 'बाकी',
    tatalWinning: 'कुल जीत',
    tickets: 'टिकट',
    tanopend:
      'जब खेल छापा जाता है तथा गणना किया जाता है कि एक प्रतिज्ञा जीता है की सारी संभावना स्थापित है जब खेल छापा जाता है तथा कुल संख्या टि ऊपर सूचीत किया गया कोई प्रतिज्ञा पहले से ही पूरा हो सकता है, लेकिन अभी कहना नहीं है. कुल प्रतिज्ञा विक्रेताओं में विक्रेताओं के लिए उपलब्ध नहीं हो सकता, जिसके समावेश में प्रतिज्ञा भी हैं.'
  },
  chat: {
    chatRoom: 'चैट रूम',
    language: 'भाषा',
    type: 'प्रकार',
    roomName: 'रूम का नाम',
    namePlace: 'कृपया रूम का नाम दर्ज करें',
    languagePlace: 'कृपया भाषा चुनें',
    typePlace: 'कृपया प्रकार चुनें',
    create: 'बनाएं',
    packets: 'लाल पैकेट दें',
    luckyPacket: 'भाग्यशाली लाल पैकेट',
    numberPackets: 'लाल पैकेटों की संख्या',
    numberPlace: 'संख्या भरें',
    TotalAmount: 'कुल मात्रा',
    fortunePlace: 'आपका भाग्य अच्छा हों',
    send: 'भेजें',
    packetRecord: 'लाल पैकेट रिकार्ड',
    packetSent: 'लाल पैकेट भेजा गया',
    cancle: 'रद्द करें',
    receive: 'प्राप्त करें',
    received: 'प्राप्त हुआ',
    selectYear: 'साल चुनें',
    lucky: 'भाग्यशाली',
    inWallet: 'वॉलेट में जमा किया गया',
    chatPlace: 'พูดอะไรบ้างสิ',
    chatFollow: 'अनुसरण करें',
    chatFortune: 'बहुत भाग्य',
    chatOpen: 'खोलें',
    confirmFallow: 'क्या आप गिराई की पुष्टि कर रहे हैं?',
    redEnvelope: 'लाल कन्वेलूप क्रमबद्ध करें',
    silent: 'सभी शांत हैं',
    disbanded: 'कमरा रोका गया है',
    member: 'सदस्य',
    searchPlace: 'खोजें',
    joinRoom: 'कमरे में जोड़ें',
    disconnected: 'कनेक्शन डिस्कनेक्ट किया गया, 15 सेकण्ड में फिर से कनेक्ट किया गया',
    serving: 'आपकी सेवा',
    customerConnect: 'कनेक्ट होने के लिए मनपसंद',
    evaluation: 'मूल्याङ्कन ग्राहक सेवा',
    evaluateTitle: 'कृपया इस सेवा का मूल्यान करें',
    veryDissatisfied: 'बहुत संतुष्ट',
    dissatisfied: 'असंतुष्ट',
    normal: 'सामान्य',
    satisfaction: 'संतुलन',
    quiteSatisfied: 'पूरा संतुष्ट',
    spell: 'वर्तनी',
    redMoney: 'लाल कन्वेलूप कुल',
    snatched: 'सभी ऊपर स्नेच करें',
    claimed: 'किया गया है',
    redTotal: 'यूआन के कुल हैं',
    seconds: 'सेकंड',
    minutes: 'मिनट',
    hours: 'घंटा',
    offline: 'ऑफलाइन',
    online: 'ऑनलाइन',
    Join: 'जोड़ें'
  },
  login: {
    visitorLogin: 'भेंटकर्ता',
    login: 'लॉगइन करें',
    passwordLogin: 'खाता लागइन',
    emailLogin: 'ईमेल लॉगइन',
    accountPlace: 'खाता क्रमांक भरें (6-20)',
    userLength: 'उपयोगकर्ता नाम में 6 से 20 वर्ण हैं',
    phonePlace: 'फोन नंबर दर्ज करें',
    passwordPlace: 'पासवर्ड दर्ज करें(6-15)',
    emailPlace: 'ईमेल दर्ज करें',
    codePlace: 'कोड दर्ज करें',
    needAccount: 'एक खाता चाहिए?',
    register: 'पंजीकरण करें',
    password: 'खाता',
    email: 'ईमेल',
    referralPlace: 'रेफरल कोड',
    message: 'कोड प्राप्त करें',
    confirmChcek: 'मैं पुष्टि करता हूं कि मैं 18+ हूं',
    allowChcek: 'हमें इस मोबाइल नंबर के माध्यम से आपको महत्वपूर्ण जीतने वाली जानकारी को सूचित करने की अनुमति दें',
    already: 'पहले से ही एक उपयोगकर्ता है',
    chcekBox: 'कृपया बॉक्स को चेक करें',
    digits: 'पासवर्ड 6 अंकों से कम',
    password15: '15 अक्षर से बड़ा पासवर्ड',
    account20: '20 से अधिक अक्षरों के साथ खाता',
    account10: 'खातों में संख्याओं और अक्षरों से मिलना चाहिए और इसमें प्रतीकों ._-',
    confirmPlace: 'पासवर्ड यकीन करें',
    confirmPassword: 'दो पासवर्ड एक ही नहीं हैं',
    phoneNullTip: 'फोन नंबर खाली नहीं है!', //手机号不能为空!
    phoneAreaCodeNullTip: 'मोबाइल फोन क्षेत्र कोड खाली नहीं है!', //手机区号不能为空!
    Phone: 'फोन',
    PhoneLogin: 'फोन लॉगइन',
    TickProtocolTip: 'कृपया उपयोक्ता रेजिस्ट्रेशन एमेंटिंग जाँचें!', //请勾选用户注册协议!
    loginMethods: 'अन्य लॉगिन विधियों', //其他登录方式
    registerMethods: 'अन्य रजिस्टर विधियों', //注册方式
    dragSlider: 'सत्यापित करने के लिए स्लाइडर खींचें', //拖动滑块进行验证
    slideBlock: 'सत्यापित करने के लिए ब्लॉक स्लाइड करें', //验证成功
    invitationCode: 'कृपया निमंत्रण कोड दर्ज करें।', //请输入邀请码
    or: 'अथवा',
    moreWays: 'अधिक तरीकाएँ'
  },
  user: {
    personal: 'निजी',
    nickname: 'उपनाम',
    memberAccount: 'सदस्य खाता',
    nicknamePlace: 'उपनाम दर्ज करें',
    confirm: 'पुष्टि करें',
    member: 'सदस्य',
    camera: 'कैमरा',
    photoAlbum: 'फोटो एलबम',
    cancle: 'रद्द करें',
    noMore: 'कोई और डेटा नहीं है',
    UploadPictureFailed: 'छवि अपलोड असफल',
    shakeTip: 'कृपया सदैव क्लिक नहीं करें',
    noNetWork: 'नेटवर्क विघटन',
    pefresh: 'पुनः लोड',

  },
  version: {
    title: 'अपडेट करें',
    subTitle: 'नए संस्करणों की खोज',
    downLoadBtnTextiOS: 'अपडेट पर जायें',
    downLoadBtnText: 'अपडेट डाउनलोड करें',
    downLoadingText: 'डाउनलोड',
    install: 'इनस्टॉल हों रहा है...',
    completed: 'अभी इनस्टॉल करें',
    restart: 'पुनरारंभ पर दबाएं',
    Downloading: 'डाउनलोड हो रहा है...',
    cancelDownload: 'क्या आप डाउनलोड रद्द करना चाहते हैं?',
    cancelText: 'नहीं',
    confirmText: 'हाँ',
    successful: 'इंस्टालेशन सफल, पुनः प्रारंभ हो रहा है...',
    newVersion: 'इंस्टालेशन सफल, कृपया पुनः आरंभ करें',
    failed: 'अपडेट विफल हुआ',
    version: 'संस्करण',
    versionUpdate: 'संस्करण अद्यतन',
    noNew: 'कोई नया संस्करण नहीं'
  },
  code: {
    200: 'ऑपरेशन सफल!', //操作成功
    // 400: 'व्यवसाय अपवाद', // 业务异常
    400: 'बाद में पुन: प्रयास करें', // 请稍后再试
    401: 'अनधिकृत अनुरोध करें', // 请求未授权
    402: 'अनधिकृत ग्राहक अनुरोध', // 客户端请求未授权
    403: 'मैसज पढ़ा नहीं जा सकता', // 消息不能读取
    404: 'अनुरोध नहीं मिला', // 没找到请求
    405: 'वर्तमान अनुरोध पद्धति समर्थित नहीं है', // 不支持当前请求方法
    406: 'वर्तमान मीडिया प्रकार समर्थित नहीं है', // 不支持当前媒体类型
    408: 'आवश्यक अनुरोध पैरामीटर गुम हैं', // 缺少必要的请求参数
    409: 'अनुरोध मापदंड प्रकार में त्रुटि', // 请求参数类型错误
    410: 'अनुरोध मापदंड बाइंडिंग में त्रुटि', // 请求参数绑定错误
    411: 'मापदंड सत्यापन विफल रहा', // 参数校验失败
    412: 'सत्यापन कोड के बिना पंजीकरण सक्षम नहीं है', // 没有开启无验证码注册
    413: 'आमंत्रण कोड खाली नहीं हो सकता', // 邀请码不能为空
    414: 'आमंत्रण कोड मौजूद नहीं है', // 邀请码不存在
    415: 'आमंत्रण कोड लंबाई में त्रुटि', // 邀请码长度错误
    416: 'कोई प्रासंगिक डेटा नहीं मिला', // 没有找到相关数据
    418: 'गलत रेजिस्ट्रेशन विधि!', //错误的注册方法
    419: 'कृपया बाद फिर कोशिश करें!', //重复请求，请稍后再试
    420: 'मौजूदा आईपी रेजिस्टरेड प्रयोक्ता सीमा से अधिक है!', //当前IP注册用户已超限制
    421: 'अस्थायी रेजिस्टर करने में असमर्थ', //暂时无法注册
    422: 'प्रयोक्ता उपलब्ध नहीं है', // 试玩用户不可用
    423: 'अब कोई अनुमति नहीं!', //推广用户暂无权限
    424: 'अनिवार्य अनुरोध, बाद फिर कोशिश करें!', //请求频繁，稍后再试！
    425: 'प्रचारक उपयोगकर्ता अनुपलब्ध है।', //推广用户不可用
    426: 'इस समय अनुमति नहीं है', //暂无权限

    500: 'सर्वर अपवाद', // 服务器异常
    502: 'सर्वर अपवाद', // 服务器异常
    504: 'समय सीमा समाप्त', // 请求超时

    1101: 'खाता या पासवर्ड में त्रुटि', // 账号或密码错误
    1102: 'यूजरनेम खाली नहीं हो सकता', // 用户名不能为空
    1103: 'पासवर्ड खाली नहीं हो सकता', // 密码不能为空
    1104: 'उपभोगकर्ता मौजूद नहीं', // 用户不存在
    1105: 'उपयोगकर्ता पहले से मौजूद है', // 用户已存在
    1106: 'पासवर्ड असंगति', // 密码不一致，请重新设置密码
    1107: 'सत्यापन कोड त्रुटि', // 验证码错误
    1108: 'खाता नाम पंजीकृत किया गया है', // 该账户名已被注册
    1109: 'मैंने आज ही चेक इन कर लिया है', // 今日已签到过了
    1110: 'फ़ोन नंबर पहले से मौजूद है', // 该手机号已存在
    1111: 'ईमेल उपयोगकर्ता पहले से मौजूद है', // 该邮箱用户已存在
    1112: 'फ़ोन नंबर खाली नहीं हो सकता', // 手机号不能为空
    1113: 'ईमेल खाली नहीं हो सकता', // 邮箱不能为空
    1114: 'ईमेल प्रारूप में त्रुटि', // 邮箱格式错误
    1115: 'पुराना पासवर्ड त्रुटि', // 旧密码错误
    1116: 'ईमेल प्रारूप में त्रुटि', // 邮箱格式错误
    1117: 'सत्यापन कोड भेजना विफल रहा', // 验证码发送失败
    1118: 'प्रयोक्ता ताला लगाया गया है', // 该用户已被锁定
    1119: 'पुराना और नया पासवर्ड एक हैं, कृपया रिसेट करें!', // 新旧密码相同，请重新设置
    1120: 'सेल फोन संख्या मौजूद नहीं है!', // 手机号不存在
    1121: 'सत्यापन कोड मिया गया है!', //验证码已过期
    1122: 'मेलबाक्स बाइंड नहीं है, कृपया पहले मेलबाक्स बाइंड करें!', //邮箱未绑定，请先绑定邮箱
    1123: 'खाता संख्याओं और अक्षरों से बना होना चाहिए और इसमें प्रतीक शामिल हो सकता है। ._-', //账户由数字和字母组成,可包含符号._-
    1124: 'उपयोगकर्ता नाम में 6 से 20 वर्ण हैं', //账户名长度为6-20位
    1125: 'अधिकार प्रदान विफल', //授权失败
    1132: 'अनुभव मूल्य असामान्य रूप से सेट है', //经验值设置异常
    1133: 'असामान्य बाध्यकारी आईपी पता', //绑定IP异常

    201: 'पंजीकरण सफल, लेकिन आमंत्रण कोड मौजूद नहीं है', // 注册成功,但邀请码不存在

    1201: 'वॉलेट मौजूद नहीं है', // 钱包不存在
    1202: 'वर्तमान मुद्रा वॉलेट पहले से मौजूद है', // 当前币种钱包已存在
    1203: 'स्थानांतरण विफल रहा', // 转账失败
    1204: 'अपर्याप्त वॉलेट बैलेंस', // 钱包余额不足
    1205: 'वर्तमान बैंक कार्ड बाइंड कर दिया गया है', // 当前银行卡已绑定
    1206: 'बाइंडिंग विफल', // 绑定失败
    1207: 'वॉलेट फ्रीज किया गया', // 钱包被冻结
    1208: 'लेन-देन रिकॉर्ड मौजूद नहीं है', // 交易记录不存在
    1209: 'निकासी की अनुमति नहीं है', // 不允许提现
    1210: 'बाइंडिंग जानकारी अनुपलब्ध है', // 绑定信息缺失
    1211: 'बैंक कार्ड पहले से मौजूद है!', //银行卡已经存在！
    1212: 'ट्रांसेक्शन मात्रा 0 से कम या बराबर नहीं है!', //交易金额不能小于等于0！
    1213: 'कोई बदला अनुमति नहीं!', //不允许汇兑！
    1214: 'तीन वालेट ताला लगाए!', //三方钱包已锁定
    1215: 'अपर्याप्त उपयोक्ता कोड!', //用户打码量不足!
    1216: 'तीसरी पार्टी त्रुटि!', //第三方错误！
    1218: 'पैसा डाटा अपूर्ण है, कृपया फिर बारंड करें!', //支付数据不完整，请重新绑定
    1219: 'निकालन मात्रा न्यूनतम घटना मात्रा से कम नहीं है!', //提现金额不能低于最小提现金额
    1220: 'इस भुगतान विधि में लेनदेन रिकॉर्ड हैं, कृपया इसे हटाएं नहीं।', //已有交易记录存在,请勿删除
    1221: 'कोड पैलेंट खाता पहिले से मौजूद है!', //扫码支付账户已存在
    1222: 'ऑनलाइन पैसा खाता पहले से ही मौजूद है!', //线上支付账户已存在
    1223: 'USDT खाता पहले से ही मौजूद है!', //USDT账户已存在
    1224: 'स्थानांतरण की अनुमति नहीं है', //不允许转账
    1225: 'भुगतान विक्रेता मौजूद नहीं है', //支付厂商不存在
    1226: 'भुगतान असंगति', //支付异常
    1227: 'भुगतान चैनल पहले से मौजूद है।', //支付通道已存在
    1228: 'भुगतान चैनल कोड संशोधित नहीं किया जा सकता', // 支付通道CODE不可修改
    1229: 'भुगतान कॉलबैक विफल रही, ऑर्डर मौजूद नहीं है।', //代付回调失败,订单不存在
    1230: 'भुगतान कॉलबैक विफलता में एक अपवाद उत्पन्न हुआ।', //支付回调失败出现异常
    1231: 'ट्रांसेक्शन प्रकार असामान्य!', //交易类型异常
    1233: 'पैसा मात्रा असामान्य है, कृपया सही मात्रा सीमा भरें!', //支付金额异常,请输入正确的金额范围
    1234: 'डील असफल', //交易失败
    1235: 'बाइंड खाता डाटा मौजूद नहीं है', //提现绑定账户数据不存在
    1236: 'बैंक डाटा मौजूद नहीं है', //提现银行数据不存在
    1237: 'ट्रांसेक्शन मात्रा प्रारूप गलत है', //交易金额格式不正确

    1291: 'शेष राशि सफलतापूर्वक जोड़ा गया!', //余额添加成功
    1292: 'शेष राशि सफलतापूर्वक कटौती!', //余额划扣成功
    1293: 'सफल विनिमय!', //汇兑成功

    1301: 'बाजी का विकल्प मौजूद नहीं है', // 下注选项不存在
    1302: 'बार-बार बाजी लगाना', // 重复下注
    1303: 'रिकार्ड मौजूद नहीं है', // 记录不存在
    1304: 'पूर्वधारणा विफलता', // 预设失败
    1305: 'रंग नियंत्रण वस्तु मौजूद नहीं है', // 彩种控制对象不存在
    1306: 'गेम अभी तक खोला नहीं गया है', // 暂未开启游戏
    1307: 'मौजूदा दौर में बाजी पर रोक लग गई है', // 当期已停止下注
    1308: 'उपयोगकर्ता टिकट मौजूद नहीं है', // 用户注单不存在
    1309: 'लॉटरी मौजूद नहीं है', // 彩票不存在
    1310: 'बाज़ी लगाने के लिए राशि बहुत छोटी है', // 金额太小，不可投注
    1311: 'दांव लगाने के लिए रकम बहुत बड़ी है', // 金额太大，不可投注

    1401: 'ऑर्डर लॉक कर दिया गया है, कृपया लेनदेन पूरा करना जारी रखें', // 该订单已锁定,请继续完成交易
    1402: 'कृपया वाउचर अपलोड करें', // 请上传凭证
    1403: 'रिचार्ज जानकारी खाली नहीं हो सकती', // 充值信息不能为空
    1404: 'स्वयं के साथ व्यापार नहीं कर सकते', // 不能和自己交易
    1405: 'हस्ताक्षर सत्यापन विफल रहा है', // 签名校验失败
    1406: 'अन्य उपयोक्ता के साथ ट्रेडिंग', // 正在和其他用户交易

    1501: 'कार्य मौजूद नहीं है या असफल है!', //任务不存在或已失效
    1502: 'ग्रेड गैरीं!', //等级不足
    1503: 'डेस्पोज़िट अपर्याप्त है!', //押金不足
    1504: 'कार्य माना गया है!', //任务已领取
    1505: 'कार्य जारी है!', //任务进行中
    1506: 'कार्य जारी नहीं है!', //任务发放失败
    1507: 'उपयोक्ता कार्य जारी है, कृपया विफल करें!', //用户任务进行中，请勿操作
    1508: 'विशेष समूह में नहीं है!', //不在指定分组

    // 转盘模块
    1509: 'लकी व्हील गतिविधि उपयोगकर्ता रिकॉर्ड मौजूद नहीं है!', //转盘活动用户记录不存在
    1510: 'लकी व्हील गतिविधि का वर्तमान समय समाप्त हो गया है!', //转盘活动当前时间已失效
    1511: 'वर्तमान लकी व्हील गतिविधि प्रगति में नहीं है!', //当前转盘活动未进行中
    1512: 'लकी व्हील गतिविधि क्लिक करने का समय 0 है!', //转盘活动可点击次数为0
    1513: 'लकी व्हील गतिविधि आमंत्रित उपयोगकर्ता मौजूद नहीं है!', //转盘活动邀请用户不存在
    1514: 'वर्तमान लकी व्हील गतिविधि पूरी हो चुकी है!', //当前转盘活动已完成
    1515: 'लकी व्हील गतिविधि विफल हो गई है, कृपया फिर से क्लिक न करें!', //当前转盘活动以失败，请勿重复点击
    1516: 'लकी व्हील गतिविधि प्रारंभिक मूल्य और आमंत्रण समय पैरामीटर मेल नहीं खाते!', //当前转盘活动初始砍价金额和邀请次数参数不匹配
    1517: 'लकी व्हील गतिविधि मौजूद नहीं है!', //转盘活动不存在
    1518: 'लकी व्हील गतिविधि समाप्त हो गई है!', //转盘活动已过期
    1519: 'क्रिया में सहभागी की संख्या अधिकतम सीमा तक पहुँची है', // 转盘活动参与次数已达上限

    1601: "यू 'ए बाओ वॉलेट मौजूद नहीं है!", //余额宝钱包不存在
    1602: "यू 'ए बाओ वॉलेट जमी जा चुका है।!", //余额宝钱包已冻结
    1604: "यू 'ए बाओ वॉलेट का संतुलन अपर्याप्त है!", //余额宝钱包余额不足

    2001: 'खेल मौजूद नहीं है', // 游戏不存在
    2002: 'विक्रेत रेकर्ड मौजूद नहीं है', // 销售记录不存在
    2003: 'वापस लिया गया या समाप्त', // 已兑奖或已过期
    2102: 'प्लेटफ़ॉर्म पर अपर्याप्त प्रतिक्रिया सीमा', // 平台提现额度不足

    8000: 'त्रिपक्षीय असंगति', //三方异常
    8001: 'खेल खुला नहीं है', //游戏未开启
    8002: 'उपयोगकर्ता पंजीकरण विफलता', //用户注册失败

    8003: 'साइट रखरखाव', //站点维护
    8004: 'त्रिपक्षीय अअनुक्रिया', //三方无响应
    8005: 'प्रमुख लेनदेन', //重复交易
    8006: 'साइट कोटा अपर्याप्त है कृपया फिर से प्रयास करें।', //站点额度不足请重试
    8007: 'साइट अपवाद', //站点异常
    8008: 'साइट की कमी', //站点额度不足

    9801: 'सेवा प्रदायक मौजूद नहीं है!', //服务商不存在
    98002: 'स्थानान्तरण मात्रा १ से बड़ा या बराबर होना चाहिए', //转入金额必须大于或等于1

    //im模块
    100040: 'एकल रेड एन्क्लोप राशि सही नहीं है', //单个红包金额不正确
    100041: 'कुल रेड एन्क्लोप राशि सही नहीं है', //红包总金额不正确
    100042: 'लाल कंवेलों की संख्या {maxNumber} से अधिक नहीं होती', //红包个数不可超过
    100043: 'एकल रेड एन्क्लोप राशि {minMoney} से कम नहीं हो सकती', //单个红包金额不可低于0.01
    100044: 'एकल रेड एन्क्लोप राशि {maxMoney} से अधिक नहीं हो सकती', //单个红包金额不可超过300
    100050: 'अस्तित्वहीन रेड एन्क्लोप', //不存在的红包
    100051: 'इस रेड एन्क्लोप को प्राप्त नहीं किया जा सकता', //不可领取该红包
    100060: 'रेड एन्क्लोप सुविधा अस्थायी रूप से अनुपलब्ध है', //红包功能暂不可用
    100070: 'रेड एन्क्लोप ओवरड्यू रिफंड विफल', //红包超期退款失败
    100010: 'चैट रूम कनेक्शन विफल', //聊天室连接失败
    100020: 'समूह मौजूद नहीं है, ऑपरेशन विफल', //群组不存在，操作失败
    100030: 'समूह का सदस्य नहीं है, ऑपरेशन विफल', //非本群人员，操作失败
    100031: 'उपयोगकर्ता को म्यूट किया गया है', //用户被禁言中
    100032: 'समूह को म्यूट किया गया है', //群组禁言中
    10: 'सामान्य रूप से दावा किया जा सकता है', //可以正常领取
    20: 'बहुत देर हो गई, रेड एन्क्लोप समाप्त हो गए', //手慢了,红包派完了
    30: '24 घंटे के भीतर दावा नहीं किया', //超过24小时未领取
    35: 'दावा करने की शर्तें पूरी नहीं होती', //不符合领取条件
    40: 'पहले ही सामान्य रूप से दावा किया गया है', //已经正常领取过了
    50: 'दावा सफल', //领取成功
    60: 'संबंधित मुद्रा के लिए कोई वॉलेट नहीं है', //无对应币种的钱包
    61: 'आप समूह के मालिक नहीं हैं', //您不是群主

    2401: 'खزانे की चोਟੀ मौजूद नहीं ਹੈ', //宝箱不存在
    2402: 'खजाने का रिकॉर्ड मौजूद नहीं है', //您不是群主
    2601: 'विनिमय सामग्री मौजूद नहीं है', // 兑换内容不存在
    2602: 'अवशिष्ट अंक पर्याप्त नहीं हैं', // 积分不足
    2604: 'अंक साइन-इन प्रक्रिया में नहीं है', // 积分签到未进行中
    2605: 'मैंने आज पहले ही साइन इन कर लिया है', // 积分已签到
    3001: 'साइन-इन की अनुमति नहीं है', // 不允许签到
    3002: 'लकी व्हील की अनुमति नहीं है', // 不允幸运大转盘
    3003: 'USDT निकासी की अनुमति नहीं है', // 不允许usdt提现
    3004: 'USDT रिचार्ज की अनुमति नहीं है', // 不允许usdt充值
    3005: 'QR कोड भुगतान की अनुमति नहीं है', // 不允许扫码支付
    3006: 'खजाने की गतिविधियों में भाग लेने की अनुमति नहीं है', // 不允许参加宝箱活动
    2403: 'खزانे की चोਟੀ अक्षम है', //宝箱已禁用
    2404: 'खزانे की चोਟੀ खोली ਗਈ है', //宝箱已开过了
    2405: 'खزانे की चोटी का दावा नहीं किया जा सकता', //宝箱无法领取
    2406: 'બોનસ 0 કરતાં વધારે હોવું જોઈએ', //奖金必须大于0
    2407: 'खزانे की चोटी का इनाम जारी कर दिया गया है', //该宝箱的奖品已经发放了
    2408: 'खزانे की चोटी खोलने में अपवाद', //宝箱开启异常
    2409: 'खزانे की चोਟੀ का नाम दोहराव', //宝箱名字重复
    2410: 'इनाम की मात्रा 0 से बढ़कर होनी चाहिए', //奖品数量必须大于0

    // 优惠券模块
    2501: 'छूट कोड उपलब्ध नहीं है या अस्थायी रूप से अनुपलब्ध है', //优惠券不存在或未启用
    2502: 'छूट कोड समाप्त हो गया है', //优惠券已过期
    2503: 'छूट कोड प्रयोग में लिया गया है', //优惠券已被使用
    2504: 'छूट कोड सत्यापन विफल', //优惠券核销失败
    2505: 'छूट कोड एक्शन पुरस्कार में प्रयोग किया गया है', //优惠券在活动奖励中使用
    2506: 'उपयोग की शर्तें पूरी नहीं हैं', //使用条件不满足
    2603: 'वीआईपी स्तर अपर्याप्त' // VIP等级不足
  },

  agencyCenterModule: {
    titleName: 'एजेंसी केंद्र',
    keywordPlaceholder: 'कृपया युजेरनेम नाम दर्ज करें',
    levelList: {
      0: 'लेवल 1',
      1: 'लेवल 2',
      2: 'लेवल 3',
      3: 'लेवल 4'
    },
    FindTitle: 'डेटा द्वारा खोजें',
    StartTime: 'शुरू होने का समय',
    EndTime: 'अंत समय',
    reselect: 'कृपया अंतिम तिथि पुनः चुनें',
    year: 'साल',
    month: 'माह',
    day: 'दिन',
    cancellation: 'रद्द करें',
    determine: 'पुष्टि करें',
    level: 'स्तर',
    placeholderUserName: 'कृपया युजेरनेम नाम दर्ज करें',
    balance: 'शेष',
    CodingQuantity: 'कोडिंग मात्रा',
    Type: 'प्रकार',
    Amount: 'रकम',
    Status: 'स्थिति',
    Time: 'समय'
  },

  signInModule: {
    promotions: 'प्रचारें',
    checkIn: 'चेक इन',
    dailyRewards: 'ढेर सारे पुरस्कार पाने के लिए प्रतिदिन चेक इन करें',
    go: 'जाएं',
    join: 'योगदान करें',
    titleName: 'साइन-इन',
    SurpriseBenefit: 'आश्चर्यजनक लाभ',
    Continuous: 'निरंतर चेक-इन शिष्टाचार',
    row: 'एक पंक्ति में',
    AttendanceBonus: 'उपस्थिति बोनस',
    Sign: 'बहुत सारे पुरस्कार पाने के लिए दैनिक साइन इन करें',
    tips: 'चेक-इन कार्य अभी उपलब्ध नहीं है',
    signList: {
      0: 'शून्य दिन',
      1: 'पहला दिन',
      2: 'दूसरे दिन',
      3: 'तीसरे दिन',
      4: 'चार दिन',
      5: 'पांच दिन',
      6: 'छह दिन',
      7: 'सात दिन'
    },
    explain: 'हस्ताक्षर करने के लिए पुनर्वार्ड डिफ़ॉल्ट मुद्रा वालेट में वितरित किया जाएगा.' //签到获取奖励将派发到默认币种钱包中。
  },

  wallet: {
    balance: 'शेष',
    topTitle: 'कुल वॉलेट',
    lastLogin: 'आखरी लॉगइन',
    totalBalance: 'कुल शेष',
    noConsumptionRecordsTip: 'फिलहाल कोई डेटा उपलब्ध नहीं है!',
    Recharge: 'रिचार्ज',
    Transfer: 'स्थानांतरण',
    Withdraw: 'निकालना',
    ShiftTo: 'पर बदलें',
    Remittance: 'प्रेषण',
    AddWallet: 'वॉलेट जोड़ें',
    wantAddWallet: 'क्या आप वॉलेट जोड़ना चाहते हैं?',
    correct: 'पुष्टि करें',
    deny: 'रद्द करें',
    wait: 'प्रतीक्षा कर रहा है',
    noWalletTip: 'वर्तमान में कोई वालेट उपलब्ध नहीं है, कृपया पहले एक वालेट जोड़ें!',
    central: 'केंद्री',
    centralWallet: 'केंद्रीय वालेट',
    noPaymentMethods: 'इस मुद्रा के लिए कोई बाइंडिंग पैसा पद्धति नहीं है!', //该货币没有绑定付款方式！
    Withdrawal: 'वापसी',
    BindCard: 'बाँध बैंक कार्ड', //绑定银行卡
    outCurrentWallet: 'स्थानांतरित राशि वर्तमान वॉलेट से अधिक है।', //超出当前钱包转出金额
    setWallet: 'डिफाल्ट वालेट सेट करें', // 设置默认钱包
    notRecharge: 'यह विधि मौजूदा पुनरार्ज करने को समर्थित नहीं करता. कृपया फिर चार्ज करने के लिए अन्य विधि चुनें',
    FirstRecharge: 'पहली रिचार्ज',
    FirstWithdrawal: 'प्रथम घटाएँ'
  },

  swapModule: {
    titleName: 'प्रेषण',
    Balance: 'शेष',
    placeholderEnterAmount: 'एक राशि दर्ज करें',
    Remittance: 'प्रेषण',
    Price: 'कीमत',
    per: 'प्रति',
    placeholderSearchName: 'मुद्रा द्वारा यहाँ खोजें',
    TokenName: 'सांकेतिक नाम',
    chooseWalletTip: 'कृपया मुद्रा वॉलेट को स्थानांतरित करना चुनें!',
    enterAmountTip: 'कृपया राशि दर्ज करें',
    SelectCurrency: 'मुद्रा चुनें',
    CurrencyName: 'धारा नाम',
    dissatisfyTip: 'विनिमय की शर्तें नहीं मिलीं!' //不满足汇兑条件!
  },

  rechargeModule: {
    titleName: 'रिचार्ज',
    CurrentBalance: 'वर्तमान शेष',
    Cumulative: 'संचयी रिचार्ज',
    RechargeMethod: 'रिचार्ज विधि',
    otc: 'ओटीसी',
    other: 'अन्य',
    paymentMethodsList: {
      0: 'बैंक कार्ड',
      1: 'इंटरनेट भुगतान'
    },
    PleaceSelect: 'कृपया चयन करें',
    PleaceSelectAmount: 'कृपया रिचार्ज राशि चुनें',
    PleaseEnter: 'कृपया दर्ज करें',
    ServiceCharge: 'सेवा शुल्क',
    ExchangeCharge: 'विनिमय शुल्क',
    Release: 'मुक्त करना',
    BuyNow: 'अभी खरीदें',
    MobilePhone: 'चल दूरभाष',
    WithdrawalAmount: 'निकाली गयी राशि',
    VipLevel: 'वीआईपी स्तर',
    VipIntegral: 'वीआईपी अभिन्न',
    cancellation: 'रद्द करें',
    determine: 'पुष्टि करें',
    Select: 'चुनें',
    WithdrawInfomations: 'जानकारी वापस लें',
    rechargeAmountEmptytTip: 'कृपया रिचार्ज राशि दर्ज करें!',
    cardTip: 'कृपया चैनल चुनें!',
    intoOtherTip: 'क्या पुनरार्ज करने के लिए तीसरी पार्टी में प्रविष्ट करना है?',
    Manufacturer: 'निर्माता का चयन करें',
    card: 'कृपया चैनल चुनें',
    userName: 'कृपया अपना भुगतान खाता संख्या या नाम दर्ज करें।',
    userRemark: 'कृपया टिप्पणी दर्ज करें',
    PaymentInformation: 'भुगतान जानकारी',
    PaymentNote: 'भुगतान नोट',
    min: 'न्यूनतम एकल भुगतान',
    max: 'अधिकतम राशि सीमाएं',
    BankCardName: 'बैंक',
    BankCardNumber: 'बैंक कार्ड क्रमांक',
    IFSC: 'IFSC या SWIFT',
    selectPaymentVendor: 'कृपया विक्रेता चुनें',
    TransactionRate: 'लेन', //交易汇率
    txidTip: 'कृपया अपना TXID भरें',
    AmountReceived: 'प्राप्त राशि', //实到金额
    AbnormalRemarks: 'असामान्य टिप्पणी', //异常备注
    transactionAmount: 'लेन', //交易金额
    notice: 'सूचना',
    specific: 'विशिष्ट राशि वास्तविक राशि के अधीन है जो जमा की गई है'
  },

  WithdrawModule: {
    titleName: 'निकालना',
    withdrawMethod: 'वाटघुराव विधि',
    PleaceSelectAmount: 'कृपया निकासी राशि का चयन करें',
    rechargeInfomations: 'रिचार्ज जानकारी',
    InsufficientBalanceTip: 'वर्तमान वॉलेट शेष अपर्याप्त है!',
    addBankTip: 'कृपया पहले अपना बैंक कार्ड जोड़ें!',
    withdrawAmountEmptytTip: 'कृपया निकासी राशि दर्ज करें!',
    noBankTip: 'इस भुगतान प्रकार के लिए फिलहाल कोई डेटा नहीं है!',
    selectCardTip: 'कृपया एक बैंक कार्ड चुनें!',
    RechargeAmount: 'पुनर्भरण राशि',
    remainingCodingTip: 'बाकी कोडिंग की मात्रा'
  },

  bankCradModule: {
    titleName: 'भुगतान की विधि',
    addBank: 'भुगतान के तरीके बाइंड करें',
    deleteTip: 'क्या आप इस पैसा पद्धति को मिटाना चाहते हैं?' //是否删除该支付方式？
  },

  addBankCradModule: {
    titleName: 'बाइन्ड पैमेंट विधि',
    PaymentMethods: 'पैमेंट विधि',
    PaymentVendor: 'पैमेंट विक्रेता',
    PaymentChannel: 'पैमेंट चैनल',
    BankCode: 'बैंक कोड',
    BankNumber: 'बैंक संख्या',
    AccountName: 'खाता नाम',
    BankBranch: 'बैंक ब्रैंच',
    PaymentAddress: 'पैमेंट पता',
    QRCodeAddress: 'क्यूरी कोड पता',
    Bind: 'बाइन्ड',
    selectMethodsTip: 'कृपया पैसा पद्धति चुनें!',
    selectVendorTip: 'कृपया एक पैसा विक्रेता चुनें!',
    formTip: 'कृपया फॉर्म पूरा करें!',
    SelectMethod: 'पैसा पद्धति चुनें',
    Country: 'देश',
    SelectCountry: 'देश चुनें',
    BankType: 'बैंक प्रकार',
    SelectBankType: 'खाता प्रकार का चयन करें',
    AccountType: 'खाता प्रकार',
    IFSC: 'IFSC Code',
    MobilePhone: 'मोबाइल फो',
    VerificationCode: 'परीक्षण कोड',
    Agreement: 'सहमता',
    SelectAgreement: 'मौजूदा चुनें',
    enterPhoneTip: 'कृपया फोन नंबर भरें!',
    correctphoneTip: 'कृपया सही फोन संख्या भरें!',
    pleaseSelectPaymentMethod: 'कृपया पैसा पद्धति चुनें',
    pleaseSelectCountry: 'कृपया एक देश चुनें',
    pleaseSelectAccountType: 'कृपया एक खाता प्रकार चुनें',
    Cardholder: 'कार्ड होल्डर',
    pleaseEnterCardholder: 'कृपया कार्ड होल्डर भरें',
    pleaseEnterIFSC: 'कृपया IFSC भरें',
    AccountNumber: 'खाता संख्या',
    pleaseEnterAccountNumber: 'कृपया अपना खाता संख्या भरें',
    Phone: 'फोन',
    pleaseEnterPhone: 'कृपया अपना फोन भरें',
    Network: 'नेटवर्क',
    pleaseSelectNetwork: 'कृपया नेटवर्क चुनें',
    Account: 'खाता',
    pleaseEnterAccount: 'कृपया अपना खाता भरें',
    Address: 'पता',
    pleaseEnterAddress: 'कृपया पता भरें',
    QRCode: 'क्यूआर कोड',
    SelectNetwork: 'नेटवर्क चुनें',
    pleaseEnterEmail: 'कृपया इमेल भरें',
    correctEmailTip: 'कृपया सही ईमेल पता भरें!',
    getCode: 'कृपया सत्यापन कोड प्राप्त करें!', //请获取验证码!
    PixAccount: 'पिक्स खाता',
    PixAccountTip: 'कृपया पिक्स खाता भरें',
    CPFNumber: 'CPF संख्या',
    CPFNumberTip: 'कृपया CPF संख्या भरें'
  },

  otcOrderModule: {
    dispute: 'विवाद',
    titleName: 'मेरा ओटीसी ऑर्डर',
    typeList: {
      0: 'रिचार्ज',
      1: 'निकालना'
    },
    statusList: {
      0: 'प्रक्रिया में',
      1: 'सफल',
      2: 'असफल'
    }
  },

  otcOrderDetailsModule: {
    titleName: 'विवरण',
    BalanceRecharge: 'शेष पुनर्भरण',
    BalanceWithdraw: 'शेष राशि वापस लेना',
    Status: 'स्थिति',
    PaymentMotheds: 'भुगतान प्रक्रिया',
    Currency: 'मुद्रा',
    BilINo: 'बिल नंबर',
    Time: 'समय',
    Receive: 'प्राप्त करें',
    Complete: 'पूरा',
    Wondering: 'किसी ऑर्डर के बारे में सोच रहे हैं?',
    dispute: 'क्या इस आदेश को लेकर कोई विवाद है?',
    No: 'नहीं',
    Yes: 'हाँ'
  },

  common: {
    successCodeTip: 'ऑपरेशन सफल!',
    PleaceSelect: 'कृपया चयन करें',
    PleaseEnter: 'कृपया दर्ज करें',
    formRequestTip: 'कृपया फॉर्म भरना पूरा करें!',
    InputRoomName: 'कृपया इनपुट कमरा नाम',
    SelectLanguage: 'कृपया भाषा चुनें',
    SelectType: 'कृपया प्रकार चुनें',
    SelectScore: 'कृपया अंक चुनें',
    evaluatedService: 'आप पहले से ही इस सेवा का मूल्यान किया है',
    contactAdministrator: 'कृपया प्रशासक से संपर्क करें!',
    EnterNumber: 'कृपया संख्या भरें',
    EnterMoney: 'कृपया पैसा भरें',
    NoWallet: 'कोई वालेट नहीं',
    InsufficientWalletAmount: 'अपर्याप्त वालेट मात्रा',
    SendFail: 'असफल भेजें',
    loginSuccess: 'लागइन सफलता',
    InputNickname: 'कृपया इनपुट उपनाम',
    registerSuccess: 'रेजिस्टर सफलता',
    SelectMoney: 'कृपया पैसा चुनें',
    isSureTip: 'क्या आप निश्चित है कि आपको तेज स्थानान्तरण की जरूरत नहीं है?',
    noMoney: 'मौजूदा वालेट बैलेट 0 है!',
    packetsNumberTip: 'लाल पैकेट की संख्या 0 से बढ़ी है!',
    PleaseEnterAccountOrPhone: 'कृपया खाता या फोन दर्ज करें',
    PleaseSelect: 'कृपया चुनें'
  },

  tradeType: {
    1: 'रिचार्ज',
    2: 'निकालन',
    3: 'सिस्टम उपहार',
    4: 'बाहर स्थानांतरण',
    5: 'पर बदलें',
    6: 'अंक',
    7: 'किसी तीसरे पक्ष को हस्तांतरित',
    8: 'तृतीय पक्ष स्थानांतरण',
    9: 'बाज़ी लगाना',
    10: 'लॉटरी जीतना',
    11: 'मिनी गेम सट्टेबाजी',
    12: 'मिनी गेम्स में जीतना',
    13: 'फिरौती', //余额宝转出
    14: 'भाग्य निवेशें', //转入余额宝
    15: 'भाग्य आय', //余额宝收益
    17: 'विचड्रावेल पुनरावृत्ति', //提现退回
    18: 'विच्छेद करें', //提现扣减
    19: 'लाल कन्वेलोप वितरण', //红包发放
    20: 'लाल कंवेल प्राप्त करें', //红包领取
    21: 'लाल कंवेलप वापस', //红包退还
    22: 'वीआईपी अपग्रेड बोनस', //VIP升级彩金发放
    23: 'वीआईपी साप्ताहिक बोनस', //VIP周彩金发放
    24: 'वीआईपी मासिक बोनस', //VIP月彩金发放
    25: 'गतिविधि कार्य', //活动任务
    26: 'इंटीग्रल एक्सचेंज', //积分兑换商城
    27: 'लुकी व्हील', //幸运大转盘
    28: 'ट्रेजर बॉक्स', //宝箱
    29: 'रिचार्ज दान', //充值赠送
    30: 'गतिविधि रिचार्ज दान', //活动充值赠送
    31: 'साइन इन गतिविधि', //签到活动
    32: 'ऑर्डर रद्दीकरण', //注单撤销
    33: 'रिबेट निरस्तीकरण', //返点撤销
    97: 'खाता समायोजन' //调账
  },

  passwordModule: {
    titleName: 'पासवर्ड',
    Account: 'खाते का पासवर्ड',
    Payment: 'भुगतान पासवर्ड',
    SetAccount: 'खाता पासवर्ड सेट करें',
    SetPayment: 'भुगतान पासवर्ड सेट करें',
    OldPassword: 'पुराना पासवर्ड',
    NewPassword: 'नया पासवर्ड',
    Password: 'पासवर्ड',
    ConfirmPassword: 'पासवर्ड की पुष्टि कीजिये',
    Verify: 'सत्यापित करें',
    FillOld: 'पुराना पासवर्ड भरें',
    FillNew: 'नया पासवर्ड भरें',
    FillPassword: 'पासवर्ड भरें',
    FillConfirmation: 'पुनः पुष्टिकरण भरें',
    modification: 'असंगत पासवर्ड संशोधन!',
    settings: 'असंगत पासवर्ड सेटिंग्स!',
    sameTip: 'पुराना पासवर्ड नया पासवर्ड से अलग होना चाहिए.',
    lengthTip: 'कृपया पैलेंट पासवर्ड लंबाई 6 अंक में सेट करें.',
    Change: 'बदलें',
    CurrentPhone: 'मौजूदा फोन',
    CurrentEmail: 'मौजूदा इमेल',
    SetPhone: 'फोन सेट करें',
    SetEmail: 'इमेल सेट करें'
  },

  redEnvelopeModule: {
    notStarted: 'गतिविधि अभी शुरू नहीं हुई है',
    Scramble: 'लाल लिफाफे के लिए मारामारी',
    StartLooting: 'प्रारंभ',
    Unfortunately: 'अफ़सोस की बात है! लाल लिफाफा नहीं लिया!',
    Keep: 'चलते रहे!प्रयास जारी रखें!',
    snatched: 'लाल लिफाफा लूट गया! अगली बार फिर आइएगा!',
    Quit: 'छोडें',
    GO: 'जाएं',
    Whoaa: 'वाह! आप लाल पैकेट मिलें',
    RemainingTime: 'बाकी समय'
  },

  consumptionDetails: {
    titleName: 'विवरण',
    TransactionStatus: 'लेन-देन की स्थिति',
    AuditStatus: 'ऑडिट स्थिति',
    TradeObject: 'ट्रेडऑब्जेक्ट',
    Coin: 'लेनदेन मुद्रा',
    BilINo: 'क्रम संख्या',
    TradeTime: 'ट्रेड का समय',
    BillingService: 'बिलिंग सेवा',
    Wondering: 'किसी ऑर्डर के बारे में सोच रहे हैं?',
    bankCardNum: 'बैंक कार्ड क्रमांक',
    bankCardUserName: 'बैंक कार्ड प्रयोक्ता नाम',
    bankCode: 'बैंक कोड',
    Copy: 'नकल करें',
    InProgress: 'प्रगति में है',
    BeingProcessed: 'पैसा प्रक्रिया किया जा रहा है',
    expired: 'क्रम मियाद या मियाद समाप्त है',
    Lock: 'ताला लगाएँ',
    trading: 'ट्रेडिंग',
    Remark: 'टिप्पणी',
    ActualCollectionUSDT: 'वास्तविक संग्रह USDT',
    WithdrawalAmount: 'हटावाल मात्रा',
    actualAmount: 'वास्तविक मात्रा प्राप्त'
  },

  orderStatusList: {
    1: 'क्रेता इरादा लेनदेन',
    4: 'रिचार्ज पार्टी पहले ही भुगतान कर चुकी है',
    5: 'लेनदेन सफल',
    6: 'लेन-देन विफल',
    7: 'विवादित आर्डर'
  },

  tradeStatusList: {
    1: 'लेनदेन सफल',
    0: 'लेन-देन में',
    2: 'लेन-देन विफल'
  },

  casinoModule: {
    titleName: 'स्लॉट्स',
    noData: 'कोई और डेटा नहीं है',
    enterGame: 'क्या आप इस खेल में प्रविष्ट करना चाहते हैं?',
    QuickTransfer: 'तुरंत स्थानान्तरण',
    My: 'मेरा'
  },

  liveModule: {
    titleName: 'फर प्रसारण',
    Categories: 'श्रेणियाँ',
    SortBy: 'इसके अनुसार सजाएं'
  },

  sportsModule: {
    titleName: 'खेल',
    enterGame: 'क्या आप खेल में प्रविष्ट करना चाहते हैं?'
  },

  task: {
		Task: 'कार्य',
		taskDetail: 'कार्य विवरण',
		mytask: 'मेरा काम',
		unfnished: 'बेरोगन',
		completed: 'संदेश निर्माण',
		TaskName: 'कार्य नाम',
		TaskDescription: 'कार्य प्रोग्राम',
		TaskNumber: 'कार्य क्रमांक',
		TaskMoney: 'कार्य धन',
		ALL: 'सब',
		Unfnished: 'बेरोगन',
		Completed: 'संदेश निर्माण',
		Underway: 'जारी',
		DEposit: 'जमा',
		ongoing: 'व्यवहारै',
		failed: 'असफल',
		finished: 'समाप्त',
		claimed: 'अनुरोध',
	},

  SattaKing: {
    Details: 'विवरण',
    PackUp: 'पैक अप',
    BetClose: 'बन्द करें:',
    second: 'पहले सेकंड',
    seconds: 'पहले सेकंड',
    notes0: 'कुल में 0 नोट',
    injection: 'कुल में 1 इन्जेक्शन',
    shots: 'कुल में शॉट',
    InstantBet: 'तुरंत बेट',
    LotteryTime: 'लोटेरी समय',
    BettingContent: 'सामग्री बेटिंग',
    JodirRule: 'कम से कम 1 संख्या चुनें, चयनित संख्या रेखाने की संख्या के अनुसार समान है, जैसा विजेता है.', //至少选择1个号码，选号与开奖号码一致，即为中奖。
    AndarRule:
      'एक अंक से कम से कम एक संख्या चुनें, और चुना गया संख्या एक ही स्थिति में रेखाने की संख्या के बराबर है, जैसा कि विजेता है.', //从个位上至少选择1个号码，选号与相同位置上的开奖号码一致，即为中奖。
    BndarRule:
      'दस में से कम से कम एक संख्या चुनें, और चयनित संख्या एक ही स्थिति में रेखाने की संख्या के बराबर है, जैसा है, जीता है.', //从十位上至少选择1个号码，选号与相同位置上的开奖号码一致，即为中奖。
    stoppedBetTip: 'बातें रोकी गई हैं!', //已停止下注！
    betContentEmptyTip: 'बेट सामग्री खाली नहीं है!', //投注内容不能为空!
    betAmountEmptyTip: 'बैट खाली नहीं हो सकती!', //投注金额不能为空!
    betEmptyTip: 'कृपया सट्टेबाजी संख्या चुनें।', //请选择下注号码
    insufficient: 'वालेट बैलेट अपर्याप्त है!', //钱包余额不足!
    GameType: 'खेल प्रकार',
    BettingContent2: 'बेटिंग सामग्री',
    betMax: 'बाज़ी'
  },
  yueb: {
    TotalAmount: 'कुल रकम',
    Totalearnings: 'कुल आय',
    Annualized: 'सालाना',
    TransferIn: 'में स्थानांतरित करें',
    Rollout: 'रोलआउट',
    All: 'सब',
    freeze: 'आपका खाता जोखिम में है और अस्थायी रूप से जमा या डेबिट नहीं किया जा सकता है।',
    HeIp: 'चूल',
    TransferOut: 'संतुलन के लिए स्थानांतरण',
    Mybalance: 'मेरा संतुलन खजाना',
    Earnings: 'अर्जन',
    Balance: 'संतुलन',
    TransferInAmount: 'राशि में अंतरण',
    TransferOutAmount: 'राशि बाहर हस्तांतरण',
    Full: 'फुल',
    EarningsLog: 'उपार्जन लॉग',
    IncomeRule: 'आय नियम',
    frozen: 'खाता जमे हुए',
    tip1: 'स्थानान्तरण मात्रा 0 नहीं है!', //转入金额不能为0
    tip2: 'स्थानान्तरित मात्रा 0 नहीं है!' //转出金额不能为0
  },

  PersonalInformation: {
    title: 'व्यक्तिगत जानकारी',
    set: 'सेट करें',
    Current: 'मौजूदा',
    Username: 'उपयोक्ता नाम',
    IdentityId: 'पहचान आईडी',
    UsernameEnter: 'कृपया उपयोक्ता नाम भरें',
    IdentityIdEnter: 'कृपया परिचय आईडी भरें'
  },

  winGo: {
    TimeRemaining: 'समय शेष',
    Chart: 'साफ करें',
    TrxWinGo: 'ट्रक्स जीत जाओ',
    Block: 'भूलना',
    BS: 'बी/एस',
    Quantity: 'मात्रा',
    Reset: 'रिसेट करें',
    BettingCloseTip1: 'पहले बंद करें ',
    BettingCloseTip2: ' सेकण्ड, सभी अच्छी भावना चाहें'
  },
  pk10: {
    //新游戏
    gameHistory: 'खेल इतिहास',
    OE: 'ओ/ई'
  },
  chatRoom: {
    search: 'खोज',
    syncing: 'सिंक हो रहा है',
    messages: 'संदेश',
    contacts: 'संपर्क',
    disconnect: 'आप डिस्कनेक्ट हो गए हैं',
    send_rpkt: 'रेड पैकेट भेजें',
    random_rpkt: 'रैंडम रेड पैकेट',
    normal_rpkt: 'सामान्य रेड पैकेट',
    rpkt_count: 'संख्या',
    enter_rpkt: 'संख्या दर्ज करें',
    pieces: 'टुकड़े',
    random: 'रैंडम',
    total_amt: 'कुल राशि',
    single_amt: 'एकल राशि',
    put_money: 'पैसे डालें',
    back: 'वापस',
    is_group: 'क्या यह एक समूह चैट है?',
    max_rcv_cnt: 'अधिकतम प्राप्त संख्या',
    cover_content: 'कवर डिस्प्ले सामग्री',
    congrats: 'शुभकामनाएँ',
    min_single: 'न्यूनतम एकल रेड पैकेट',
    retry: 'पुनः प्रयास करें',
    set_up: 'सेटिंग',
    usr_cancel: 'उपयोगकर्ता ने रद्द कर दिया',
    welcome: 'उपयोग करने के लिए स्वागत है',
    region: 'क्षेत्र',
    phone_num: 'फोन नंबर',
    enter_phone: 'फोन नंबर दर्ज करें',
    password: 'पासवर्ड',
    enter_pwd: 'पासवर्ड दर्ज करें',
    login: 'लॉग इन',
    no_account: 'कोई खाता नहीं है',
    register: 'अभी पंजीकरण करें',
    china: 'चीन',
    copy_success: 'कॉपी सफल',
    contact: 'संपर्क',
    recent_sess: 'हाल की सत्र',
    my_friends: 'मेरे मित्र',
    my_groups: 'मेरे समूह',
    op_success: 'ऑपरेशन सफल',
    op_failed: 'ऑपरेशन विफल',
    forward_success: 'फॉरवर्ड सफल',
    send_success: 'भेजना सफल',
    start_group: 'समूह बनाएँ',
    grp_fsname: 'भविष्य के खोज के लिए समूह का नाम',
    grp_members: 'समूह सदस्य',
    people: 'लोग',
    create_comp: 'निर्माण पूर्ण',
    create_succ: 'निर्माण सफल',
    upload_failed: 'अपलोड विफल',
    profile: 'प्रोफाइल',
    avatar: 'एवेटार',
    nickname: 'निकनेम',
    gender: 'लिंग',
    birthday: 'जन्मदिन',
    email: 'ईमेल',
    male: 'पुरुष',
    female: 'महिला',
    secret: 'गोपनीय',
    no_more_res: 'कोई और खोज परिणाम नहीं',
    comprehensive: 'विवरणात्मक',
    group: 'समूह',
    chat_records: 'चैट रिकॉर्ड्स',
    files: 'फाइलें',
    related_records: 'संबंधित चैट रिकॉर्ड्स',
    add_group: 'समूह चैट जोड़ें',
    add_friend: 'मित्र जोड़ें',
    cancel: 'रद्द करें',
    no_search_res: 'कोई प्रासंगिक परिणाम नहीं मिला',
    enter_grp: 'समूह चैट में प्रवेश करें',
    or_phone_add: 'या फोन नंबर',
    grp_chat_verify: 'समूह चैट सत्यापन',
    friend_verify: 'मित्र सत्यापन',
    send: 'भेजें',
    join_group: 'समूह में शामिल हों',
    friends: 'मित्र',
    apply: 'आवेदन करें',
    enter_content: 'सामग्री दर्ज करें',
    joined_grp: 'आप इस समूह में शामिल हो चुके हैं',
    get_sess_failed: 'सत्र जानकारी प्राप्त करने में विफल',
    send_failed: 'भेजने में विफल',
    set_note: 'नोट सेट करें',
    my_name: 'मेरा नाम',
    number: 'नंबर',
    save: 'सहेजें',
    copy: 'कॉपी करें',
    set_success: 'सेट सफल',
    set_failed: 'सेट विफल',
    modify_succ: 'संशोधन सफल',
    modify_failed: 'संशोधन विफल',
    server_addr: 'सर्वर पता',
    address: 'पता',
    biz_srv_addr: 'व्यापार सेवा पता',
    config_srv_addr: 'कॉन्फ़िगरेशन सेवा पता',
    save_restart: 'प्रभावी होने के लिए सहेजें और पुनरारंभ करें',
    name: 'नाम',
    config: 'कॉन्फ़िगरेशन',
    domain: 'डोमेन',
    friend_set: 'मित्र सेटिंग्स',
    add_to_bl: 'ब्लैकलिस्ट में जोड़ें',
    remove_friend: 'मित्र हटाएं',
    confirm_remove: 'क्या आप वास्तव में हटाना चाहते हैं',
    frd_rel: 'मित्रता?',
    user: 'उपयोगकर्ता',
    add: 'जोड़ें',
    grp_nickname: 'ग्रुप उपनाम',
    join_time: 'जॉइन समय',
    join_method: 'जॉइन विधि',
    send_msg: 'संदेश भेजें',
    invite_group: 'ग्रुप में आमंत्रित करें',
    scan_code_join: 'जॉइन करने के लिए कोड स्कैन करें',
    search_join: 'जॉइन करने के लिए खोजें',
    draft: 'ड्राफ्ट',
    items: 'आइटम',
    everyone: 'सभी',
    someone: 'कोई',
    you: 'आप',
    grp_announce: 'ग्रुप घोषणा',
    pin: 'पिन',
    remove: 'हटाएं',
    mark_read: 'पढ़ा हुआ मार्क करें',
    pin_failed: 'पिन विफल',
    remove_failed: 'हटाने में विफल',
    connecting: 'जुड़ रहा है',
    conn_failed: 'कनेक्शन विफल',
    scan: 'स्कैन करें',
    add_grp: 'ग्रुप जोड़ें',
    exist: 'मौजूद है',
    grp: 'ग्रुप',
    sgrp: 'समूह',
    sgrops: 'समूहों',
    apply_grp: 'इस ग्रुप में शामिल होने के लिए आवेदन करें',
    qr_code: 'क्यूआर कोड',
    scan_qr_code: 'नीचे क्यूआर कोड स्कैन करें',
    add_me_friend: 'मुझे दोस्त के रूप में जोड़ें',
    join_grp_now: 'अब इस ग्रुप में शामिल हों',
    apply_to_join: 'जॉइन करने के लिए आवेदन करें',
    say_hello: 'नमस्ते कहें',
    agree: 'सहमत',
    accept: 'स्वीकार करें',
    refused: 'अस्वीकृत',
    wait_verify: 'सत्यापन की प्रतीक्षा कर रहे हैं',
    agreed: 'सहमत',
    my_app: 'मेरे आवेदन',
    grp_notif: 'ग्रुप सूचनाएँ',
    friend_req: 'मित्र अनुरोध',
    source: 'स्रोत',
    passed: 'पारित',
    rejected: 'अस्वीकृत',
    grp_mem_invite: 'ग्रुप सदस्य निमंत्रण',
    search_grp: 'ग्रुप खोजें',
    scan_qr: 'क्यूआर कोड स्कैन करें',
    new_grp_chat: 'नया ग्रुप चैट',
    new_friend: 'नया दोस्त',
    no_data: 'कोई डेटा उपलब्ध नहीं',
    grp_join_app: 'ग्रुप जॉइन आवेदन',
    my_req: 'मेरे अनुरोध',
    create_grp_chat: 'ग्रुप चैट बनाएं',
    full_use: 'पूर्ण उपयोग',
    ask_admin: 'आईडी के लिए व्यवस्थापक या टीम सदस्य से पूछें',
    scan_card: 'क्यूआर कोड बिजनेस कार्ड स्कैन करें',
    by_phone: 'फोन नंबर द्वारा',
    search_add: 'खोजें और जोड़ें',
    my_grps: 'मेरे समूह',
    my_created: 'मेरे द्वारा बनाया गया',
    my_joined: 'मेरे द्वारा जोड़ा गया',
    search_friend: 'मित्र खोजें',
    join_grp: 'समूह चैट में शामिल हों',
    scan_to_join: 'शामिल होने के लिए स्कैन करें',
    grp_id_join: 'समूह ID द्वारा शामिल हों',
    confirm_rm: 'चयनित समूह सदस्यों को हटाने की पुष्टि करें',
    confirm_transfer: 'समूह स्वामित्व को स्थानांतरित करने की पुष्टि करें',
    question_mark: '?',
    grp_set: 'समूह चैट सेटिंग्स',
    dissolve_grp: 'समूह चैट समाप्त करें',
    exit_grp: 'समूह चैट से बाहर निकलें',
    confirm_exit: 'क्या आप वाकई वर्तमान समूह चैट से बाहर निकलना चाहते हैं?',
    confirm_dissolve: 'क्या आप वाकई वर्तमान समूह चैट समाप्त करना चाहते हैं?',
    work_grp: 'कार्य समूह',
    modify_grp_name: 'समूह चैट नाम बदलें',
    after_modify: 'नाम बदलने के बाद',
    notify_mem: 'समूह में अन्य सदस्यों को सूचित करेगा',
    downloading: 'डाउनलोड हो रहा है',
    download_succ: 'डाउनलोड सफल',
    saved_album: 'एल्बम में सहेजा गया',
    save_failed: 'सहेजना विफल',
    download_failed: 'डाउनलोड विफल',
    select_by_fr: 'मित्र द्वारा चयन करें',
    select_by_grp: 'समूह चैट द्वारा चयन करें',
    select_by_str: 'फ्रेमवर्क द्वारा चयन करें',
    view_more_contacts: 'अधिक संबंधित संपर्क देखें',
    view_more_grps: 'अधिक संबंधित समूह देखें',
    view_more_records: 'अधिक संबंधित चैट रिकॉर्ड देखें',
    view_more_docs: 'अधिक संबंधित दस्तावेज़ देखें',
    new_messages: 'नए संदेश',
    refused_by_recipient: 'संदेश भेजा गया, लेकिन प्राप्तकर्ता द्वारा अस्वीकृत',
    enabled_fr_verification:
      'दूसरे पक्ष ने मित्र सत्यापन को सक्षम किया है, और आप उनके मित्र नहीं हैं। कृपया पहले मित्र सत्यापन भेजें। आप केवल तब चैट कर सकते हैं जब दूसरे पक्ष सत्यापन को पार कर लें।',
    listen_upload: 'बाहरी ड्रैग और ड्रॉप फ़ाइल अपलोड के लिए सुनें',
    drag_supports: 'ड्रैग और ड्रॉप केवल छवियों का समर्थन करता है',
    send_question: 'भेजें',
    num_of_images: 'छवियाँ',
    confirm: 'पुष्टि करें',
    offline: 'ऑफ़लाइन',
    online: 'ऑनलाइन',
    rpkt_info: "'s लाल पैकेट",
    yuan: 'युआन',
    credited_to_bal: 'बैलेंस में जमा किया गया, सीधे खर्च किया जा सकता है',
    received: 'प्राप्त',
    total: 'कुल',
    self_rcvd_info: 'स्वयं प्राप्त लाल पैकेट की जानकारी',
    self_sent_rpkt: 'क्या यह आपके द्वारा भेजा गया लाल पैकेट है',
    rcv_comp: 'प्राप्त पूरा सेटअप स्थिति',
    invite_mem: 'सदस्यों को आमंत्रित करें',
    select_remind: 'किसे याद दिलाना है चयन करें',
    set_admin: 'व्यवस्थापक सेट करें',
    mute_mem: 'सदस्यों को म्यूट करें',
    rm_grp_mem: 'समूह के सदस्यों को हटाएं',
    grp_owner: 'स्वामी',
    remove_out: 'हटाएं',
    view_all_mem: 'सभी समूह सदस्य देखें',
    new_grp: 'नया समूह',
    album: 'एल्बम',
    shoot: 'शूट',
    rpkt: 'लाल पैकेट',
    ShareBet: 'साझा सट्टा',
    image: 'छवि',
    video: 'वीडियो',
    take_photo: 'फोटो लें',
    record: 'रिकॉर्ड',
    reply: 'जवाब',
    grp_admin_mute_all: 'समूह के मालिक या व्यवस्थापक ने समूह-व्यापी म्यूट सक्षम कर दिया है',
    no_longer_in_grp: 'आप अब इस समूह में नहीं हैं',
    muted: 'आप म्यूट हैं',
    added_to_blacklist: 'दूसरी पार्टी को ब्लैकलिस्ट में जोड़ दिया गया है',
    msg_send_based_on: 'संदेश आधारित पर भेजा गया',
    find_data: 'संबंधित डेटा मिला',
    update_status: 'स्थिति अपडेट करें',
    unsupported_type: 'असमर्थित संदेश प्रकार',
    save_image: 'छवि सहेजें',
    saved_to_album: 'सिस्टम एलबम में सहेजा गया',
    issue: 'मुद्दा',
    small: 'छोटा',
    big: 'बड़ा',
    double: 'डबल',
    single: 'एकल',
    issue_number: 'मुद्दा संख्या',
    winning_number: 'विजेता संख्या',
    sum: 'योग',
    size: 'आकार',
    single_double: 'एकल या डबल',
    select_lot_type: 'लॉटरी प्रकार चुनें',
    hide_popup: 'स्टार्टअप पर पॉपअप छुपाएं',
    show_popup: 'पॉपअप दिखाएं',
    loading_issues: 'मुद्दे लोड हो रहे हैं',
    time_to_open: 'खुलने का समय',
    drawing: 'ड्राइंग',
    loading: 'लोड हो रहा है',
    collapse: 'सिकोड़ें',
    incorrect_issue: 'गलत मुद्दा संख्या',
    draw_time: 'ड्रॉ समय',
    open: 'खुला',
    view_receipt: 'रसीद विवरण देखें',
    see_luck: 'सभी की किस्मत देखें',
    rpkt_exceeded: 'समाप्त',
    rpkt_record: 'लाल पैकेट रिकॉर्ड',
    wechat_rpkt: 'वीचैट लाल पैकेट',
    unknown_type: 'अज्ञात संदेश प्रकार',
    tomorrow: 'कल',
    yesterday: 'कल',
    year: 'साल',
    month: 'महीना',
    day: 'दिन',
    seconds: 'सेकंड',
    just_now: 'अभी',
    minute: 'मिनट',
    hour: 'घंटा',
    days: 'दिन',
    emoji: 'इमोजी',
    have_friends: 'अब आप दोस्त हैं',
    start_chat: 'चैट शुरू करें',
    crt_grp: 'समूह चैट बनाई',
    invite: 'आमंत्रित किया',
    kick: 'निकाला गया',
    left_grp: 'समूह चैट से बाहर हो गया',
    grp_name: 'समूह का नाम है',
    grp_img: 'समूह का अवतार',
    grp_intro: 'समूह परिचय',
    mod: 'संशोधित किया',
    trans_own: 'समूह का मालिक स्थानांतरित किया',
    diss_grp: 'समूह चैट समाप्त की',
    mod_grp_name: 'समूह का नाम बदला',
    trans_own2: 'समूह का मालिक स्थानांतरित करें',
    left_grp2: 'समूह छोड़ दिया',
    no_valid: 'कोई मान्य सामग्री नहीं मिली',
    period: 'अवधि',
    BettingRecord: 'सट्टा रिकॉर्ड/साझा करें',
    Share: 'साझा करें',
    MultipleChoice: 'बहुविकल्पीय',
    SingleChoice: 'एकल विकल्प',
    SelectAll: 'सभी चुनें',
    CurrentSession: 'वर्तमान सत्र',
    Complete: 'पूरा',
    ChooseOneTip: 'कम से कम एक चुनें',
    NotDrawn: 'अभी तक नहीं खींचा गया',
    GroupOwner: 'समूह मालिक',
    Administrator: 'प्रशासक',
    ModifiedColor: 'रंग योजना परिवर्धित करें',
    SelectColor: 'रंग विविध चुनें',
    BettingPeriod: 'बेटिंग अवधि संख्या',
    FollowInvestment: 'निवेश का पालन करें',
    OrderSharing: 'आदेश साझा करना',
    ShareBettingScheme: 'बेटिंग योजना साझा करें',
    bet: 'बेट',
    bets: 'बेट्स',
    TotalAmount: 'कुल राशि',
    AccountBalance: 'खाता संतुलन',
    SingleBetAmount: 'एकल बेट राशि',
    multiple: 'कई',
    multiples: 'कई',
    LoadMore: 'और लोड करें',
    ShoppingCartEmpty: 'शॉपिंग कार्ट खाली है',
    PageNotFound: 'पृष्ठ नहीं मिला',
    NoSearchResults: 'कोई खोज परिणाम नहीं',
    NoShippingAddress: 'कोई शिपिंग पता नहीं',
    NoWiFi: 'कोई वाईफाई नहीं',
    OrderEmpty: 'आदेश खाली है',
    NoCoupons: 'कोई कूपन नहीं',
    NoCollection: 'कोई संग्रह नहीं',
    NoPermission: 'कोई अनुमति नहीं',
    NoHistory: 'कोई इतिहास नहीं',
    NoNewsList: 'कोई समाचार सूची नहीं',
    MessageEmpty: 'संदेश सूची खाली है',
    ListEmpty: 'सूची खाली है',
    DataNull: 'डेटा शून्य',
    NoCommentsYet: 'अभी तक कोई टिप्पणी नहीं',
    Selected: 'चयनित',
    Remove: 'हटाएं',
    BeBeingSent: 'भेज रहा है',
    Open: 'खोलें',
    loading2: 'लोड किया जा रहा है...',
    Declined: 'अस्वीकारित',
    PendingVerification: 'सत्यापन के लिए प्रतीक्षा कर रहा है',
    Agreed: 'स्वीकारित',
    selectAny: 'एकाधिक चयन',
    selecOne: 'एकल चयन',
    nowChat: 'हाल की चैट',
    nowForword: 'हाल की फॉरवर्ड',
    sendTo: 'भेजें',
    sharingSuccess: 'साझा करने में सफल',
    backGamePage: 'खेल पृष्ठ पर वापस जाएं',
    toImPage: 'चैट पृष्ठ पर बने रहें',
    District: 'जिला',
    MobilePhone: 'मोबाइल फोन नंबर',
    EnterMobileNumber: 'कृपया अपना मोबाइल नंबर दर्ज करें',
    Password: 'पासवर्ड',
    EnterPassword: 'कृपया पासवर्ड दर्ज करें',
    LogIn: 'लॉग इन करें',
    NoAccount: 'क्या आपके पास अभी तक खाता नहीं है?',
    RegisterNow: 'अब पंजीकरण करें',
    CopySuccessful: 'कॉपी सफल',
    SuccessfulForwarding: 'सफल फॉरवर्डिंग',
    DescriptionFailed: 'विवरण सत्र की जानकारी प्राप्त करने में विफल',
    ApplyToJoin: 'शामिल होने के लिए आवेदन करें',
    GreetSb: 'किसी को नमस्ते कहें',
    Agree: 'सहमत',
    Accept: 'स्वीकृत',
    SuccessfulOperation: 'सफल ऑपरेशन',
    OperationFailure: 'ऑपरेशन विफल',
    MyApplication: 'मेरा आवेदन',
    GroupNotification: 'समूह सूचना',
    FriendRequest: 'मित्र अनुरोध',
    FailedGetList: 'सूची प्राप्त करने में विफल। कृपया फिर से प्रयास करें',
    ShareSuccess: 'शेयर बेटिंग सफलता',
    article: 'लेख',
    possessor: 'स्वामी',
    SomeoneYou: 'कोई @आप',
    GroupAnnouncement: 'समूह घोषणा',
    Pinned: 'पिन किया गया',
    MarkRead: 'पढ़ा हुआ मार्क करें',
    RoofFailure: 'पिनिंग विफल',
    RemovalFailure: 'हटाने में विफल',
    BeDownloading: 'डाउनलोड हो रहा है',
    DownloadedSuccessfully: 'डाउनलोड सफल, गैलरी में सहेजा गया',
    SaveFailure: 'सहेजने में विफल',
    DownloadFailure: 'डाउनलोड विफल',
    FailedObtainPersonal: 'व्यक्तिगत जानकारी प्राप्त करने में विफल',
    RecentlyUsed: 'हाल ही में उपयोग किया',
    AllStickers: 'सभी स्टिकर्स',
    addContacts: 'संपर्कों में जोड़ें',
    finish: 'समाप्त करें',
    notes: 'नोट्स',
    myAccount: 'मेरा खाता संख्या',
    account: 'खाता',
    chatMessages: 'चैट संदेश',
    groupName: 'समूह का नाम',
    GroupCode: 'समूह का क्यूआर कोड',
    groupNotice: 'समूह सूचना',
    notSet: 'सेट नहीं किया गया',
    groupMute: 'समूह म्यूट',
    groupTransfer: 'समूह मालिक स्थानांतरण',
    groupAdministrator: 'समूह प्रशासक',
    stickyTop: 'शीर्ष पर चिपकाएं',
    clearHistory: 'चैट इतिहास साफ़ करें',
    groupChat: 'समूह चैट',
    savePicture: 'चित्र सहेजें',
    edit: 'संपादित करें',
    groupCanEdit: 'केवल समूह के मालिक और व्यवस्थापक संपादित कर सकते हैं',
    inputNotice: 'इनपुट सूचना',
    editing: 'संपादन',
    quit: 'बाहर जाएं',
    exitEdit: 'क्या आप इस संपादन से बाहर निकलना चाहते हैं?',
    confirmNotification: 'समूह सूचना जारी करने की पुष्टि करें',
    clearNotification: 'समूह सूचना को साफ़ करने की पुष्टि करें',
    allMute: 'सभी सदस्य म्यूट',
    muteTips: 'जब सभी सदस्य म्यूट होते हैं, तो केवल समूह मालिक और व्यवस्थापक बोल सकते हैं',
    viewMoreMembers: 'अधिक समूह सदस्य देखें',
    selectMaster: 'समूह मालिक चुनें',
    chatDetails: 'चैट विवरण',
    administratorTips1: 'व्यवस्थापक समूह मालिक को समूह चैट प्रबंधित करने में मदद कर सकते हैं और समूह के सदस्यों को हटा सकते हैं',
    administratorTips2: 'केवल समूह का मालिक व्यवस्थापक सेट कर सकता है और समूह चैट समाप्त कर सकता है',
    addMembers: 'सदस्यों को जोड़ें',
    removeAdministrator: 'व्यवस्थापक को हटाने की पुष्टि करें',
    administrativeRights: 'प्रशासनिक अधिकार हटाएं',
    selectMembers: 'समूह सदस्य चुनें',
  },
  uView: {
    modal: {
      confirmText: 'पुष्टि करें',
      modalcancelText: 'रद्द करें'
    },
    search: {
      placeholder: 'कृपया कुंजी शब्द दर्ज करें',
      actionText: 'खोजें'
    },
    loadmore: {
      LoadMore: 'और लोड करें',
      loading: 'लोड हो रहा है',
      noData: 'कोई और डेटा नहीं'
    }
  },
  LongQueue: {
    Issue: 'मुद्दा',
    title: 'लंबी कतार',
    desc: 'विवरण',
    desca1:
      'लंबी कतार सहायक एक सहायक उपकरण है जो लॉटरी परिणामों को ट्रैक और गिनता है और त्वरित शर्त लगाने की अनुमति देता है।',
    desca2:
      'प्रत्येक लॉटरी परिणाम की संभावना समान होती है। यदि लगातार 3 अवधियों या उससे अधिक समय तक लॉटरी परिणाम समान होते हैं, तो इसे "लंबी कतार" कहा जाता है। आमतौर पर, "ड्रैगन को काटने" या "ड्रैगन का अनुसरण करने" के लिए डबलिंग विधि का उपयोग किया जाता है।',
    desca3: '"ड्रैगन को काटना" क्या है?',
    desca4: 'यदि लगातार 5 "विषम" शर्तें हैं, तो आप "सम" चुन सकते हैं। इस शर्त योजना को "ड्रैगन काटना" कहा जाता है।',
    desca5: '"ड्रैगन का अनुसरण करना" क्या है?',
    desca6:
      'यदि लगातार 5 अवधियों के लिए "एकल" खुलता है, तो "एकल" चुनकर शर्तें लगाना जारी रखें, इस शर्त योजना को "ड्रैगन का अनुसरण करना" कहा जाता है।',
    desca7: 'डबलिंग क्या है?',
    desca8:
      'डबलिंग शर्त लगाने का एक तरीका है, जो "ड्रैगन को काटने" या "ड्रैगन का अनुसरण करने" की प्रक्रिया में निरंतर लाभ सुनिश्चित करने का एक तरीका है।'
  },

  luckyWheel: {
    // 首页
    title: 'लकी व्हील',
    amountReceived: 'राशि प्राप्त',
    pendingAmount: 'लंबित राशि',
    onlyCash: 'केश करने के लिए केवल <span class="unit">{unit}</span>{amount} दूर',
    drawingRecords: 'चित्रण रिकॉर्ड',
    cash: 'नकद',
    redEnvelope: 'यादृच्छिक लाल लिफाफा',
    start: 'शुरू',
    restart: 'रीਸਟार्ट',
    activityEnd: 'गतिविधि समाप्त',
    // 详情页
    details: 'विवरण',
    drawRecord: 'ड्रॉ रिकॉर्ड',
    assistanceRecord: 'सहायता रिकॉर्ड',
    winCash: 'नकद जीतें',
    luckyDraw: '1 लकी ड्रा',
    // 规则页
    rules: 'नियम',
    activityRules: 'गतिविधि नियम',
    withdrawalHistory: 'निकासी इतिहास',
    // 分享弹窗
    speedUp: 'लॉटरी भुगतान तेज करें',
    shareLink: 'साझा लिंक',
    shareLinkTip: 'कोड कॉपी कर लिया गया है, निकासी को तेज़ करने के लिए दोस्तों को आमंत्रित करें।',
    shareLinkShortOf: 'बस {amount} निकासी सीमा से कम',
    // 助力成功弹窗
    assistSuccess: 'आपका मित्र {name} आपकी सफलता में मदद करता है',
    assistSubTitle: 'आपको ड्रॉ की संख्या भेजें तेज नकद निकासी',
    congratulations: 'बधाई हो',
    assistReceive: 'जीते गए लकी ड्रा की संख्या',
    times: 'समय',
    confirm: 'पुष्टि करें',
    // 奖励弹窗
    onWinning: 'जीतने पर',
    // 提现弹窗
    withdrawalTip: 'आप फंड निकालने वाले हैं, कृपया भुगतान जानकारी की पुष्टि करें',
    remittanceAmount: 'पैसे भेजने की राशि',
    remittanceAccount: 'पैसे भेजने वाला खाता',
    remittanceChannel: 'पैसे भेजने का चैनल',
    wallet: 'बटुआ',
    withdrawalSuccessful: 'निकासी सफल!',
    // 活动已达上限弹窗
    limitTitle: 'अधिकतम संख्या तक पहुँच गया',
    limitDesc: 'आप गतिविधि में भाग लेने की अधिकतम संख्या तक पहुँच गए हैं, आपके समर्थन और भागीदारी के लिए धन्यवाद',
    // 其他玩家提现弹窗
    bringInPeople: '<span class="people">{num}</span> लोगों को लाएँ सफल निकासी <span class="amount">{amount}</span>',
    easyWithdrawals: 'निकासी बहुत आसान हैं',
    anotherPeopleWithdrawn: 'और <span class="num">{num}</span> लोग निकासी कर चुके हैं!',
    // 第一次进入领取页
    entryTitle: 'आपका विशेष <br> भाग्यशाली लाल लिफाफा',
    entrySubTitle: 'नकदी हस्तांतरण <br> वास्तविक समय खाता जमा',
    withdrawalTimes: 'यह आपका <span class="hightlight">{num}</span> वापसी है',
    freeSpins: 'लकी व्हील आपको <text class="hightlight">{num} मुफ्त स्पिन</text> देता है',
    congratulationsReceiving: 'आपको {amount} प्राप्त करने पर बधाई! अभी इसे निकालें!',
    receive: 'प्राप्त करें',
    haveReceived: 'आपने प्राप्त किया है'
  },
  luckyBox: {
    draws: 'ड्रॉ करें',
    record: 'रिकॉर्ड',
    congratulationsTo: 'बधाई हो',
    forObtaining: 'के लिए',
    throughTheLuckyBox: 'लकी बॉक्स के माध्यम से',
    draw1Times: 'ड्रॉ 1 बार',
    draw5Times: 'ड्रॉ 5 बार',
    draw10Times: 'ड्रॉ 10 बार',
    rewards: 'इनाम',
    insufficientQuantity: 'इनाम की कमी',
    cash: 'नकद',
    memberExp: 'सदस्य ऍक्स्प',
    entity: 'इकाई',
    coupon: 'कूपन',
    memberPoints: 'सदस्य अंक',
    theLuckyBoxReward: 'लकी बॉक्स इनाम!',
    confirm: 'पुष्टि करें',
    rule: 'खाते की चोटी खोलकर बहुत सारे पुरस्कार प्राप्त करें, अभी प्रयास करें',
    receptionRecord: 'ग्रहण रिकॉर्ड',
    allRecord: 'सब',
    issuedRecord: 'भेजे गए',
    drawnRecord: 'ड्रॉ किए गए',
    notDrawnRecord: 'अनड्रॉन',
    abnormal: 'विषय विफल',
    boxErr: 'बॉक्स विषय विफल, सहायता से संपर्क करें'
  },
  promotions: {
    checkIn: 'चेक इन',
    dailyRewards: 'ढेर सारे पुरस्कार पाने के लिए प्रतिदिन चेक इन करें',
    luckyBox: 'लकी बॉक्स',
    luckyBoxDesc: 'लकी बॉक्स खोलने से आपको इनाम मिलेंगे',
    luckyWheel: 'लकी व्हील',
    luckyWheelDesc: 'लकी व्हील खोलने से आपको इनाम मिलेंगे',
    joinNow: 'अभी शामिल हों',
    comeSoon: 'जल्द आओ'
  },
  // 优惠券
  coupon: {
    all: 'सभी',
    unused: 'अप्रयुक्त',
    used: 'प्रयुक्त',
    expired: 'समाप्त',
    over: 'समाप्त',
    type: 'प्रकार',
    expirationDate: 'समाप्ति तिथि',
    usageRules: 'उपयोग नियम',
    receiveTime: 'प्राप्ति समय',
    expirationTime: 'समाप्ति समय',
    useConfirm: 'क्या आप सुनिश्चित हैं कि आप रिचार्ज कूपन का उपयोग कर रहे हैं?',
    no: 'नहीं',
    yes: 'हाँ',
    useSuccess: 'कूपन सफलतापूर्वक उपयोग किया गया',
    useNow: 'उपयोग करें',
    cash: 'नकद',
    memberPoints: 'सदस्य अंक',
    transactionRebate: 'लेनदेन छूट',
    vipPoints: 'वीआईपी अंक'
  },
  point: {
		myPoints: 'मेरे अंक',
		pointsMall: 'अंक मॉल',
		pointsRules: 'अंक नियम',
		winPoints: 'अंक जीतें',
		pointDetails: 'अंक विवरण',
		pointRecord: 'अंक रिकॉर्ड',
		all: 'सभी',
		luckyBox: 'लकी बॉक्स',
		cash: 'नकद',
		scratch: 'खुरचें',
		systemGift: 'सिस्टम उपहार',
		systemDeduction: 'सिस्टम कटौती',
		exchanged: 'बदले गए',
		exchange: 'बदला',
		points: 'अंक',
		SigningIn: 'साइन इन कर रहे हैं',
		signIn1: 'साइन इन करें',
		days: 'दिन',
		SignReminder: 'साइन-इन अनुस्मारक',
		miss: 'छोड़ना',
		today: 'आज',
		signIn: 'साइन इन करें',
		signSuccess: 'साइन इन सफल',
		collect: 'इकट्ठा करें',
		pointRules: 'अंक नियम',
		exchangeRecord: 'एक्सचेंज रिकॉर्ड',
		exchangeSuccess: 'विनिमय सफल',
		todayNoSign: 'मैंने आज साइन इन नहीं किया',
		continuouslySignedFirst: 'मैंने लगातार',
		continuouslySignedLast: 'दिनों तक साइन इन किया है',
		noTasks: 'कोई और कार्य नहीं हैं',
		noExchanging: 'अभी आदान-प्रदान अस्थायी रूप से समर्थित नहीं है',
		pointSmall: 'अंक',
		pointsRedemption: 'पॉइंट रिडेम्पशन',
		redemptionConditions: 'रिडेम्पशन शर्तें',
		themRedeem: 'कृपया उन्हें जल्द से जल्द रिडीम करें.',
		nextSignTime: '  बाकी हैं।',
		fistWord: 'अगले चेक-इन तक ',
		hours: ' घंटे और',
		minutes: 'मिनट',
		againParticipation: 'आपकी पुनः भागीदारी का इंतजार है',
		comeCheckIn: 'आपने अभी तक चेक-इन नहीं किया है! अब आकर चेक-इन करें!',
		introduction: 'परिचय',
	},
  dateOptions: {
    AllDates: 'सभी',
    Today: 'आज',
    Yesterday: 'कल',
    Last7Days: 'पिछले 7 दिन',
    Last30Days: 'पिछले 30 दिन',
    Last90Days: 'पिछले 90 दिन',
    ThisWeek: 'इस सप्ताह',
    LastWeek: 'पिछले सप्ताह',
    ThisMonth: 'इस महीने',
    LastMonth: 'पिछले महीने'
  },
  source: {
    activity: 'गतिविधि अधिग्रहण',
    integral: 'इंटीग्रल विनिमय',
    purchase: 'उपयोगकर्ता खरीद',
    system: 'सिस्टम अधिग्रहण'
  },
}
