export default {
  welcome: 'ยินดีต้อนรับสู่ uniapp',
  hello: 'สวัสดี',
  tabble: {
    home: 'โฮมเพจ',
    promotions: 'โปรโมชั่น',
    invite: 'เชิญ',
    wallet: 'กระเป๋าสตางค์',
    me: 'ฉัน',
    longQueue: 'คิวยาวเหยียด'
  },
  rank: {
    title: 'อันดับสูงสุด'
  },
  invite: {
    CopyInvitationCode: 'รหัส',
    CopySuccessful: 'คัดลอกสำเร็จ',
    InvitationLink: 'บันทึกรหัสการเชื้อเชิญ',
    CopyInvitationLink: 'คัดลอกตำแหน่งเชื่อมโยงการเชื้อเชิญ',
    SaveSuccessful: 'บันทึกสำเร็จ',
    SaveFailed: 'การบันทึกล้มเหลว',
    Username: 'ชื่อผู้ใช้',
    agentsNumber: 'จำนวนการเชื้อเชิญ',
    firstCharge: 'จำนวนเงินฝากครั้งแรก',
    topUpNumber: 'เวลาในการชาร์จใหม่',
    RechargeAmount: 'จำนวนเงินในการชาร์จ',
    SubordinateUser: 'ผู้ใช้ระดับล่าง',
    Total: 'รวม',
    AllDates: 'ทั้งหมด',
    Today: 'วันนี้',
    Yesterday: 'เมื่อวานนี้',
    LastDays: '7 วัน ที่แล้ว',
    TotalDownline: 'สมาชิกดาวน์ไลน์ทั้งหมด', // 支线总人数
    TotalRegistration: 'สมาชิกลงทะเบียนทั้งหมด', // 注册人数
    FirstDeposit: 'สมาชิกของการฝากครั้งแรก', // 首存人数
    DepositMember: 'สมาชิกฝากเงิน', // 存款人数
    WithdrawalMember: 'สมาชิกถອນเงิน', // 提款人数
    VaildBetsBettors: 'ผู้วາງเดิมพันที่มีเดิมพันที่ถືກต้อง', // 有效投注人数
    NetTotal: 'สุทธิรวม (ชนะ-พ่าย)', // 净输赢
    TotalPromotion: 'รวมโปรโมชั่นและรีเบท', // 总优惠红利返水
    FirstDepositAmount: 'จำนวนเงินฝາກครั้งแรก', // 首存金额
    TotalDeposit: 'รวมเงินฝາກ', // 总存款
    TotalWithdrawal: 'รวมการถອນเงิน', // 总提款
    ValidBetTotal: 'สมาชิกรวมที่มีเดิมพันที่ຖືກต้อง', // 有效投注总额
    cleanUp: 'ทำความสะอาด',
    LastModified: 'มีการแก้ไขครั้งสุดท้ายเมื่อ',
    AllLevels: 'ทั้งหมด',
    SearchInterval: 'ช่วงค้นหา',
    Levels: 'ระดับ',
    ThisWeek: 'สปสัปดับ',
    LastWeek: 'สปสัปดับ',
    ThisMonth: 'สปสัปดับ',
    LastMonth: 'สปสัปดับ',
    TotalAmount: 'รวมจำนวน',
    TotalCount: 'รวมจำนวน',
    DepositTime: 'เวลาฝาก',
    RegistrationTime: 'เวลาลงทะเบียน'
  },
  home: {
    scratchOff: 'ขูดออก',
    promotions: 'โปรโมชั่น',
    casino: 'ลาสเวกัส',
    live: 'คาสิโน',
    sports: 'กีฬา',
    chess: 'ตัวหมากรุก',
    fish: 'จับปลา',
    lottery: 'หวย',
    gamesBig: 'เกมยอดนิยม',
    scratch: 'ขีดข่วน',
    more: 'เพิ่มเติม',
    morebig: 'เพิ่มเติม',
    information: 'ข้อมูลการชนะ',
    amount: 'จํานวนเงินที่ชนะ',
    chart: 'แผนภูมิรายได้ของวันนี้',
    total: 'รวม',
    bet: 'พนัน',
    online: 'ออนไลน์',
    noOpen: 'กิจกรรมยังไม่เปิดในขณะนี้!',
    games: 'ช่อง',
    announcement: 'ประกาศ',
    Chatroom: 'ห้องเก็บของ',
    Servicing: 'การให้บริการ',
    Invite: 'เชิญ',
    bindTitle: 'ผูกมัดข้อมูลความปลอดภัย',
    bindTip: `เราขอแนะนำให้ผูกบัญชีของคุณกับข้อมูลความปลอดภัย.`,
    bind: 'ผูกมัด',
    unbound: 'ไม่ผูกมัด',
    RedEnvelopeRain: 'ซองสีแดงฝน',
    last: 'ตัวสุดท้าย',
    next: 'ถัดไป',
    Close: 'ปิด',
    NoPrompt: 'ไม่มีการแจ้งเตือน',
    Winning: 'ชนะการแจ้งข้อมูล',
    TodayWin: 'รายได้วันนี้',
    LOTTERY: 'ลอตเตอรี่',
    seeAll: 'ดูทั้งหมด',
    visitorTip: 'ผู้เข้าชมไม่ได้มีการเข้าถึงเกมนี้ !',
    taskTitle1: 'สนุกกับโปรโมชั่นวีไอพี',
    taskTitle2: 'งานพิเศษ'
  },
  me: {
    History: 'ประวัติผลลัพธ์',
    Agency: 'ศูนย์เอเจนซี่',
    Bets: 'พนันของฉัน',
    Coupon: 'คูปองของฉัน',
    Transactions: 'ธุรกรรมของฉัน',
    Commission: 'คณะกรรมการผู้ใช้',
    Notifications: 'แจ้งเตือน',
    Password: 'ตั้งค่าความปลอดภัย',
    Languages: 'ภาษา',
    Customer: 'บริการลูกค้า',
    New: 'ใหม่',
    Wallet: 'กระเป๋าสตางค์',
    Recharge: 'ชาร์จ',
    Withdraw: 'ถอน',
    Total: 'ยอดเงินรวม',
    userName: 'เข้าสู่ระบบ',
    lastTime: 'เข้าสู่ระบบครั้งล่าสุด',
    Current: 'ระดับปัจจุบัน',
    Experience: 'เพิ่มเติมเพื่อเข้าถึงระดับ',
    Deposit: 'ฝาก',
    bankCrad: 'วิธีการชําระเงิน',
    otcOrder: 'สั่งซื้อ OTC ',
    ChatRoom: 'ห้องสนทนา',
    Sratch: 'บันทึกการขูดออก',
    switchLanguage: 'สลับภาษา',
    logOut: 'ออกจากระบบ',
    cancle: 'แคนเคิล',
    setting: 'ตั้งค่า',
    Theme: 'ธีม',
    defaultTheme: 'ธีมต้นเบิก',
    blueTheme: 'ธีมสีฟ้า',
    AboutUs: 'เกี่ยวกับเรา',
    gamemethod: 'โหมดการเปิดเกม',
    casinoBets: 'การเดิมพันคาสิโน',
    defaultMethod: 'โหมดปริยาย',
    newWindow: 'หน้าต่างใหม่',
    allData: 'แสดงข้อมูลทั้งหมดै',
    notInternet: 'อินเตอร์เน็ตถูกยึดครองโดยเอเลี่ยนै',
    Feedback: 'ความคิดเห็น'
  },
  Transactions: {
    TradeType: 'ประเภทการค้า',
    TradeStatus: 'สถานะการค้า',
    TradeExamineStatus: 'สถานะการค้าตรวจสอบ'
  },
  game: {
    dice: 'ลูกสกา',
    minute: 'นาที',
    minutes: 'นาที',
    second: 'วินาที',
    balance: 'สมดุล',
    resultFor: 'ผลลัพธ์สําหรับ',
    resultBig: 'ผลลัพธ์',
    totalPoint: 'คะแนนรวม',
    draw: 'วาด',
    drawingTime: 'เวลาวาดภาพสําหรับ',
    betting: 'วางเดิมพัน',
    result: 'ผล',
    analyze: 'วิเคราะห์',
    rule: 'กฎ',
    myOrder: 'ลำดับ',
    sumType: 'ประเภทผลรวม',
    sumPoints: 'ผลรวมของคะแนน',
    single: 'เดียว',
    pair: 'คู่',
    triple: 'สาม',
    winBet: 'ชนะการเดิมพัน',
    expect: 'คาดหมาย',
    amount: 'ปริมาณ',
    start: 'เวลาเริ่มต้น',
    open: 'เวลาเปิดบริการ',
    drawID: 'วาด ID ',
    sum: 'ผลรวม',
    value: 'ค่า',
    number: 'เลข',
    round: 'รอบ',
    small: 'เล็ก',
    big: 'ใหญ่',
    toDrawn: 'ที่จะวาด',
    prizeWinning: 'รางวัลชนะเลิศ',
    losingLottery: 'ลอตเตอรี่หาย',
    cancelledOrder: 'คําสั่งซื้อที่ถูกยกเลิก',
    betExpect: 'เดิมพันคาดหวัง',
    bettingTime: 'เวลาเดิมพัน',
    betMoney: 'เงินเดิมพัน',
    purchaseCode: 'รหัสการซื้อ',
    openTime: 'เวลาเปิด',
    prizeMoney: 'เงินรางวัล',
    openCode: 'รหัสเปิด',
    color: 'สี',
    colorTips: 'ขอให้โชคดี 10 วินาทีก่อนการเดิมพันสิ้นสุดลง',
    pauseBetting: 'หยุดการเดิมพันชั่วคราว',
    resultHistory: 'ประวัติผลลัพธ์',
    perriod: 'เพอร์ริออด',
    showMore: 'ดูเพิ่มเติม',
    bet: 'พนัน',
    chatRoom: 'ห้องสนทนา',
    share: 'แชร์',
    goChat: 'ไปห้องสนทนา',
    money: 'เงิน',
    customize: 'ปรับแต่ง',
    totalPrice: 'ราคารวม',
    timeBig: 'เวลา',
    BettingCode: 'รหัสการพนัน',
    EnterAmount: 'ป้อนจำนวน',
    TotalBetAmount: 'จำนวนเดิมพันรวม',
    BetCoin: 'เดิมพันเหรียญ',
    betTip: 'จำนวนเท่าของเดิมพันต่ำสุดคือ 1', //下注最小倍数为1
    setWalletTip: 'โปรดตั้งค่ากระเป๋าคุมข้อมูลปริยาย!', //请设置默认钱包!
    minBetTip: 'จำนวนเงิน ที่น้อย ที่สุด', //最小下注金额为
    maxBetTip: 'จำนวนเงินสูงสุด', //最大下注金额为
    betSuccess: 'เดิมพันสำเร็จ!' // 下注成功
  },
  scratch: {
    scratch: 'ขีดข่วน',
    scratchOffs: 'สแครชออฟ',
    history: 'ประวัติศาสตร์',
    prizeAmount: 'จํานวนเงินรางวัล',
    price: 'รางวัล',
    ticket: 'ตั๋ว',
    mySratchHistory: 'ประวัติขีดข่วนของฉัน',
    howPlay: 'วิธีการเล่น',
    playNow: 'เล่นเลย',
    drawn: 'วาด',
    winning: 'ชนะ',
    expired: 'หมดอายุ',
    toDrawn: 'ที่จะวาด',
    losing: 'แพ้',
    prizeWinning: 'รางวัลชนะเลิศ',
    losingLottery: 'ลอตเตอรี่หาย',
    haveExpired: 'หมดอายุแล้ว',
    name: 'ชื่อ',
    bettingTime: 'เวลาเดิมพัน',
    betMoney: 'เงินเดิมพัน',
    nowPlay: 'คุณยืนยันการเล่นตอนนี้ หรือไม่',
    WinningNumber: 'หมายเลข ที่ชนะ',
    YourNumber: 'เบอร์ของเธอ',
    Instructions:
      'ผู้เล่นจำเป็นต้องขีดข่วนฟิล์มครอบคลุมถ้า "หมายเลขของคุณ" ใด ๆ และ "หมายเลขชนะ" เป็นเหมือนกันคุณสามารถได้รับรางวัล "หมายเลขของคุณ" ที่สอดคล้องกัน', //玩家需要刮开覆盖膜，如果任意一个“你的号码”与“中奖号码”相同，即可获得该“你的号码”所对应的奖金。
    all: 'ทั้งหมด',
    ywiw: 'ป่าของคุณกำลังรอ',
    wmshb: 'ตั๋วขูด Wild Multiplier ได้ถูกปล่อยออกมาในอินเดียนาทั่วทุกที่ु',
    ctabt: 'จับมันให้ได้ก่อน ที่มันจะจับเจ้าได้',
    ewms: 'สำรวจ wildmultiplier-คัดลอกเลียนแบบ',
    odds: 'อัตราต่อรอง',
    in: 'ใน',
    playType: 'ประเภทเกม: รางวัลทันทีจากการขูด',
    prizeStructure: 'โครงสร้างรางวัล',
    tanop: 'จำนวนรางวัลที่เป็นไปได้โดยประมาณสำหรับแต่ละระดับรางวัลมีดังนี้。',
    prize: 'รางวัล',
    amount: 'จำนวน',
    remaining: 'ที่เหลือ',
    tatalWinning: 'การชนะทั้งหมด',
    tickets: 'ตั๋ว',
    tanopend:
      'อัตราต่อรองโดยรวมของการชนะรางวัลจะถูกกำหนดเมื่อเกมถูกพิมพ์และคำนวณโดยการหารจำนวนตั๋วทั้งหมดที่พิมพ์ด้วยจำนวนรางวัลทั้งหมดที่มี รางวัลใด ๆ ที่ระบุไว้ข้างต้นอาจถูกซื้อไปแล้ว แต่ยังไม่ได้รับ รางวัลทั้งหมดอาจยังไม่พร้อมจำหน่ายในร้านค้ารวมถึงรางวัลภายในคำสั่งซื้อใหม่.'
  },
  chat: {
    chatRoom: 'ห้องสนทนา',
    language: 'ภาษา',
    type: 'ประเภท',
    roomName: 'ชื่อห้อง',
    namePlace: 'กรุณาระบุชื่อห้อง',
    languagePlace: 'กรุณาเลือกภาษา',
    typePlace: 'กรุณาเลือกประเภท',
    create: 'สร้าง',
    packets: 'ให้อ่างเปา',
    luckyPacket: 'อ่างเปานําโชค',
    numberPackets: 'จํานวนอ่างเปา',
    numberPlace: 'กรอกหมายเลข',
    TotalAmount: 'จำนวนรวม',
    fortunePlace: 'โชคดี',
    send: 'ส่ง',
    packetRecord: 'บันทึกอ่างเปา',
    packetSent: 'ส่งอ่างเปา',
    cancle: 'ยกเลิก',
    receive: 'รับ',
    received: 'รับแล้ว',
    selectYear: 'เลือกปี',
    lucky: 'โชคดี',
    inWallet: 'ฝากในกระเป๋าเงิน',
    chatPlace: 'พูดอะไรบ้างสิ',
    chatFollow: 'ติดตาม',
    chatFortune: 'โชคดีจริง ๆ',
    chatOpen: 'เปิด',
    confirmFallow: 'คุณยืนยันฟอลโลว์ หรือเปล่า',
    redEnvelope: 'ซองสีแดงธรรมดา',
    silent: 'ทุกคนเงียบ',
    disbanded: 'ห้องถูกยุบ',
    member: 'สมาชิก',
    searchPlace: 'ค้นหา',
    joinRoom: 'เข้าร่วมห้อง',
    disconnected: 'การตัดการเชื่อมต่อใน 15 วินาที',
    serving: 'บริการคุณ',
    customerConnect: 'ลูกค้า ที่จะเชื่อมต่อ',
    evaluation: 'ประเมินการบริการลูกค้า',
    evaluateTitle: 'โปรดประเมินบริการนี้',
    veryDissatisfied: 'ไม่พอใจมาก',
    dissatisfied: 'ไม่พอใจ',
    normal: 'ปกติ',
    satisfaction: 'ความพึงพอใจ',
    quiteSatisfied: 'ค่อนข้างพอใจ',
    spell: 'คาถา',
    redMoney: 'ซองแดง',
    snatched: 'เสร็จแล้ว',
    claimed: 'ได้รับการเลือก',
    redTotal: 'มีทั้งหมด',
    seconds: 'วินาที',
    minutes: 'นาที',
    hours: 'ชั่วโมง',
    offline: 'ออฟไลน์',
    online: 'ออนไลน์',
    Join: 'เข้าร่วม'
  },
  login: {
    visitorLogin: 'ผู้เยี่ยมชม',
    login: 'เข้าสู่ระบบ',
    passwordLogin: 'ล็อกอินบัญชีผู้ใช้',
    emailLogin: 'เข้าสู่ระบบอีเมล',
    accountPlace: 'ป้อนหมายเลขบัญชี (6-20)',
    userLength: 'ชื่อผู้ใช้ประกอบด้วย 6 ถึง 20 ตัวอักษร',
    phonePlace: 'ใส่หมายเลขโทรศัพท์',
    passwordPlace: 'ใส่รหัสผ่าน(6-15)',
    emailPlace: 'ใส่อีเมล',
    codePlace: 'ใส่รหัส',
    needAccount: 'ต้องการบัญชี?',
    register: 'ลงทะเบียน',
    password: 'บัญชีผู้ใช้',
    email: 'อีเมล',
    referralPlace: 'รหัสอ้างอิง',
    message: 'รับรหัส',
    confirmChcek: 'ฉันยืนยันว่าฉันอายุ 18+ ปี',
    allowChcek: 'อนุญาตให้เราแจ้งให้คุณทราบข้อมูล ที่สำคัญชนะผ่านหมายเลขมือถือนี้ี้',
    already: 'มีผู้ใช้อยู่แล้ว',
    chcekBox: 'กรุณาทําเครื่องหมายในช่อง',
    digits: 'รหัสผ่านไม่เกิน 6 หลัก',
    password15: 'รหัสผ่านมากกว่า 15 หลัก',
    account20: 'บัญชี ที่มีมากกว่า 20 ตัวเลข',
    account10: 'บัญชีต้องประกอบด้วยตัวเลข และตัวอักษร และอาจมีสัญลักษณ์ ._-',
    confirmPlace: 'ยืนยันรหัสผ่าน',
    confirmPassword: 'รหัสผ่านสองครั้ง ที่แตกต่างกันैं',
    phoneNullTip: 'หมายเลขโทรศัพท์จะว่า งไม่ได้!', //手机号不能为空!
    phoneAreaCodeNullTip: 'รหัสพื้น ที่โทรศัพท์มือถือไม่สามารถว่า งเปล่า!', //手机区号不能为空!
    Phone: 'โทรศัพท์',
    PhoneLogin: 'ล็อกอินโทรศัพท์',
    TickProtocolTip: 'โปรดตรวจสอบข้อตกลงการลงทะเบียนผู้ใช้!', //请勾选用户注册协议!
    loginMethods: 'วิธีการลงทะเบียนอื่น ๆ', //其他登录方式
    registerMethods: 'วิธีการลงทะเบียนอื่น ๆ', //注册方式
    dragSlider: 'ลากแถบเลื่อนเพื่อตรวจสอบ', //拖动滑块进行验证
    slideBlock: 'เลื่อนบล็อกเพื่อตรวจสอบ', //验证成功
    invitationCode: 'โปรดป้อนรหัสการเชื้อเชิญ', //请输入邀请码
    or: 'หรือ',
    moreWays: 'วิธีอื่น ๆ'
  },
  user: {
    personal: 'ส่วนตัว',
    nickname: 'ชื่อเล่น',
    memberAccount: 'บัญชีสมาชิก',
    nicknamePlace: 'ใส่ชื่อเล่น',
    confirm: 'ยืนยันการแก้ไข',
    camera: 'กล้อง',
    photoAlbum: 'อัลบั้ม',
    cancle: 'ยกเลิก',
    noMore: 'ไม่มีข้อมูลเพิ่มเติม',
    UploadPictureFailed: 'การอัปโหลดรูปภาพล้มเหลว',
    shakeTip: 'กรุณาอย่าคลิกต่อเนื่อง',
    noNetWork: 'การขัดจังหวะเครือข่าย',
    pefresh: 'รีเฟรช',

  },
  version: {
    title: 'อัพเดต',
    subTitle: 'การค้นพบเวอร์ชันใหม่',
    downLoadBtnTextiOS: 'ข้ามไปที่การอัปเดต',
    downLoadBtnText: 'ดาวน์โหลดการอัพเดต',
    downLoadingText: 'ดาวน์โหลด',
    install: 'ติดตั้ง...',
    completed: 'ติดตั้งทันที',
    restart: 'คลิกรีสตาร์ท',
    Downloading: 'ดาวน์โหลด...',
    cancelDownload: 'คุณต้องการยกเลิกการดาวน์โหลดหรือไม่?',
    cancelText: 'ไม่',
    confirmText: 'ใช่',
    successful: 'การติดตั้งสําเร็จรี สตาร์ท...',
    newVersion: 'การติดตั้งสําเร็จ โปรดรีสตาร์ท',
    failed: 'การอัปเดตล้มเหลว',
    version: 'รุ่น',
    versionUpdate: 'ปรับปรุงรุ่น',
    noNew: 'ไม่มีรุ่นใหม่'
  },
  code: {
    200: 'การดําเนินงานสําเร็จ!', //操作成功
    // 400: 'ข้อยกเว้นทางธุรกิจ', // 业务异常
    400: 'โปรดลองอีกครั้งในภายหลัง', // 请稍后再试
    401: 'ขอไม่ได้รับอนุญาต', // 请求未授权
    402: 'คําขอของลูกค้าที่ไม่ได้รับอนุญาต', // 客户端请求未授权
    403: 'ไม่สามารถอ่านข้อความได้', // 消息不能读取
    404: 'ไม่พบคําขอ', // 没找到请求
    405: 'ไม่รองรับวิธีการร้องขอปัจจุบัน', // 不支持当前请求方法
    406: 'ไม่รองรับชนิดสื่อสิ่งพิมพ์ปัจจุบัน', // 不支持当前媒体类型
    408: 'พารามิเตอร์คําขอที่จําเป็นหายไป', // 缺少必要的请求参数
    409: 'ชนิดพารามิเตอร์คําขอไม่ถูกต้อง', // 请求参数类型错误
    410: 'การผูกพารามิเตอร์คําขอไม่ถูกต้อง', // 请求参数绑定错误
    411: 'การตรวจสอบพารามิเตอร์ล้มเหลว', // 参数校验失败
    412: 'ไม่มีการเปิดใช้งานการลงทะเบียนแบบไม่ใช้รหัส', // 没有开启无验证码注册
    413: 'รหัสเชิญต้องไม่ว่างเปล่า', // 邀请码不能为空
    414: 'ไม่มีรหัสเชิญ', // 邀请码不存在
    415: 'ความยาวของรหัสเชิญไม่ถูกต้อง', // 邀请码长度错误
    416: 'ไม่พบข้อมูลที่เกี่ยวข้อง', // 没有找到相关数据
    418: 'วิธีการลงทะเบียนผิด!', //错误的注册方法
    419: 'ขออีกครั้งโปรดลองอีกครั้งในภายหลัง!', //重复请求，请稍后再试
    420: 'ผู้ใช้ IP ที่ลงทะเบียนปัจจุบันเกินขีด จำกัด !', //当前IP注册用户已超限制
    421: 'ไม่สามารถลงทะเบียนได้ในขณะนี้', //暂时无法注册
    422: 'ไม่มีผู้ใช้ทดลองใช้', // 试玩用户不可用
    423: 'ไม่มีสิทธิ์ในขณะนี้ !', //推广用户暂无权限
    424: 'การร้องขอบ่อยครั้งลองอีกครั้งในภายหลัง!', //请求频繁，稍后再试！
    425: 'ไม่มีผู้ใช้โปรโมชั่น', //推广用户不可用
    426: 'ไม่มีสิทธิ์ในขณะนี้', //暂无权限

    500: 'เซิร์ฟเวอร์ผิดธรรมดา', // 服务器异常
    502: 'เซิร์ฟเวอร์ผิดธรรมดา', // 服务器异常
    504: 'หมดเวลา', // 请求超时

    1101: 'บัญชีหรือรหัสผ่านไม่ถูกต้อง', // 账号或密码错误
    1102: 'ชื่อผู้ใช้ต้องไม่ว่างเปล่า', // 用户名不能为空
    1103: 'รหัสผ่านต้องไม่ว่างเปล่า', // 密码不能为空
    1104: 'ผู้ใช้ไม่มีอยู่จริง', // 用户不存在
    1105: 'มีผู้ใช้อยู่แล้ว', // 用户已存在
    1106: 'รหัสผ่านไม่สอดคล้องกัน', // 密码不一致，请重新设置密码
    1107: 'รหัสยืนยันผิด', // 验证码错误
    1108: 'ชื่อบัญชีได้รับการลงทะเบียนแล้ว', // 该账户名已被注册
    1109: 'ฉันเช็คอินวันนี้แล้ว', // 今日已签到过了
    1110: 'หมายเลขโทรศัพท์มีอยู่แล้ว', // 该手机号已存在
    1111: 'ผู้ใช้อีเมลมีอยู่แล้ว', // 该邮箱用户已存在
    1112: 'หมายเลขโทรศัพท์ต้องไม่ว่างเปล่า', // 手机号不能为空
    1113: 'อีเมลต้องไม่ว่างเปล่า', // 邮箱不能为空
    1114: 'รูปแบบอีเมลผิด', // 邮箱格式错误
    1115: 'รหัสผ่านเก่าผิด', // 旧密码错误
    1116: 'รูปแบบอีเมลผิด', // 邮箱格式错误
    1117: 'ไม่สามารถส่งรหัสยืนยันได้', // 验证码发送失败
    1118: 'ผู้ใช้ถูกล็อค', // 该用户已被锁定
    1119: 'รหัสผ่านเก่า และใหม่จะเหมือนกันโปรดรีเซ็ต!', // 新旧密码相同，请重新设置
    1120: 'เบอร์มือถือไม่มีอยู่จริง!', // 手机号不存在
    1121: 'รหัสการตรวจสอบหมดอายุแล้ว!', //验证码已过期
    1122: 'กล่องจดหมายไม่ถูกผูกไว้โปรดส่งกล่องจดหมายก่อน!', //邮箱未绑定，请先绑定邮箱
    1123: 'บัญชีจะต้องประกอบด้วยตัวเลข และตัวอักษร และอาจมีสัญลักษณ์ ._-', //账户由数字和字母组成,可包含符号._-
    1124: 'ชื่อผู้ใช้ประกอบด้วย 6 ถึง 20 ตัวอักษร', //账户名长度为6-20位
    1125: 'การมอบสิทธิ์ล้มเหลว', //授权失败
    1132: 'ตั้งค่าค่าประสบการณ์ ที่ผิดปกติ', //经验值设置异常
    1133: 'ความผิดปกติของการผูก', //绑定IP异常

    201: 'การลงทะเบียนสําเร็จ แต่ไม่มีรหัสเชิญ', // 注册成功,但邀请码不存在

    1201: 'ไม่มีกระเป๋าเงิน', // 钱包不存在
    1202: 'กระเป๋าเงินสกุลเงินปัจจุบันมีอยู่แล้ว', // 当前币种钱包已存在
    1203: 'การโอนล้มเหลว', // 转账失败
    1204: 'ยอดเงินในกระเป๋าเงินไม่เพียงพอ', // 钱包余额不足
    1205: 'บัตรธนาคารปัจจุบันถูกผูกไว้', // 当前银行卡已绑定
    1206: 'การผูกล้มเหลว', // 绑定失败
    1207: 'กระเป๋าเงินค้าง', // 钱包被冻结
    1208: 'ไม่มีเรกคอร์ดธุรกรรม', // 交易记录不存在
    1209: 'ไม่อนุญาตให้ถอนเงิน', // 不允许提现
    1210: 'ไม่มีข้อมูลที่มีผลผูกพัน', // 绑定信息缺失
    1211: 'บัตรธนาคารมีอยู่แล้ว!', //银行卡已经存在！
    1212: 'ปริมาณการทำธุรกรรมไม่น้อยกว่า หรือเท่ากับ 0 !', //交易金额不能小于等于0！
    1213: 'ไม่อนุญาตให้แลกเปลี่ยน!', //不允许汇兑！
    1214: 'กระเป๋าตังค์สามใบถูกล็อค', //三方钱包已锁定
    1215: 'รหัสผู้ใช้ไม่เพียงพอ!', //用户打码量不足!
    1216: 'บุคคล ที่สามผิดพลาด!', //第三方错误！
    1218: 'ข้อมูลการชำระเงินไม่สมบูรณ์โปรดกลับมาอีกครั้ง!', //支付数据不完整，请重新绑定
    1219: 'จำนวนเงิน ที่ถอนจะไม่น้อยกว่า จำนวนเงิน ที่น้อย ที่สุด!', //提现金额不能低于最小提现金额
    // 1220: 'มีบันทึกการทำธุรกรรมอยู่โปรดอย่าลบ!', //已有交易记录存在,请勿删除
    1220: 'วิธีการชำระเงินนี้ มีบันทึกการทำธุรกรรมโปรดอย่าลบมัน', //已有交易记录存在,请勿删除
    1221: 'มีบัญชีสแกนการชำระเงินอยู่แล้ว!', //扫码支付账户已存在
    1222: 'มีบัญชีการชำระเงินออนไลน์อยู่แล้ว!', //线上支付账户已存在
    1223: 'มีบัญชี usd อยู่แล้ว!', //USDT账户已存在
    1224: 'ไม่อนุญาตให้โอนเงิน', //不允许转账
    1225: 'การจ่ายเงินสำหรับผู้ผลิตไม่มีอยู่จริง', //支付厂商不存在
    1226: 'การจ่ายเงินผิดปกติ', //支付异常
    1227: 'มีช่องจ่ายเงินอยู่แล้ว', //支付通道已存在
    1228: 'รหัสผ่าน ที่ใช้จ่ายไม่สามารถแก้ไขได้', //支付通道CODE不可修改
    1229: 'การเรียกคืนค่ากลับมาล้มเหลวไม่มีการสั่งซื้อ', //代付回调失败,订单不存在
    1230: 'ความล้มเหลวในการเรียกคืนเกิดขึ้น', //支付回调失败出现异常
    1231: 'ประเภทการทำธุรกรรมผิดปกติ!', //交易类型异常
    1233: 'จำนวนการชำระเงินผิดปกติโปรดป้อนช่วงจำนวน ที่ถูกต้อง!', //支付金额异常,请输入正确的金额范围
    1234: 'การจัดการล้มเหลว', //交易失败
    1235: 'ยังไม่มีข้อมูลบัญชี ที่ผูกไว้การถอน', //提现绑定账户数据不存在
    1236: 'ยังไม่มีข้อมูลธนาคารการถอน', //提现银行数据不存在
    1237: 'รูปแบบปริมาณการซื้อขายไม่ถูกต้อง', //交易金额格式不正确

    1291: 'เพิ่มสมดุลเรียบร้อยแล้ว!', //余额添加成功
    1292: 'ความสมดุลการขีดเส้นใต้สำเร็จ!', //余额划扣成功
    1293: 'ความสำเร็จในการแลกเปลี่ยน!', //汇兑成功

    1301: 'ไม่มีตัวเลือกการเดิมพัน', // 下注选项不存在
    1302: 'การเดิมพันซ้ํา', // 重复下注
    1303: 'ไม่มีเรกคอร์ด', // 记录不存在
    1304: 'ข้อสันนิษฐานความล้มเหลว', // 预设失败
    1305: 'ไม่มีวัตถุควบคุมสี', // 彩种控制对象不存在
    1306: 'เกมยังไม่เปิด', // 暂未开启游戏
    1307: 'การเดิมพันถูกหยุดในช่วงเวลาปัจจุบัน', // 当期已停止下注
    1308: 'ไม่มีตั๋วผู้ใช้', // 用户注单不存在
    1309: 'ลอตเตอรี่ไม่มีอยู่จริง', // 彩票不存在
    1310: 'จํานวนเงินน้อยเกินไปที่จะวางเดิมพัน', // 金额太小，不可投注
    1311: 'จํานวนเงินมากเกินไปที่จะเดิมพัน', // 金额太大，不可投注

    1401: 'คําสั่งซื้อถูกล็อคโปรดดําเนินการทําธุรกรรมให้เสร็จสมบูรณ์', // 该订单已锁定,请继续完成交易
    1402: 'โปรดอัพโหลดเวาเชอร์', // 请上传凭证
    1403: 'ข้อมูลการชาร์จไม่สามารถว่างเปล่าได้', // 充值信息不能为空
    1404: 'ไม่สามารถซื้อขายกับตัวเองได้', // 不能和自己交易
    1405: 'การตรวจสอบลายเซ็นล้มเหลว', // 签名校验失败
    1406: 'ทำการซื้อขายกับผู้ใช้รายอื่น', // 正在和其他用户交易

    1501: 'งานยังไม่มีอยู่ หรือล้มเหลว', //任务不存在或已失效
    1502: 'เกรดไม่สอดคล้องกัน!', //等级不足
    1503: 'เงินมัดจำไม่เพียงพอ!', //押金不足
    1504: 'ภารกิจถูกเรียกร้อง!', //任务已领取
    1505: 'ภารกิจถูกส่ง!', //任务已发放
    1506: 'การส่งภารกิจล้มเหลว!', //任务发放失败
    1507: 'ภารกิจของผู้ใช้กำลังดำเนินการ ไม่สามารถดำเนินการได้!', //用户任务进行中，不可操作
    1508: 'ไม่อยู่ในกลุ่มที่ระบุ!', //不在指定分组

    // 转盘模块
    1509: 'ไม่มีบันทึกผู้ใช้กิจกรรมวงล้อนำโชค!', //转盘活动用户记录不存在
    1510: 'เวลาปัจจุบันของกิจกรรมวงล้อนำโชคหมดอายุแล้ว!', //转盘活动当前时间已失效
    1511: 'กิจกรรมวงล้อนำโชคปัจจุบันยังไม่ได้ดำเนินการ!', //当前转盘活动未进行中
    1512: 'จำนวนครั้งที่คลิกได้ของกิจกรรมวงล้อนำโชคเป็น 0!', //转盘活动可点击次数为0
    1513: 'ผู้ใช้ที่เชิญกิจกรรมวงล้อนำโชคไม่มีอยู่!', //转盘活动邀请用户不存在
    1514: 'กิจกรรมวงล้อนำโชคปัจจุบันเสร็จสมบูรณ์แล้ว!', //当前转盘活动已完成
    1515: 'กิจกรรมวงล้อนำโชคล้มเหลว โปรดอย่าคลิกอีก!', //当前转盘活动以失败，请勿重复点击
    1516: 'ราคาเริ่มต้นและพารามิเตอร์จำนวนครั้งการเชิญของกิจกรรมวงล้อนำโชคไม่ตรงกัน!', //当前转盘活动初始砍价金额和邀请次数参数不匹配
    1517: 'ไม่มีกิจกรรมวงล้อนำโชค!', //转盘活动不存在
    1518: 'กิจกรรมวงล้อนำโชคหมดอายุแล้ว!', //转盘活动已过期
    1519: 'จำนวนการเข้าร่วมแคมเปญสูงสุดแล้ว', // 转盘活动参与次数已达上限

    1601: 'ไม่มีกระเป๋าเงินสมดุล', //余额宝钱包不存在
    1602: 'กระเป๋าเงินสมดุลถูกแช่แข็ง', //余额宝钱包已冻结
    1604: 'สมดุลเงินเหลือน้อย', //余额宝钱包余额不足

    2001: 'เกมไม่มีอยู่', // 游戏不存在
    2002: 'บันทึกการขายยังไม่มีอยู่', // 销售记录不存在
    2003: 'แลกแล้วหรือหมดอายุ', // 已兑奖或已过期
    2102: 'จำกัด การถอนไม่เพียงพอบนแพลตฟอร์ม', // 平台提现额度不足

    8000: 'สามทางผิดปกติ', //三方异常
    8001: 'เกมยังไม่ได้เปิด', //游戏未开启
    8002: 'การลงทะเบียนผู้ใช้ล้มเหลว', //用户注册失败
    8003: 'การบำรุงรักษาเว็บไซต์', //站点维护
    8004: 'การไม่ตอบสนองสามฝ่าย', //三方无响应
    8005: 'การทำธุรกรรม ที่สำคัญ', //重复交易
    8006: 'เว็บไซต์โควตาไม่เพียงพอโปรดลองอีกครั้ง', //站点额度不足请重试
    8007: 'ข้อยกเว้นของเว็บไซต์', //站点异常
    8008: 'เว็บไซต์ขาดแคลน', //站点额度不足

    9801: 'ยังไม่มีผู้ให้บริการอยู่!', //服务商不存在
    98002: 'จำนวนโอนต้องมากกว่า หรือเท่ากับ 1', //转入金额必须大于或等于1

    // im模块
    100040: 'จำนวนเงินในซองแดงแต่ละใบไม่ถูกต้อง', //单个红包金额不正确
    100041: 'จำนวนเงินรวมในซองแดงไม่ถูกต้อง', //红包总金额不正确
    100042: 'ซองจดหมายสีแดงจำนวนไม่เกิน {maxNumber} ชิ้น', //红包个数不可超过
    100043: 'จำนวนเงินในซองแดงแต่ละใบต้องไม่ต่ำกว่า {minMoney}', //单个红包金额不可低于0.01
    100044: 'จำนวนเงินในซองแดงแต่ละใบต้องไม่เกิน {maxMoney}', //单个红包金额不可超过300
    100050: 'ซองแดงที่ไม่ปรากฏ', //不存在的红包
    100051: 'ไม่สามารถรับซองแดงนี้ได้', //不可领取该红包
    100060: 'ฟังก์ชันซองแดงไม่พร้อมใช้งานในขณะนี้', //红包功能暂不可用
    100070: 'การคืนเงินซองแดงหมดอายุล้มเหลว', //红包超期退款失败
    100010: 'การเชื่อมต่อห้องแชทล้มเหลว', //聊天室连接失败
    100020: 'กลุ่มไม่อยู่, การดำเนินการล้มเหลว', //群组不存在，操作失败
    100030: 'ไม่ใช่สมาชิกกลุ่มนี้, การดำเนินการล้มเหลว', //非本群人员，操作失败
    100031: 'ผู้ใช้ถูกปิดเสียง', //用户被禁言中
    100032: 'กลุ่มถูกปิดเสียง', //群组禁言中
    10: 'สามารถรับได้ตามปกติ', //可以正常领取
    20: 'ช้าไป, ซองแดงหมดแล้ว', //手慢了,红包派完了
    30: 'ไม่ได้รับภายใน 24 ชั่วโมง', //超过24小时未领取
    35: 'ไม่ตรงตามเงื่อนไขการรับ', //不符合领取条件
    40: 'ได้รับแล้วตามปกติ', //已经正常领取过了
    50: 'รับสำเร็จ', //领取成功
    60: 'ไม่มีกระเป๋าสตางค์สำหรับสกุลเงินที่เกี่ยวข้อง', //无对应币种的钱包
    61: 'ท่านไม่ใช่หัวหน้ากลุ่ม', //您不是群主

    2401: 'กล่องสมบัติไม่มี', //宝箱不存在
    2402: 'ไม่มีบันทึกกล่องสมบัติ', //宝箱记录不存在
    2601: 'เนื้อหาการแลกเปลี่ยนไม่มีอยู่', // 兑换内容不存在
    2602: 'คะแนนไม่เพียงพอ', // 积分不足
    2604: 'การลงชื่อคะแนนไม่ได้ดำเนินการอยู่', // 积分签到未进行中
    2605: 'ฉันได้ลงชื่อเข้าใช้วันนี้แล้ว', // 积分已签到
    3001: 'ไม่อนุญาตให้ลงชื่อ', // 不允许签到
    3002: 'ไม่อนุญาตให้หมุนวงล้อโชคดี', // 不允幸运大转盘
    3003: 'ไม่อนุญาตให้ถอน USDT', // 不允许usdt提现
    3004: 'ไม่อนุญาตให้เติม USDT', // 不允许usdt充值
    3005: 'ไม่อนุญาตให้ชำระเงินด้วย QR โค้ด', // 不允许扫码支付
    3006: 'ไม่อนุญาตให้เข้าร่วมกิจกรรมหีบสมบัติ', // 不允许参加宝箱活动
    2403: 'กล่องสมบัติถูกปิดใช้งານ', //宝箱已禁用
    2404: 'กล่องสมบัติถูกเปิดแล้ว	', //宝箱已开过了
    2405: 'ไม่สามารถเรียกร้องกล่องสมบัติได้', //宝箱无法领取
    2406: 'โบนัสต้องมากกว่า 0', //奖金必须大于0
    2407: 'รางวัลของกล่องสมบัติໄດ້ถูกมอบออกแล้ว', //该宝箱的奖品已经发放了
    2408: 'การเปิดกล่องสมบัติມີຂໍ້เวັ้น', //宝箱开启异常
    2409: 'ชื่อกล่องสมบัติซ้ำ', //宝箱名字重复
    2410: 'ปริมาณรางวัลต้องมากกว่า 0', //奖品数量必须大于0

    // 优惠券模块
    2501: 'ซองแดงที่ไม่ปรากฏ', //优惠券不存在或未启用
    2502: 'ซองแดงหมดอายุ', //优惠券已过期
    2503: 'ซองแดงถูกใช้', //优惠券已被使用
    2504: 'การตรวจสอบซองแดงล้มเหลว', //优惠券核销失败
    2505: 'ซองแดงถูกใช้ในรางวัลกิจกรรม', //优惠券在活动奖励中使用
    2506: 'ไม่ตรงตามเงื่อนไขการใช้', //使用条件不满足
    2603: 'ระดับ VIP ไม่เพียงพอ' // VIP等级不足
  },

  agencyCenterModule: {
    titleName: 'ศูนย์เอเจนซี่',
    keywordPlaceholder: 'กรุณาใส่ชื่อผู้ใช้',
    levelList: {
      0: 'ระดับ1',
      1: 'ระดับ2',
      2: 'ระดับ3',
      3: 'ระดับ4'
    },
    FindTitle: 'ค้นหาตามข้อมูล',
    StartTime: 'เวลาเริ่มต้น',
    EndTime: 'เวลาสิ้นสุด',
    reselect: 'โปรดเลือกวันที่สิ้นสุดอีกครั้ง',
    year: 'ปี',
    month: 'เดือน',
    day: 'วัน',
    cancellation: 'ยกเลิกl',
    determine: 'ยืนยัน',
    level: 'ระดับ',
    placeholderUserName: 'กรุณาใส่ชื่อผู้ใช้',
    balance: 'สมดุล',
    CodingQuantity: 'ปริมาณการเข้ารหัส',
    Type: 'ประเภท',
    Amount: 'ปริมาณ',
    Status: 'สถานะ',
    Time: 'เวลา'
  },

  signInModule: {
    promotions: 'โปรโมชั่น',
    checkIn: 'เช็คอิน',
    dailyRewards: 'เช็คอินทุกวันเพื่อรับรางวัลมากมาย',
    go: 'ไป',
    join: 'สมัคร',
    titleName: 'ลงชื่อเข้าใช้',
    SurpriseBenefit: 'ประโยชน์ที่น่าประหลาดใจ',
    Continuous: 'มารยาทในการเช็คอินอย่างต่อเนื่อง',
    row: ' เป็นสายหนึ่ง',
    AttendanceBonus: 'โบนัสการเข้าร่วม',
    Sign: 'ลงชื่อเข้าใช้ทุกวันเพื่อรับรางวัลมากมาย',
    tips: 'การตรวจสอบงานยังไม่ว่า ง',
    signList: {
      0: 'วันศูนย์',
      1: 'วันที่หนึ่ง',
      2: 'วันที่สอง',
      3: 'วันที่สาม',
      4: 'วันที่สี่',
      5: 'วันที่ห้า',
      6: 'วันที่หก',
      7: 'วันที่เจ็ด'
    },
    explain: 'รางวัลสำหรับการลงนามจะถูกแจกจ่ายไปยังกระเป๋าเงินสกุลเงินเริ่มต้น' //签到获取奖励将派发到默认币种钱包中。
  },

  wallet: {
    balance: 'สมดุล',
    topTitle: 'กระเป๋าเงินรวม',
    lastLogin: 'เข้าสู่ระบบล่าสุด',
    totalBalance: 'ยอดเงินรวม',
    noConsumptionRecordsTip: 'ขณะนี้ยังไม่มีข้อมูล!',
    Recharge: 'ชาร์จ',
    Transfer: 'โอน',
    Withdraw: 'ถอน',
    ShiftTo: 'เปลี่ยนเป็น',
    Remittance: 'การโอนเงิน',
    AddWallet: 'เพิ่มกระเป๋าเงิน',
    wantAddWallet: 'คุณต้องการเพิ่มกระเป๋าเงินหรือไม่?',
    correct: 'ยืนยัน',
    deny: 'ยกเลิก',
    wait: 'กำลังรอ',
    noWalletTip: 'ตอนนี้ ไม่มีกระเป๋าสตางค์ค่ะช่วยเพิ่มกระเป๋าตังค์ก่อนนะคะ',
    central: 'กลาง',
    centralWallet: 'กระเป๋าคุมข้อมูลกลาง',
    noPaymentMethods: 'ไม่มีการผูกมัดวิธีการชำระเงินสำหรับสกุลเงินนี้ !', //该货币没有绑定付款方式！
    Withdrawal: 'การถอน',
    BindCard: 'บัตรธนาคาร', //绑定银行卡
    outCurrentWallet: 'จำนวนเงิน ที่ถ่ายโอนออกเกินกระเป๋าคุมข้อมูลปัจจุบัน', //超出当前钱包转出金额
    setWallet: 'ตั้งค่ากระเป๋าคุมข้อมูลปริยาย', // 设置默认钱包
    notRecharge: 'ยังไม่รองรับการเติมเงินในรูปแบบนี้ โปรดเลือกวิธีการเติมเงิน',
    FirstRecharge: 'เติมครั้งแรก',
    FirstWithdrawal: 'การถอนเงินครั้งแรกँ'
  },

  swapModule: {
    titleName: 'การโอนเงิน',
    Balance: 'สมดุล',
    placeholderEnterAmount: 'ป้อนจํานวนเงิน',
    Remittance: 'การโอนเงิน',
    Price: 'ราคา',
    per: 'ต่อ',
    placeholderSearchName: 'ค้นหาโดยใช้เงินตรา ที่นี่',
    TokenName: 'ชื่อโทเค็น',
    chooseWalletTip: 'โปรดเลือกโอนเงินออกจากกระเป๋าเงินสกุลเงิน!',
    enterAmountTip: 'กรุณากรอกจํานวนเงิน',
    SelectCurrency: 'เลือกสกุลเงิน',
    CurrencyName: 'ชื่อปัจจุบัน',
    dissatisfyTip: 'ไม่ตรงกับเงื่อนไขการแลกเปลี่ยน!' //不满足汇兑条件!
  },

  rechargeModule: {
    titleName: 'ชาร์จ',
    CurrentBalance: 'ยอดเงินปัจจุบัน',
    Cumulative: 'เติมเงินสะสม',
    RechargeMethod: 'วิธีการชาร์จใหม่',
    otc: 'OTC',
    other: 'อื่น',
    paymentMethodsList: {
      0: 'บัตรธนาคาร',
      1: 'การชําระเงินทางอินเทอร์เน็ต'
    },
    PleaceSelect: 'โปรดเลือก',
    PleaceSelectAmount: 'โปรดเลือกจํานวนเงินที่เติมเงิน',
    PleaseEnter: 'กรุณากรอก',
    ServiceCharge: 'ค่าบริการ',
    ExchangeCharge: 'ค่าธรรมเนียมแลกเปลี่ยน',
    Release: 'ปล่อย',
    BuyNow: 'ซื้อทันที',
    MobilePhone: 'โทรศัพท์มือถือ',
    WithdrawalAmount: 'จํานวนเงินที่ถอน',
    VipLevel: 'ระดับวีไอพี',
    VipIntegral: 'วีไอพีที่ครอบคลุม',
    cancellation: 'ยกเลิก',
    determine: 'ยืนยัน',
    Select: 'เลือก',
    WithdrawInfomations: 'ข้อมูลการถอนเงิน',
    rechargeAmountEmptytTip: 'กรุณากรอกจํานวนเงินที่เติม!',
    cardTip: 'โปรดเลือกช่อง!',
    intoOtherTip: 'จะเข้าไปเติมพลังให้กับบุคคล ที่สาม หรือไม่?',
    Manufacturer: 'โปรดเลือกผู้ผลิต',
    card: 'โปรดเลือกช่อง',
    userName: 'กรุณาใส่เลขบัญชี หรือชื่อบัญชีของคุณ',
    userRemark: 'โปรดป้อนหมายเหตุ',
    PaymentInformation: 'ข้อมูลการชำระเงิน',
    PaymentNote: 'บันทึกการชำระเงิน',
    min: 'การชำระเงินขั้นต่ำเดียว',
    max: 'จำกัด จำนวนสูงสุด',
    BankCardName: 'ชื่อบัตรธนาคาร',
    BankCardNumber: 'หมายเลขบัตรธนาคาร',
    IFSC: 'IFSC หรือ SWIFT',
    selectPaymentVendor: 'โปรดเลือกผู้ขาย',
    TransactionRate: 'อัตราการทำธุรกรรม', //交易汇率
    txidTip: 'กรุณาใส่ TXID ของคุณ',
    AmountReceived: 'จำนวนเงิน ที่ได้รับ', //实到金额
    AbnormalRemarks: 'ความคิดเห็นผิดปกติ', //异常备注
    transactionAmount: 'จำนวนการทำธุรกรรม', //交易金额
    notice: 'ประกาศ',
    specific: 'จำนวนเฉพาะขึ้นอยู่กับจำนวนจริงที่ได้รับเครดิต'
  },

  WithdrawModule: {
    titleName: 'ถอน',
    withdrawMethod: 'วิธีการถอน',
    PleaceSelectAmount: 'โปรดเลือกจํานวนเงินที่ถอน',
    rechargeInfomations: 'ข้อมูลการเติมเงิน',
    InsufficientBalanceTip: 'ยอดเงินในกระเป๋าเงินปัจจุบันไม่เพียงพอ!',
    addBankTip: 'กรุณาเพิ่มบัตรธนาคารของคุณก่อน!',
    withdrawAmountEmptytTip: 'โปรดป้อนจํานวนเงินที่ถอน!',
    noBankTip: 'ขณะนี้ยังไม่มีข้อมูลสําหรับประเภทการชําระเงินนี้!',
    selectCardTip: 'โปรดเลือกบัตรธนาคาร!',
    RechargeAmount: 'จํานวนเงินที่เติมเงิน',
    remainingCodingTip: 'จำนวนของการเข้ารหัส ที่เหลือ'
  },

  bankCradModule: {
    titleName: 'วิธีการชําระเงิน',
    addBank: 'ผูกวิธีการชําระเงิน',
    deleteTip: 'คุณต้องการจะลบวิธีการชำระเงินนี้ หรือไม่?' //是否删除该支付方式？
  },

  addBankCradModule: {
    titleName: 'ผูกมัดวิธีการชำระเงิน',
    PaymentMethods: 'วิธีการชำระเงิน',
    PaymentVendor: 'ผู้ขายการชำระเงิน',
    PaymentChannel: 'ช่องการชำระเงิน',
    BankCode: 'รหัสธนาคาร',
    BankNumber: 'หมายเลขธนาคาร',
    AccountName: 'ชื่อบัญชีผู้ใช้',
    BankBranch: 'ธนาคาร',
    PaymentAddress: 'ที่อยู่การชำระเงิน',
    QRCodeAddress: 'ที่อยู่ของรหัส',
    Bind: 'ผูกมัด',
    selectMethodsTip: 'โปรดเลือกวิธีการชำระเงิน!',
    selectVendorTip: 'โปรดเลือกผู้ขายการชำระเงิน!',
    formTip: 'กรุณากรอกแบบฟอร์ม',
    SelectMethod: 'เลือกวิธีการชำระเงิน',
    Country: 'ประเทศ',
    SelectCountry: 'เลือกประเทศ',
    BankType: 'ประเภทธนาคาร',
    SelectBankType: 'เลือกประเภทบัญชีผู้ใช้',
    AccountType: 'ประเภทบัญชีผู้ใช้',
    IFSC: 'IFSC Code',
    MobilePhone: 'โทรศัพท์เคลื่อน ที่',
    VerificationCode: 'รหัสคำอธิบาย',
    Agreement: 'ข้อตกลง',
    SelectAgreement: 'เลือกข้อตกลง',
    enterPhoneTip: 'กรุณาใส่หมายเลขโทรศัพท์!',
    correctphoneTip: 'กรุณาใส่หมายเลขโทรศัพท์ ที่ถูกต้อง!',
    pleaseSelectPaymentMethod: 'โปรดเลือกวิธีการชำระเงิน',
    pleaseSelectCountry: 'โปรดเลือกประเทศ',
    pleaseSelectAccountType: 'โปรดเลือกประเภทบัญชีผู้ใช้',
    Cardholder: 'ผู้ถือการ์ด',
    pleaseEnterCardholder: 'กรุณาป้อนผู้ถือการ์ด',
    pleaseEnterIFSC: 'โปรดป้อนรหัส IFSC',
    AccountNumber: 'หมายเลขบัญชี',
    pleaseEnterAccountNumber: 'กรุณาใส่เลขบัญชีของคุณ',
    Phone: 'โทรศัพท์',
    pleaseEnterPhone: 'กรุณาใส่โทรศัพท์ของคุณ',
    Network: 'เครือข่าย',
    pleaseSelectNetwork: 'โปรดเลือกเครือข่าย',
    Account: 'บัญชีผู้ใช้',
    pleaseEnterAccount: 'กรุณาใส่บัญชีของคุณ',
    Address: 'ที่อยู่',
    pleaseEnterAddress: 'โปรดป้อน ที่อยู่',
    QRCode: 'รหัส QR',
    SelectNetwork: 'เลือกเครือข่าย',
    pleaseEnterEmail: 'โปรดป้อนอีเมล',
    correctEmailTip: 'โปรดป้อน ที่อยู่อีเมล ที่ถูกต้อง!',
    getCode: 'โปรดรับรหัสการตรวจสอบ', //请获取验证码!
    PixAccount: 'บัญชี Pix',
    PixAccountTip: 'กรุณาใส่บัญชี Pix',
    CPFNumber: 'หมายเลขซีพีเอฟ',
    CPFNumberTip: 'กรุณาใส่หมายเลข CPF'
  },

  otcOrderModule: {
    titleName: 'คําสั่งซื้อ OTC ของฉัน',
    dispute: 'ข้อพิพาท',
    typeList: {
      0: 'ชาร์จ',
      1: 'ถอน'
    },
    statusList: {
      0: 'กําลังดําเนินการ',
      1: 'สําเร็จ',
      2: 'ล้มเหลว'
    }
  },

  otcOrderDetailsModule: {
    titleName: 'รายละเอียด',
    BalanceRecharge: 'เติมเงินบาลานซ์',
    BalanceWithdraw: 'ถอนยอดคงเหลือ',
    Status: 'สถานะ',
    PaymentMotheds: 'วิธีการชําระเงิน',
    Currency: 'เงินตรา',
    BilINo: 'หมายเลขบิล',
    Time: 'เวลา',
    Receive: 'รับ',
    Complete: 'สมบูรณ์',
    Wondering: 'สงสัยเกี่ยวกับคําสั่งซื้อ?',
    dispute: 'มีข้อโต้แย้งเกี่ยวกับคําสั่งนี้หรือไม่?',
    No: 'ไม่',
    Yes: 'ใช่'
  },

  common: {
    successCodeTip: 'การดําเนินงานสําเร็จ!',
    PleaceSelect: 'กรุณาเลือก',
    PleaseEnter: 'กรุณากรอก',
    formRequestTip: 'กรุณากรอกแบบฟอร์มให้ครบถ้วน!',
    InputRoomName: 'กรุณาใส่ชื่อห้อง',
    SelectLanguage: 'โปรดเลือกภาษา',
    SelectType: 'โปรดเลือกประเภท',
    SelectScore: 'โปรดเลือกคะแนน',
    evaluatedService: 'คุณได้ประเมินบริการนี้ แล้ว',
    contactAdministrator: 'กรุณาติดต่อผู้ดูแลระบบ',
    EnterNumber: 'โปรดป้อนหมายเลข',
    EnterMoney: 'โปรดป้อนเงิน',
    NoWallet: 'ไม่มีกระเป๋าสตางค์',
    InsufficientWalletAmount: 'จำนวนกระเป๋าคุมข้อมูลไม่เพียงพอ',
    SendFail: 'การส่งล้มเหลว',
    loginSuccess: 'สำเร็จในการล็อกอิน',
    InputNickname: 'โปรดป้อนชื่อเล่น',
    registerSuccess: 'การลงทะเบียนสำเร็จ',
    SelectMoney: 'โปรดเลือกเงิน',
    isSureTip: 'แน่ใจนะว่าไม่จำเป็นต้องย้ายด่วน',
    noMoney: 'ยอดเงินในกระเป๋าสตางค์ปัจจุบันเป็น 0!',
    packetsNumberTip: 'จำนวนแพ็คเก็ตสีแดงเป็นจำนวนเต็ม ที่มากกว่า 0 !',
    PleaseEnterAccountOrPhone: 'กรุณาใส่บัญชีหรือโทรศัพท์',
    PleaseSelect: 'โปรดเลือก',
  },

  tradeType: {
    1: 'ชาร์จ',
    2: 'ถอน',
    3: 'ของขวัญระบบ',
    4: 'โอนออก',
    5: 'เปลี่ยนเป็น',
    6: 'พอยท์',
    7: 'โอนไปยังบุคคลที่สาม',
    8: 'การโอนโดยบุคคลที่สาม',
    9: 'การเดิมพัน',
    10: 'การชนะลอตเตอรี่',
    11: 'การเดิมพันมินิเกม',
    12: 'ชนะในมินิเกม',
    13: 'การทำนายเรียกค่าไถ่', //余额宝转出
    14: 'การทำนายลงทุน', //转入余额宝
    15: 'ผลประกอบการในอนาคต', //余额宝收益
    17: 'ถอยหลังกลับ', //提现退回
    18: 'ลดส่วนลด', //提现扣减
    19: 'การกระจายซองสีแดง', //红包发放
    20: 'รับซองสีแดง', //红包领取
    21: 'การส่งคืนซองสีแดง', //红包退还
    22: 'โบนัสอัปเกรด VIP', //VIP升级彩金发放
    23: 'โบนัสรายสัปดาห์ VIP', //VIP周彩金发放
    24: 'โบนัสรายเดือน VIP', //VIP月彩金发放
    25: 'งานกิจกรรม', //活动任务
    26: 'สลับจุด', //积分兑换商城
    27: 'ล้อสิ่งพิมพ์', //幸运大转盘
    28: 'กล่องของมีค่า', //宝箱
    29: 'การฝากรับโบนัส', //充值赠送
    30: 'การฝากรับโบนัสกิจกรรม', //活动充值赠送
    31: 'กิจกรรมลงทะเบียน', //签到活动
    32: 'การยกเลิกคำสั่ง', //注单撤销
    33: 'การเพิกถอนส่วนลด', //返点撤销
    97: 'ปรับ แต่งบัญชีผู้ใช้' //调账
  },

  passwordModule: {
    titleName: 'รหัสผ่าน',
    Account: 'รหัสผ่านบัญชี',
    Payment: 'รหัสผ่านการชําระเงิน',
    SetAccount: 'ตั้งรหัสผ่านบัญชี',
    SetPayment: 'ตั้งรหัสผ่านการชําระเงิน',
    OldPassword: 'รหัสผ่านเก่า',
    NewPassword: 'รหัสผ่านใหม่',
    Password: 'รหัสผ่าน',
    ConfirmPassword: 'ยืนยันรหัสผ่าน',
    Verify: 'ยืนยัน',
    FillOld: 'กรอกรหัสผ่านเก่า',
    FillNew: 'เติมรหัสผ่านใหม่',
    FillPassword: 'กรอกรหัสผ่าน',
    FillConfirmation: 'กรอกการยืนยันอีกครั้ง',
    modification: 'การแก้ไขรหัสผ่านที่ไม่สอดคล้องกัน!',
    settings: 'การตั้งค่ารหัสผ่านที่ไม่สอดคล้องกัน!',
    sameTip: 'รหัสผ่านเก่าจะต้องแตกต่างจากรหัสผ่านใหม่',
    lengthTip: 'โปรดตั้งค่ารหัสผ่านการชำระเงินสำหรับ 6 บิต',
    Change: 'เปลี่ยน',
    CurrentPhone: 'โทรศัพท์ปัจจุบัน',
    CurrentEmail: 'อีเมลปัจจุบัน',
    SetPhone: 'ตั้งค่าโทรศัพท์',
    SetEmail: 'ตั้งอีเมล'
  },

  redEnvelopeModule: {
    notStarted: 'กิจกรรมยังไม่เริ่ม',
    Scramble: 'แย่งชิงซองจดหมายสีแดง',
    StartLooting: 'เริ่มได้',
    Unfortunately: ' เสียใจมาก! ไม่รับอ่างเปา!',
    Keep: 'ไปต่อ! พยายามต่อไป!',
    snatched: 'อ่างเปาหมดแล้ว! มาครั้งหน้านะ!',
    Quit: 'เลิก',
    GO: 'ไป',
    Whoaa: 'โว้วว!คุณได้รับแพ็คเก็ตสีแดง',
    RemainingTime: 'เวลา ที่เหลือ'
  },

  consumptionDetails: {
    titleName: 'รายละเอียด',
    TransactionStatus: 'สถานะการทําธุรกรรม',
    AuditStatus: 'สถานะการตรวจสอบ',
    TradeObject: 'วัตถุการค้า',
    Coin: 'การแลกเปลี่ยนเงินตรา',
    BilINo: 'หมายเลขลำดับ',
    TradeTime: 'เวลาการค้า',
    BillingService: 'บริการเรียกเก็บเงิน',
    Wondering: 'สงสัยเกี่ยวกับคําสั่งซื้อหรือไม่?',
    bankCardNum: 'หมายเลขบัตรธนาคาร',
    bankCardUserName: 'ชื่อผู้ใช้บัตรธนาคาร',
    bankCode: 'รหัสธนาคาร',
    Copy: 'คัดลอก',
    InProgress: 'กำลังดำเนินการ',
    BeingProcessed: 'กำลังดำเนินการชำระเงินค่ะ',
    expired: 'คำสั่งหมดอายุ หรือหมดอายุแล้ว',
    Lock: 'ล็อค',
    trading: 'การซื้อขาย',
    Remark: 'หมายเหตุ',
    ActualCollectionUSDT: 'สะสมจริง',
    WithdrawalAmount: 'จำนวนเงินสด',
    actualAmount: 'จำนวน ที่ได้รับจริง'
  },

  orderStatusList: {
    1: 'ธุรกรรมความตั้งใจของผู้ซื้อ',
    4: 'ฝ่ายเติมเงินได้ชําระเงินแล้ว',
    5: 'การทําธุรกรรมสําเร็จ',
    6: 'การทําธุรกรรมล้มเหลว',
    7: 'คําสั่งที่พิพาท'
  },

  tradeStatusList: {
    1: 'การทําธุรกรรมสําเร็จ',
    0: 'การทําธุรกรรม',
    2: 'การทําธุรกรรมล้มเหลว'
  },

  casinoModule: {
    titleName: 'ช่อง',
    noData: 'ไม่มีข้อมูลเพิ่มเติม',
    enterGame: 'คุณต้องการ ที่จะเข้าสู่เกม หรือไม่',
    QuickTransfer: 'การถ่ายโอนอย่างรวดเร็ว',
    My: 'ของฉัน'
  },

  liveModule: {
    titleName: 'ออกอากาศคาสิโน',
    Categories: 'ประเภท',
    SortBy: 'เรียงตาม'
  },

  sportsModule: {
    titleName: 'กีฬา',
    enterGame: 'อยากเข้าแข่งกีฬามั้ยคะ?'
  },

  task: {
		Task: 'งาน',
		taskDetail: 'รายละเอียดงาน',
		mytask: 'งานของฉัน',
		unfnished: 'ไม่มีการตก แต่ง',
		completed: 'เสร็จสมบูรณ์แล้ว',
		TaskName: 'ชื่อทาส',
		TaskDescription: 'รายละเอียดงาน',
		TaskNumber: 'หมายเลขงาน',
		TaskMoney: 'เงินงาน',
		ALL: 'ทั้งหมด',
		Unfnished: 'ไม่มีการตก แต่ง',
		Completed: 'เสร็จสมบูรณ์แล้ว',
		Underway: 'ดำเนินการต่อ',
		DEposit: 'ฝาก',
		ongoing: 'กำลังดำเนินการ',
		failed: 'ล้มเหลว',
		finished: 'เสร็จสิ้น',
		claimed: 'ถูกอ้างสิทธิ์',
	},

  SattaKing: {
    Details: 'รายละเอียด',
    PackUp: 'เก็บของซะ',
    BetClose: 'เดิมพันปิด:',
    second: 'วินาทีก่อน',
    seconds: 'วินาทีก่อน',
    notes0: 'ทั้งหมด 0 หมายเหตุ',
    injection: 'ฉีดทั้งหมด 1 ครั้ง',
    shots: 'รวมช็อตแล้ว',
    InstantBet: 'เดิมพันทันที',
    LotteryTime: 'เวลาลอตเตอรี่',
    BettingContent: 'การพนันเนื้อหา',
    JodirRule: 'เลือกอย่างน้อย 1 ตัวเลข ที่เลือกไว้ก็เหมือนกับตัวเลขวาดรูปนั่นคือ ผู้ชนะ', //至少选择1个号码，选号与开奖号码一致，即为中奖。
    AndarRule:
      'เลือกเลขอย่างน้อยหนึ่งตัวจากหลักหน่วย และตัวเลข ที่เลือกก็เหมือนกับเลขวาดรูปในตำแหน่งเดียวกันนั่นคือ ผู้ชนะ', //从个位上至少选择1个号码，选号与相同位置上的开奖号码一致，即为中奖。
    BndarRule:
      'เลือกอย่างน้อยหนึ่งตัวจากสิบ และตัวเลข ที่เลือกเป็น เช่น เดียวกับตัวเลขวาดภาพในตำแหน่งเดียวกัน ที่เป็นผู้ชนะ', //从十位上至少选择1个号码，选号与相同位置上的开奖号码一致，即为中奖。
    stoppedBetTip: 'การเดิมพันถูกหยุดแล้ว!', //已停止下注！
    betContentEmptyTip: 'พนันว่า เนื้อหาไม่สามารถว่า งเปล่าได้!', //投注内容不能为空!
    betAmountEmptyTip: 'การเดิมพันไม่สามารถว่า งเปล่า!', //投注金额不能为空!
    betEmptyTip: 'โปรดเลือกหมายเลขการพนัน', //请选择下注号码
    insufficient: 'กระเป๋าสตางค์ไม่เพียงพอ!', //钱包余额不足!
    GameType: 'ชนิดของรูปแบบ',
    BettingContent2: 'เนื้อหา ที่ต่อเนื่อง',
    betMax: 'พนัน'
  },
  yueb: {
    TotalAmount: 'จำนวนรวม',
    Totalearnings: 'รายได้ รวม',
    Annualized: 'ต่อปี',
    TransferIn: 'ย้ายเข้า',
    Rollout: 'ออกโรลเลอร์',
    All: 'ทั้งหมด',
    freeze: 'บัญชีของคุณมีความเสี่ยง และไม่สามารถให้เครดิต หรือหักชั่วคราว',
    HeIp: 'HeIp',
    TransferOut: 'โอนเงินออกไปให้สมดุล',
    Mybalance: 'สมบัติสมดุลของฉัน',
    Earnings: 'รายได้',
    Balance: 'ความสมดุล',
    TransferInAmount: 'จำนวนการถ่ายโอน',
    TransferOutAmount: 'จำนวนการถ่ายโอน',
    Full: 'เต็ม ที่',
    EarningsLog: 'ปูมบันทึกของ รายได้',
    IncomeRule: 'กฎรายได้',
    frozen: 'บัญชีผู้ใช้ถูกแช่แข็ง',
    tip1: 'ไม่สามารถโอนเงินได้ 0 !', //转入金额不能为0
    tip2: 'จำนวนเงิน ที่โอนออกไม่สามารถเป็น 0 !' //转出金额不能为0
  },

  PersonalInformation: {
    title: 'ข้อมูลส่วนบุคคล',
    set: 'ตั้ง',
    Current: 'ปัจจุบัน',
    Username: 'ชื่อผู้ใช้',
    IdentityId: 'หมายเลขประจำตัว',
    UsernameEnter: 'โปรดป้อนชื่อผู้ใช้',
    IdentityIdEnter: 'โปรดป้อนหมายเลขประจำตัว'
  },

  winGo: {
    TimeRemaining: 'เวลา ที่เหลือ',
    Chart: 'สร้างแผนภูมิ',
    TrxWinGo: 'Trx ชนะไป',
    Block: 'บล็อค',
    BS: 'บี/เอส',
    Quantity: 'ปริมาณ',
    Reset: 'ตั้งค่าใหม่',
    BettingCloseTip1: 'พนันใกล้ก่อน ',
    BettingCloseTip2: ' วินาทีขอให้ทุกคนโชคดี'
  },
  pk10: {
    //新游戏
    gameHistory: 'ประวัติการเล่นเกม',
    OE: 'O/E'
  },

  chatRoom: {
    search: 'ค้นหา',
    syncing: 'กำลังซิงค์',
    messages: 'ข้อความ',
    contacts: 'รายชื่อผู้ติดต่อ',
    disconnect: 'คุณถูกตัดการเชื่อมต่อ',
    send_rpkt: 'ส่งซองแดง',
    random_rpkt: 'ซองแดงสุ่ม',
    normal_rpkt: 'ซองแดงปกติ',
    rpkt_count: 'จำนวน',
    enter_rpkt: 'กรอกจำนวน',
    pieces: 'ชิ้น',
    random: 'สุ่ม',
    total_amt: 'จำนวนรวม',
    single_amt: 'จำนวนเดียว',
    put_money: 'ใส่เงิน',
    back: 'กลับ',
    is_group: 'เป็นการสนทนากลุ่มหรือไม่?',
    max_rcv_cnt: 'จำนวนรับสูงสุด',
    cover_content: 'เนื้อหาที่แสดงบนปก',
    congrats: 'โชคดี',
    min_single: 'ซองแดงขั้นต่ำ',
    retry: 'ลองอีกครั้ง',
    set_up: 'ตั้งค่า',
    usr_cancel: 'ผู้ใช้ยกเลิก',
    welcome: 'ยินดีต้อนรับ',
    region: 'ภูมิภาค',
    phone_num: 'หมายเลขโทรศัพท์',
    enter_phone: 'กรอกหมายเลขโทรศัพท์',
    password: 'รหัสผ่าน',
    enter_pwd: 'กรอกรหัสผ่าน',
    login: 'เข้าสู่ระบบ',
    no_account: 'ยังไม่มีบัญชี',
    register: 'ลงทะเบียนตอนนี้',
    china: 'จีน',
    copy_success: 'คัดลอกสำเร็จ',
    contact: 'ติดต่อ',
    recent_sess: 'เซสชันล่าสุด',
    my_friends: 'เพื่อนของฉัน',
    my_groups: 'กลุ่มของฉัน',
    op_success: 'ดำเนินการสำเร็จ',
    op_failed: 'ดำเนินการล้มเหลว',
    forward_success: 'ส่งต่อสำเร็จ',
    send_success: 'ส่งสำเร็จ',
    start_group: 'สร้างกลุ่ม',
    grp_fsname: 'ตั้งชื่อกลุ่มสำหรับค้นหาในอนาคต',
    grp_members: 'สมาชิกกลุ่ม',
    people: 'ผู้คน',
    create_comp: 'สร้างเสร็จสมบูรณ์',
    create_succ: 'การสร้างสำเร็จ',
    upload_failed: 'การอัปโหลดล้มเหลว',
    profile: 'โปรไฟล์',
    avatar: 'รูปโปรไฟล์',
    nickname: 'ชื่อเล่น',
    gender: 'เพศ',
    birthday: 'วันเกิด',
    email: 'อีเมล',
    male: 'ชาย',
    female: 'หญิง',
    secret: 'ลับ',
    no_more_res: 'ไม่มีผลลัพธ์การค้นหาเพิ่มเติม',
    comprehensive: 'ครอบคลุม',
    group: 'กลุ่ม',
    chat_records: 'ประวัติการสนทนา',
    files: 'ไฟล์',
    related_records: 'ประวัติการสนทนาที่เกี่ยวข้อง',
    add_group: 'เพิ่มการสนทนากลุ่ม',
    add_friend: 'เพิ่มเพื่อน',
    cancel: 'ยกเลิก',
    no_search_res: 'ไม่พบผลลัพธ์ที่เกี่ยวข้อง',
    enter_grp: 'เข้าร่วมการสนทนากลุ่ม',
    or_phone_add: 'หรือหมายเลขโทรศัพท์',
    grp_chat_verify: 'การตรวจสอบการสนทนากลุ่ม',
    friend_verify: 'การตรวจสอบเพื่อน',
    send: 'ส่ง',
    join_group: 'เข้าร่วมกลุ่ม',
    friends: 'เพื่อน',
    apply: 'สมัคร',
    enter_content: 'กรอกเนื้อหา',
    joined_grp: 'คุณได้เข้าร่วมกลุ่มนี้แล้ว',
    get_sess_failed: 'ไม่สามารถดึงข้อมูลเซสชันได้',
    send_failed: 'ส่งล้มเหลว',
    set_note: 'ตั้งบันทึก',
    my_name: 'ชื่อของฉัน',
    number: 'หมายเลข',
    save: 'บันทึก',
    copy: 'คัดลอก',
    set_success: 'ตั้งค่าประสบความสำเร็จ',
    set_failed: 'การตั้งค่าล้มเหลว',
    modify_succ: 'การเปลี่ยนแปลงสำเร็จ',
    modify_failed: 'การเปลี่ยนแปลงล้มเหลว',
    server_addr: 'ที่อยู่เซิร์ฟเวอร์',
    address: 'ที่อยู่',
    biz_srv_addr: 'ที่อยู่บริการธุรกิจ',
    config_srv_addr: 'ที่อยู่บริการการกำหนดค่า',
    save_restart: 'บันทึกและเริ่มต้นใหม่เพื่อให้มีผล',
    name: 'ชื่อ',
    config: 'การกำหนดค่า',
    domain: 'โดเมน',
    friend_set: 'การตั้งค่าเพื่อน',
    add_to_bl: 'เพิ่มลงในรายการดำ',
    remove_friend: 'ลบเพื่อน',
    confirm_remove: 'คุณแน่ใจหรือไม่ว่าต้องการลบ',
    frd_rel: 'มิตรภาพของ?',
    user: 'ผู้ใช้',
    add: 'เพิ่ม',
    grp_nickname: 'ชื่อเล่นกลุ่ม',
    join_time: 'เวลาที่เข้าร่วม',
    join_method: 'วิธีการเข้าร่วม',
    send_msg: 'ส่งข้อความ',
    invite_group: 'เชิญเข้ากลุ่ม',
    scan_code_join: 'สแกนรหัสเพื่อเข้าร่วม',
    search_join: 'ค้นหาเพื่อเข้าร่วม',
    draft: 'ร่าง',
    items: 'รายการ',
    everyone: 'ทุกคน',
    someone: 'บางคน',
    you: 'คุณ',
    grp_announce: 'ประกาศกลุ่ม',
    pin: 'ปักหมุด',
    remove: 'ลบ',
    mark_read: 'ทำเครื่องหมายว่าอ่านแล้ว',
    pin_failed: 'การปักหมุดล้มเหลว',
    remove_failed: 'การลบล้มเหลว',
    connecting: 'กำลังเชื่อมต่อ',
    conn_failed: 'การเชื่อมต่อล้มเหลว',
    scan: 'สแกน',
    add_grp: 'เพิ่มกลุ่ม',
    exist: 'มีอยู่',
    grp: 'กลุ่ม',
    sgrp: 'กลุ่ม',
    sgrops: 'กลุ่มต่างๆ',
    apply_grp: 'สมัครเข้าร่วมกลุ่มนี้',
    qr_code: 'รหัส QR',
    scan_qr_code: 'สแกนรหัส QR ด้านล่าง',
    add_me_friend: 'เพิ่มฉันเป็นเพื่อน',
    join_grp_now: 'เข้าร่วมกลุ่มนี้ตอนนี้',
    apply_to_join: 'สมัครเข้าร่วม',
    say_hello: 'ทักทาย',
    agree: 'ตกลง',
    accept: 'ยอมรับ',
    refused: 'ปฏิเสธ',
    wait_verify: 'รอการตรวจสอบ',
    agreed: 'ตกลง',
    my_app: 'แอปพลิเคชันของฉัน',
    grp_notif: 'การแจ้งเตือนกลุ่ม',
    friend_req: 'คำขอเป็นเพื่อน',
    source: 'แหล่งที่มา',
    passed: 'ผ่าน',
    rejected: 'ปฏิเสธ',
    grp_mem_invite: 'คำเชิญสมาชิกกลุ่ม',
    search_grp: 'ค้นหากลุ่ม',
    scan_qr: 'สแกนรหัส QR',
    new_grp_chat: 'การสนทนากลุ่มใหม่',
    new_friend: 'เพื่อนใหม่',
    no_data: 'ไม่มีข้อมูล',
    grp_join_app: 'คำขอเข้าร่วมกลุ่ม',
    my_req: 'คำขอของฉัน',
    create_grp_chat: 'สร้างการสนทนากลุ่ม',
    full_use: 'ใช้งานเต็มที่',
    ask_admin: 'สอบถามผู้ดูแลหรือสมาชิกทีมเกี่ยวกับรหัส',
    scan_card: 'สแกนการ์ดธุรกิจรหัส QR',
    by_phone: 'โดยหมายเลขโทรศัพท์',
    search_add: 'ค้นหาและเพิ่ม',
    my_grps: 'กลุ่มของฉัน',
    my_created: 'สร้างโดยฉัน',
    my_joined: 'เข้าร่วมโดยฉัน',
    search_friend: 'ค้นหาเพื่อน',
    join_grp: 'เข้าร่วมการสนทนากลุ่ม',
    scan_to_join: 'สแกนเพื่อเข้าร่วม',
    grp_id_join: 'เข้าร่วมโดยรหัสกลุ่ม',
    confirm_rm: 'ยืนยันการลบสมาชิกกลุ่มที่เลือก',
    confirm_transfer: 'ยืนยันการถ่ายโอนเจ้าของกลุ่มไปยัง',
    question_mark: '?',
    grp_set: 'การตั้งค่าการสนทนากลุ่ม',
    dissolve_grp: 'ละลายกลุ่มแชท',
    exit_grp: 'ออกจากกลุ่มแชท',
    confirm_exit: 'คุณแน่ใจหรือไม่ว่าต้องการออกจากกลุ่มแชทปัจจุบัน?',
    confirm_dissolve: 'คุณแน่ใจหรือไม่ว่าต้องการละลายกลุ่มแชทปัจจุบัน?',
    work_grp: 'กลุ่มงาน',
    modify_grp_name: 'แก้ไขชื่อกลุ่มแชท',
    after_modify: 'หลังจากที่แก้ไขชื่อกลุ่มแล้ว',
    notify_mem: 'จะแจ้งให้สมาชิกคนอื่นในกลุ่มทราบ',
    downloading: 'ดาวน์โหลด',
    download_succ: 'ดาวน์โหลดสำเร็จ',
    saved_album: 'บันทึกในอัลบั้ม',
    save_failed: 'การบันทึกล้มเหลว',
    download_failed: 'การดาวน์โหลดล้มเหลว',
    select_by_fr: 'เลือกโดยเพื่อน',
    select_by_grp: 'เลือกโดยกลุ่มแชท',
    select_by_str: 'เลือกโดยกรอบ',
    view_more_contacts: 'ดูผู้ติดต่อที่เกี่ยวข้องเพิ่มเติม',
    view_more_grps: 'ดูกลุ่มที่เกี่ยวข้องเพิ่มเติม',
    view_more_records: 'ดูบันทึกแชทที่เกี่ยวข้องเพิ่มเติม',
    view_more_docs: 'ดูเอกสารที่เกี่ยวข้องเพิ่มเติม',
    new_messages: 'ข้อความใหม่',
    refused_by_recipient: 'ส่งข้อความแล้ว แต่ถูกปฏิเสธโดยผู้รับ',
    enabled_fr_verification:
      'ฝ่ายตรงข้ามได้เปิดใช้งานการตรวจสอบเพื่อน และคุณยังไม่ใช่เพื่อนของเขา/เธอ กรุณาส่งคำขอเป็นเพื่อนก่อน คุณสามารถแชทได้หลังจากที่ฝ่ายตรงข้ามผ่านการตรวจสอบ',
    listen_upload: 'ฟังการอัปโหลดไฟล์โดยการลากและวาง',
    drag_supports: 'การลากและวางรองรับเฉพาะภาพ',
    send_question: 'ส่ง',
    num_of_images: 'ภาพ',
    confirm: 'ยืนยัน',
    offline: 'ออฟไลน์',
    online: 'ออนไลน์',
    rpkt_info: 'ซองแดงของ',
    yuan: 'หยวน',
    credited_to_bal: 'เครดิตเข้าบัญชี สามารถใช้จ่ายได้ทันที',
    received: 'ได้รับ',
    total: 'รวมทั้งหมด',
    self_rcvd_info: 'ข้อมูลเกี่ยวกับซองแดงที่คุณได้รับเอง',
    self_sent_rpkt: 'เป็นซองแดงที่คุณส่งเองหรือไม่',
    rcv_comp: 'สถานะการตั้งค่าได้รับครบถ้วน',
    invite_mem: 'เชิญสมาชิก',
    select_remind: 'เลือกผู้ที่ต้องการเตือน',
    set_admin: 'ตั้งค่าผู้ดูแล',
    mute_mem: 'ปิดเสียงสมาชิก',
    rm_grp_mem: 'ลบสมาชิกกลุ่ม',
    grp_owner: 'เจ้าของ',
    remove_out: 'ลบออก',
    view_all_mem: 'ดูสมาชิกกลุ่มทั้งหมด',
    new_grp: 'กลุ่มใหม่',
    album: 'อัลบั้ม',
    shoot: 'ถ่ายรูป',
    rpkt: 'ซองแดง',
    ShareBet: 'แชร์เดิมพัน',
    image: 'ภาพ',
    video: 'วิดีโอ',
    take_photo: 'ถ่ายภาพ',
    record: 'บันทึก',
    reply: 'ตอบกลับ',
    grp_admin_mute_all: 'เจ้าของกลุ่มหรือผู้ดูแลได้เปิดใช้งานการปิดเสียงกลุ่มทั้งหมด',
    no_longer_in_grp: 'คุณไม่อยู่ในกลุ่มนี้อีกต่อไป',
    muted: 'คุณถูกปิดเสียง',
    added_to_blacklist: 'ฝ่ายตรงข้ามได้ถูกเพิ่มลงในรายชื่อดำ',
    msg_send_based_on: 'ข้อความที่ส่งอิงจาก',
    find_data: 'พบข้อมูลที่เกี่ยวข้อง',
    update_status: 'อัปเดตสถานะ',
    unsupported_type: 'ประเภทข้อความที่ไม่รองรับ',
    save_image: 'บันทึกภาพ',
    saved_to_album: 'บันทึกลงในอัลบั้มระบบ',
    issue: 'งวด',
    small: 'เล็ก',
    big: 'ใหญ่',
    double: 'คู่',
    single: 'คี่',
    issue_number: 'หมายเลขงวด',
    winning_number: 'หมายเลขที่ออก',
    sum: 'ผลรวม',
    size: 'ขนาด',
    single_double: 'คี่หรือคู่',
    select_lot_type: 'เลือกประเภทล็อตเตอรี่',
    hide_popup: 'ซ่อนป๊อปอัพตอนเริ่มต้น',
    show_popup: 'แสดงป๊อปอัพ',
    loading_issues: 'กำลังโหลดงวด',
    time_to_open: 'เวลาที่จะเปิด',
    drawing: 'การจับฉลาก',
    loading: 'กำลังโหลด',
    collapse: 'ย่อ',
    incorrect_issue: 'หมายเลขงวดไม่ถูกต้อง',
    draw_time: 'เวลาการจับฉลาก',
    open: 'เปิด',
    view_receipt: 'ดูรายละเอียดใบเสร็จ',
    see_luck: 'ดูโชคของทุกคน',
    rpkt_exceeded: 'หมดอายุ',
    rpkt_record: 'บันทึกซองแดง',
    wechat_rpkt: 'ซองแดงของ WeChat',
    unknown_type: 'ประเภทข้อความที่ไม่รู้จัก',
    tomorrow: 'พรุ่งนี้',
    yesterday: 'เมื่อวาน',
    year: 'ปี',
    month: 'เดือน',
    day: 'วัน',
    seconds: 'วินาที',
    just_now: 'เมื่อสักครู่',
    minute: 'นาที',
    hour: 'ชั่วโมง',
    days: 'วัน',
    emoji: 'อีโมจิ',
    have_friends: 'คุณเป็นเพื่อนกันแล้ว',
    start_chat: 'เริ่มแชท',
    crt_grp: 'สร้างกลุ่มแชท',
    invite: 'เชิญ',
    kick: 'เตะออก',
    left_grp: 'ออกจากกลุ่มแชท',
    grp_name: 'ชื่อกลุ่มคือ',
    grp_img: 'อวตารกลุ่ม',
    grp_intro: 'แนะนำกลุ่ม',
    mod: 'แก้ไข',
    trans_own: 'โอนเจ้าของกลุ่มไปที่',
    diss_grp: 'ละลายกลุ่มแชท',
    mod_grp_name: 'เปลี่ยนชื่อกลุ่มเป็น',
    trans_own2: 'โอนเจ้าของกลุ่มไปที่',
    left_grp2: 'ออกจากกลุ่ม',
    no_valid: 'ไม่พบเนื้อหาที่ถูกต้อง',
    period: 'ระยะเวลา',
    BettingRecord: 'บันทึกการเดิมพัน/แชร์',
    Share: 'แชร์',
    MultipleChoice: 'ตัวเลือกหลายตัวเลือก',
    SingleChoice: 'ตัวเลือกเดียว',
    SelectAll: 'เลือกทั้งหมด',
    CurrentSession: 'เซสชันปัจจุบัน',
    Complete: 'เสร็จสิ้น',
    ChooseOneTip: 'เลือกอย่างน้อยหนึ่งรายการ',
    NotDrawn: 'ยังไม่ได้จับฉลาก',
    GroupOwner: 'เจ้าของกลุ่ม',
    Administrator: 'ผู้ดูแลระบบ',
    ModifiedColor: 'สี',
    SelectColor: 'เลือกสี',
    BettingPeriod: 'หมายเลขช่วงการเดิมพัน',
    FollowInvestment: 'ติดตามการลงทุน',
    OrderSharing: 'การแชร์คำสั่ง',
    ShareBettingScheme: 'แชร์แผนการเดิมพัน',
    bet: 'เดิมพัน',
    bets: 'เดิมพัน',
    TotalAmount: 'จำนวนรวม',
    AccountBalance: 'ยอดคงเหลือในบัญชี',
    SingleBetAmount: 'จำนวนเดิมพันเดี่ยว',
    multiple: 'หลายรายการ',
    multiples: 'หลายรายการ',
    LoadMore: 'โหลดเพิ่มเติม',
    ShoppingCartEmpty: 'ตะกร้าสินค้าเปล่า',
    PageNotFound: 'ไม่พบหน้า',
    NoSearchResults: 'ไม่มีผลการค้นหา',
    NoShippingAddress: 'ไม่มีที่อยู่จัดส่ง',
    NoWiFi: 'ไม่มี WiFi',
    OrderEmpty: 'คำสั่งซื้อว่างเปล่า',
    NoCoupons: 'ไม่มีคูปอง',
    NoCollection: 'ไม่มีการเก็บรวบรวม',
    NoPermission: 'ไม่มีสิทธิ์',
    NoHistory: 'ไม่มีประวัติ',
    NoNewsList: 'ไม่มีรายการข่าว',
    MessageEmpty: 'รายการข้อความว่างเปล่า',
    ListEmpty: 'รายการว่างเปล่า',
    DataNull: 'ข้อมูลเป็นศูนย์',
    NoCommentsYet: 'ยังไม่มีความคิดเห็น',
    Selected: 'เลือกแล้ว',
    Remove: 'ลบ',
    BeBeingSent: 'ส่งแล้ว',
    Open: 'เปิด',
    loading2: 'กำลังโหลด...',
    Declined: 'ปฏิเสธ',
    PendingVerification: 'รอการตรวจสอบ',
    Agreed: 'เห็นด้วย',
    selectAny: 'เลือกหลายรายการ',
    selecOne: 'เลือกหนึ่งรายการ',
    nowChat: 'แชทล่าสุด',
    nowForword: 'ส่งต่อล่าสุด',
    sendTo: 'ส่งไปยัง',
    sharingSuccess: 'แชร์สำเร็จ',
    backGamePage: 'กลับไปที่หน้าเกม',
    toImPage: 'อยู่ที่หน้าช่องแชท',
    District: 'เขต',
    MobilePhone: 'หมายเลขโทรศัพท์มือถือ',
    EnterMobileNumber: 'กรุณาใส่หมายเลขโทรศัพท์มือถือของคุณ',
    Password: 'รหัสผ่าน',
    EnterPassword: 'กรุณาใส่รหัสผ่าน',
    LogIn: 'เข้าสู่ระบบ',
    NoAccount: 'ยังไม่มีบัญชีใช่ไหม?',
    RegisterNow: 'ลงทะเบียนตอนนี้',
    CopySuccessful: 'คัดลอกสำเร็จ',
    SuccessfulForwarding: 'การส่งต่อสำเร็จ',
    DescriptionFailed: 'ไม่สามารถรับข้อมูลเซสชั่นได้',
    ApplyToJoin: 'สมัครเข้าร่วม',
    GreetSb: 'ทักทายใครสักคน',
    Agree: 'ตกลง',
    Accept: 'ยอมรับ',
    SuccessfulOperation: 'การดำเนินการสำเร็จ',
    OperationFailure: 'การดำเนินการล้มเหลว',
    MyApplication: 'ใบสมัครของฉัน',
    GroupNotification: 'การแจ้งเตือนกลุ่ม',
    FriendRequest: 'คำขอเพื่อน',
    FailedGetList: 'ไม่สามารถดึงรายการได้ โปรดลองอีกครั้ง',
    ShareSuccess: 'การแชร์การเดิมพันสำเร็จ',
    article: 'บทความ',
    possessor: 'ผู้ครอบครอง',
    SomeoneYou: 'ใครบางคน @คุณ',
    GroupAnnouncement: 'การประกาศกลุ่ม',
    Pinned: 'ปักหมุด',
    MarkRead: 'ทำเครื่องหมายว่าอ่านแล้ว',
    RoofFailure: 'การปักหมุดล้มเหลว',
    RemovalFailure: 'การลบล้มเหลว',
    BeDownloading: 'กำลังดาวน์โหลด',
    DownloadedSuccessfully: 'ดาวน์โหลดสำเร็จ, บันทึกลงในอัลบั้ม',
    SaveFailure: 'การบันทึกล้มเหลว',
    DownloadFailure: 'การดาวน์โหลดล้มเหลว',
    FailedObtainPersonal: 'ไม่สามารถรับข้อมูลส่วนบุคคลได้',
    RecentlyUsed: 'ถูกใช้เมื่อสักครู่',
    AllStickers: 'สติกเกอิทั้งหมด',
    addContacts: 'เพิ่มในรายชื่อผู้ติดต่อ',
    finish: 'เสร็จสิ้น',
    notes: 'บันทึก',
    myAccount: 'หมายเลขบัญชีของฉัน',
    account: 'บัญชี',
    chatMessages: 'ข้อความแชท',
    groupName: 'ชื่อกลุ่ม',
    GroupCode: 'รหัส QR กลุ่ม',
    groupNotice: 'ประกาศกลุ่ม',
    notSet: 'ยังไม่ได้ตั้งค่า',
    groupMute: 'ปิดเสียงกลุ่ม',
    groupTransfer: 'โอนเจ้าของกลุ่ม',
    groupAdministrator: 'ผู้ดูแลกลุ่ม',
    stickyTop: 'ติดอยู่ที่ด้านบน',
    clearHistory: 'ล้างประวัติแชท',
    groupChat: 'แชทกลุ่ม',
    savePicture: 'บันทึกรูปภาพ',
    edit: 'แก้ไข',
    groupCanEdit: 'เฉพาะเจ้าของกลุ่มและผู้ดูแลเท่านั้นที่สามารถแก้ไขได้',
    inputNotice: 'ประกาศการป้อนข้อมูล',
    editing: 'กำลังแก้ไข',
    quit: 'ออก',
    exitEdit: 'ออกจากการแก้ไขนี้หรือไม่?',
    confirmNotification: 'ยืนยันการปล่อยประกาศกลุ่ม',
    clearNotification: 'ยืนยันการลบประกาศกลุ่ม',
    allMute: 'ปิดเสียงสมาชิกทั้งหมด',
    muteTips: 'หลังจากปิดเสียงสมาชิกทั้งหมด จะมีเพียงเจ้าของกลุ่มและผู้ดูแลเท่านั้นที่พูดได้',
    viewMoreMembers: 'ดูสมาชิกกลุ่มเพิ่มเติม',
    selectMaster: 'เลือกเจ้าของกลุ่ม',
    chatDetails: 'รายละเอียดแชท',
    administratorTips1: 'ผู้ดูแลสามารถช่วยเจ้าของกลุ่มในการจัดการแชทกลุ่มและสามารถลบสมาชิกกลุ่มได้',
    administratorTips2: 'เฉพาะเจ้าของกลุ่มเท่านั้นที่สามารถตั้งผู้ดูแลและยกเลิกแชทกลุ่มได้',
    addMembers: 'เพิ่มสมาชิก',
    removeAdministrator: 'ยืนยันการลบผู้ดูแล',
    administrativeRights: 'ยกเลิกสิทธิการจัดการ',
    selectMembers: 'เลือกสมาชิกกลุ่ม',
  },
  uView: {
    modal: {
      confirmText: 'ยืนยัน',
      modalcancelText: 'ยกเลิก'
    },
    search: {
      placeholder: 'กรุณาใส่คำค้นหา',
      actionText: 'ค้นหา'
    },
    loadmore: {
      LoadMore: 'โหลดเพิ่มเติม',
      loading: 'กำลังโหลด',
      noData: 'ไม่มีข้อมูลเพิ่มเติม'
    }
  },
  LongQueue: {
    Issue: 'ปัญหา',
    title: 'คิวยาว',
    desc: 'คำอธิบาย',
    desca1: 'ผู้ช่วยคิวยาว เป็นเครื่องมือช่วยที่ติดตามและนับผลลอตเตอรี่และอนุญาตให้เดิมพันได้อย่างรวดเร็ว',
    desca2:
      'ความน่าจะเป็นของผลลอตเตอรี่แต่ละผลเท่ากัน หากผลลอตเตอรี่เหมือนกัน 3 งวดติดต่อกันหรือมากกว่า จะเรียกว่า "คิวยาว" โดยปกติจะใช้วิธีการทบเงินเพื่อ "ตัดมังกร" หรือ "ตามมังกร"',
    desca3: '"ตัดมังกร" คืออะไร?',
    desca4: 'หากมีการเดิมพัน "คี่" ติดต่อกัน 5 งวด คุณสามารถเลือกเดิมพัน "คู่" แผนการเดิมพันนี้เรียกว่า "ตัดมังกร"',
    desca5: '"ตามมังกร" คืออะไร?',
    desca6: 'หากออก "คี่" ติดต่อกัน 5 งวด ให้เลือกเดิมพัน "คี่" ต่อไป แผนการเดิมพันนี้เรียกว่า "ตามมังกร"',
    desca7: 'การทบเงินคืออะไร?',
    desca8:
      'การทบเงินเป็นวิธีการเพิ่มเงินเดิมพันสองเท่า ซึ่งเป็นวิธีการเพื่อให้ได้กำไรต่อเนื่องในกระบวนการ "ตัดมังกร" หรือ "ตามมังกร"'
  },

  luckyWheel: {
    // 首页
    title: 'วงล้อแห่งโชค',
    amountReceived: 'จำนวนที่ได้รับ',
    pendingAmount: 'จำนวนที่รอดำเนินการ',
    onlyCash: 'อีกเพียง <span class="unit">{unit}</span>{amount} ก็สามารถถอนเงินได้',
    drawingRecords: 'บันทึกการวาด',
    cash: 'เงินสด',
    redEnvelope: 'ซองแดงแบบสุ่ม',
    start: 'เริ่ม',
    restart: 'รีสตార్ท',
    activityEnd: 'กิจกรรมสิ้นสุด',
    // 详情页
    details: 'รายละเอียด',
    drawRecord: 'บันทึกการจับคู่',
    assistanceRecord: 'บันทึกการช่วยเหลือ',
    winCash: 'ชนะเงินสด',
    luckyDraw: '1 การจับฉลากโชคดี',
    // 规则页
    rules: 'กฎ',
    activityRules: 'กฎกิจกรรม',
    withdrawalHistory: 'ประวัติการถอน',
    // 分享弹窗
    speedUp: 'เร่งการจ่ายเงินลอตเตอรี',
    shareLink: 'แบ่งปันลิงก์',
    shareLinkTip: 'โค้ดได้ถูกคัดลอกแล้ว เชิญเพื่อนๆ เพื่อเร่งการถอนเงิน',
    shareLinkShortOf: 'แค่ต่ำกว่า {amount} ในการถอน',
    // 助力成功弹窗
    assistSuccess: 'เพื่อนของคุณ {name} ช่วยให้คุณประสบความสำเร็จ',
    assistSubTitle: 'ส่งหมายเลขการจับรางวัลการถอนเงินสดที่เร่งขึ้นให้คุณ',
    congratulations: 'ขอแสดงความยินดี',
    assistReceive: 'จำนวนการจับฉลากโชคดีที่ชนะ',
    times: 'ครั้ง',
    confirm: 'ยืนยัน',
    // 奖励弹窗
    onWinning: 'เกี่ยวกับการชนะ',
    // 提现弹窗
    withdrawalTip: 'คุณกำลังจะถอนเงิน กรุณายืนยันข้อมูลการชำระเงิน',
    remittanceAmount: 'จำนวนเงินโอน',
    remittanceAccount: 'บัญชีการโอนเงิน',
    remittanceChannel: 'ช่องทางการโอนเงิน',
    wallet: 'กระเป๋าเงิน',
    withdrawalSuccessful: 'การถอนเงินสำเร็จ!',
    // 活动已达上限弹窗
    limitTitle: 'ถึงจำนวนสูงสุดแล้ว',
    limitDesc: 'คุณได้ถึงจำนวนครั้งสูงสุดที่เข้าร่วมกิจกรรมแล้ว ขอบคุณสำหรับการสนับสนุนและการเข้าร่วมของคุณ',
    // 其他玩家提现弹窗
    bringInPeople:
      'นำ <span class="people">{num}</span> คนเข้าสำหรับการถอนเงิน <span class="amount">{amount}</span> สำเร็จ',
    easyWithdrawals: 'การถอนเงินนั้นง่ายมาก',
    anotherPeopleWithdrawn: 'อีก <span class="num">{num}</span> คนได้ทำการถอนเงินแล้ว!',
    // 第一次进入领取页
    entryTitle: 'ซองแดงโชคดี <br> ที่ไม่เหมือนใครของคุณ',
    entrySubTitle: 'การโอนเงิน <br> เงິນฝากบัญชีทันเวลา',
    withdrawalTimes: 'นี่คือการถອນเงินครั้งที่ <span class="hightlight">{num}</span> ຂອງคุณ',
    freeSpins: 'วงล้อแห่งโชค ให้คุณ <text class="hightlight">{num} ฟรีสปิน</text>',
    congratulationsReceiving: 'ยินดีด้วยที่ได้รับ {amount}! มาถอนมันตอนนี้เลย!',
    receive: 'รับ',
    haveReceived: 'คุณได้ทำการรับแล้ว'
  },
  luckyBox: {
    draws: 'การจับฉลาก',
    record: 'บันทึก',
    congratulationsTo: 'ขอแสดงความยินดี',
    forObtaining: 'สำหรับการได้รับ',
    throughTheLuckyBox: 'ผ่านกล่องโชคดี',
    draw1Times: 'จับฉลาก 1 ครั้ง',
    draw5Times: 'จับฉลาก 5 ครั้ง',
    draw10Times: 'จับฉลาก 10 ครั้ง',
    rewards: 'รางวัลกล่องโชคดี',
    insufficientQuantity: 'จำนวนไม่พอ',
    cash: 'เงินสด',
    memberExp: 'ประสบการณ์สมาชิก',
    entity: 'องค์กร',
    coupon: 'คูปอง',
    memberPoints: 'คะแนนสมาชิก',
    congratulationsReceiving: 'ขอแสดงความยินดี',
    theLuckyBoxReward: 'รางวัลกล่องโชคดี!',
    confirm: 'ยืนยัน',
    rule: 'เปิดกล่องสมบัติรับรางวัลมากมาย ลองทําตอนนี้',
    receptionRecord: 'บันทึกการรับรางวัล',
    allRecord: 'ทั้งหมด',
    issuedRecord: 'อนุญาต',
    drawnRecord: 'จับฉลาก',
    notDrawnRecord: 'ไม่จับฉลาก',
    abnormal: 'ผิดปกติ',
    boxErr: 'กล่องสมบัติผิดปกติ กรุณาติดต่อฝ่ายสนับสนุน'
  },
  promotions: {
    checkIn: 'เช็คอิน',
    dailyRewards: 'เช็คอินทุกวันเพื่อรับรางวัลมากมาย',
    luckyBox: 'กล่องนำโชค',
    luckyBoxDesc: 'เปิดกล่องโชคดีจะทำให้คุณได้รับรางวัล',
    luckyWheel: 'วงล้อโชคดี',
    luckyWheelDesc: 'การเปิดวงล้อโชคดีจะทำให้คุณได้รับรางวัล',
    joinNow: 'เข้าร่วมตอนนี้',
    comeSoon: 'มาเร็ว ๆ นี้'
  },
  // 优惠券
  coupon: {
    all: 'ทั้งหมด',
    unused: 'ไม่ได้ใช้',
    used: 'ใช้แล้ว',
    expired: 'หมดอายุ',
    over: 'สิ้นสุด',
    type: 'ประเภท',
    expirationDate: 'วันหมดอายุ',
    usageRules: 'กฎการใช้งาน',
    receiveTime: 'เวลาที่ได้รับ',
    expirationTime: 'เวลาหมดอายุ',
    useConfirm: 'คุณแน่ใจหรือไม่ว่าต้องการใช้คูปองเติมเงิน?',
    no: 'ไม่',
    yes: 'ใช่',
    useSuccess: 'ใช้คูปองสำเร็จ',
    useNow: 'ใช้ตอนนี้',
    cash: 'เงินสด',
    memberPoints: 'คะแนนสมาชิก',
    transactionRebate: 'เงินคืนจากการทำธุรกรรม',
    vipPoints: 'คะแนน VIP'
  },
  point: {
		myPoints: 'คะแนนของฉัน',
		pointsMall: 'ห้างคะแนน',
		pointsRules: 'กฎคะแนน',
		winPoints: 'ชนะคะแนน',
		pointDetails: 'รายละเอียดคะแนน',
		pointRecord: 'บันทึกคะแนน',
		all: 'ทั้งหมด',
		luckyBox: 'กล่องโชคดี',
		cash: 'เงินสด',
		scratch: 'ขูด',
		systemGift: 'ของขวัญจากระบบ',
		systemDeduction: 'การหักเงินจากระบบ',
		exchanged: 'แลกเปลี่ยนแล้ว',
		exchange: 'แลกเปลี่ยน',
		points: 'คะแนน',
		SigningIn: 'กำลังเข้าสู่ระบบ',
		signIn1: 'เข้าสู่ระบบ',
		days: 'วัน',
		SignReminder: 'การแจ้งเตือนการเข้าสู่ระบบ',
		miss: 'พลาด',
		today: 'วันนี้',
		signIn: 'เข้าสู่ระบบ',
		signSuccess: 'เข้าสู่ระบบสำเร็จ',
		collect: 'เก็บ',
		pointRules: 'กฎคะแนน',
		exchangeRecord: 'การเปลี่ยนแปลง',
		exchangeSuccess: 'การแลกเปลี่ยนสำเร็จ',
		todayNoSign: 'วันนี้ฉันไม่ได้ลงชื่อเข้าใช้',
		continuouslySignedFirst: 'ฉันได้ลงชื่อเข้าใช้อย่างต่อเนื่องเป็นเวลา',
		continuouslySignedLast: 'วัน',
		noTasks: 'ไม่มีงานเพิ่มเติม',
		noExchanging: 'การแลกเปลี่ยนไม่รองรับในขณะนี้',
		pointSmall: 'คะแนน',
		pointsRedemption: 'การแลกคะแนน',
		redemptionConditions: 'เงื่อนไขการแลก',
		themRedeem: 'กรุณาแลกมันโดยเร็วที่สุด',
		nextSignTime: 'จนถึงการเช็คอินถัดไป.',
		fistWord: 'เหลือเวลาอีก ',
		hours: ' ชั่วโมงและ',
		minutes: 'นาที',
		againParticipation: 'เราหวังว่าจะได้เห็นการเข้าร่วมของคุณอีกครั้ง',
		comeCheckIn: 'คุณยังไม่ได้เช็คอิน! มาที่นี่และเช็คอินตอนนี้!',
		introduction: 'บทนำ',
	},
  dateOptions: {
    AllDates: 'ทั้งหมด',
    Today: 'วันนี้',
    Yesterday: 'วันก่อน',
    Last7Days: '7 วันที่ผ่านมา',
    Last30Days: '30 วันที่ผ่านมา',
    Last90Days: '90 วันที่ผ่านมา',
    ThisWeek: 'สปสัปดาห์นี้',
    LastWeek: 'สปสัปดาห์ที่แล้ว',
    ThisMonth: 'เดือนนี้',
    LastMonth: 'เดือนที่แล้ว'
  },
  source: {
    activity: 'การได้มาซึ่งกิจกรรม',
    integral: 'การแลกเปลี่ยนคะแนน',
    purchase: 'การซื้อของผู้ใช้',
    system: 'การได้มาของระบบ'
  },
  Feedback: {
    title: 'ความคิดเห็น',
    add: 'ความคิดเห็นใหม่',
    questionType: 'ประเภทคำถาม',
    problemDescription: 'คำอธิบายปัญหา',
    problemScreenshot: 'ภาพหน้าจอปัญหา',
    contactAccount: 'บัญชีติดต่อ',
    submit: 'ส่ง',
    pleaseFillInAllFields: 'กรุณากรอกทุกฟิลด์',
    detail: 'รายละเอียดความคิดเห็น',
    replyContent: 'เนื้อหาการตอบกลับ',
    replyContentTip: 'กรุณากรอกเนื้อหาการตอบกลับ',
    PhotoUpload:'อัปโหลดภาพ',
  },
}
